[
{"text": ["\"I have used Buspar for 10 yrs I take 60 mg by taking 20mg in morning 20mg in the afternoon and 20mg at bedtime. It helps me sleep and I have energy all day. My anxiety is never over a 1 on a scale of 1-10. I love this medication it goes well with my Viibryd 40mg.\"", "(taken for 10 years or more)", "November 15, 2018"]},
{"text": ["\"I have been taking buspirone for almost a year and a half. I was nervous to take anything stronger after coming off Ativan, and stayed just on buspirone for a year before deciding to add Pristiq. It is the perfect combo for me. Buspirone alone definitely took the edge off my daily anxiety but in high-stress situations it just wasn't enough. I was taking 25 mg daily. I now take 10mg daily, only at night, and 50 mg of Pristiq. I feel a lot more stable. My side effects are increased skin sensitivity and more vivid dreams. I did have brain fog after taking it during the day (which would last about a half-hour after I'd take it) but once I started taking Pristiq at night that stopped. I recommend trying it-- it's so safe and has so few side effects that it's an easy bet. The worst-case scenario is that it won't work, in my mind. It's also VERY cheap-- I paid less than $8 for a month's supply and I have awful insurance.\"", "November 13, 2018"]},
{"text": ["\"I started the medication for my anxiety and bipolar. The first dose was not bad, but the second dose it took my 2 hours before I could get up, I was so dizzy and light headed. Made my panic attacks worse and felt so spaced out. I have a terrible headache that keeps coming and going.\"", "(taken for less than 1 month)", "November 5, 2018"]},
{"text": ["\"Life changed. Lexapro 20mg and buspirone 15mg/ twice a day for almost 2 years. I have felt a difference for a while now, but it’s finally completely working for me. I am the happiest I have been in a very long time. I’m a better Mother, wife and person. \nOCD could get better, but I’m optimist that it will kick its butt too.\"", "(taken for 2 to 5 years)", "November 1, 2018"]},
{"text": ["\"After starting buspirone I didn't pay much attention to it. But I have noticed after I skipped several days of dosing meds that my thoughts was getting too intense about problem that I was going through - to the point where you get very angry, depressed, almost suicidal. That state felt for more than 20 hours until I realized that I had to take med again. After I took 10mg buspirone my brain started to not getting into much detail what I was thinking. Just looses a focus, sharpness of mind, like you are loosing extra short memory where all thoughts are starting. It will help in keeping your mind not getting to worry about something but costs you the price of memory and concentration.\"", "October 17, 2018"]},
{"text": ["\"My doctors were reluctant to put me on benzos because I had a brief history of drug use. They offered buspar as an alternative, it was one of if not the worst medication I’ve ever taken. It felt like Benadryl that created the most uncomfortable physical sensation and the only thing I could do was lay down in bed and wait for it to wear off. Not recommended.\"", "(taken for less than 1 month)", "October 14, 2018"]},
{"text": ["\"I have been on buspar for 2 years and it has made my life easier. Very good medication for severe anxiety out in crowded places or the city life. I am able to go out now and can handle doing things I could never do before due to my anxiety. Unfortunately it is starting to be a bit less effective than when I first got on it but it has made a big difference in my life. A wonderful medication!!\"", "(taken for 1 to 2 years)", "October 13, 2018"]},
{"text": ["\"This medication has been a godsend for me. I'm unable to take SSRIs or SNRIs and had recently increased my dose of Wellbutrin XL (which had driven up my anxiety). The Buspar has significantly improved my anxiety symptoms and I find myself happier and more outgoing since starting it. It has mild sexual side effects on me but they are quite tolerable compared to what I have experienced in the past (if there's any chance a med like this will cause sexual side effects on somebody, I seem guaranteed to have them, no matter how small the chances). Buspar has also caused exertional headaches for me. I'm not a fan of needing to take it twice per day but it is a small tablet and easy enough to keep with me in a key fob.\"", "(taken for 1 to 6 months)", "October 12, 2018"]},
{"text": ["\"Whenever I take it I feel like I was high I would be so completely out of it that if I wasn't somewhere where I could go lay down I would go crazy. It would make me so sleepy. When I was on it the next day I didn't remember what happened to myself after taking it or I wouldn't remember how I feel asleep or remembering walking in my house to go to bed.  Just a complete blackout. People would tell me and I wouldn't remember. It didn't do anything to help my anxiety all it did was get me so drugged up that it would knock me out into a deep sleep. Wake up feeling like I couldn't breathe\"", "(taken for 1 to 2 years)", "October 7, 2018"]},
{"text": ["\"I had the same experience as kat5528 on September 21, 2018. I wasn't myself at all on it. I would be mad at my kids for no reason and cry for no reason. It was nuts on this med. Hated it so did my kids.\"", "(taken for 1 to 6 months)", "October 5, 2018"]},
{"text": ["\"This medicine may work well for some people, but I wanted to share my experience because it wasn’t pleasant.  After 2 weeks of taking buspirone, I thought I was going to die.  One morning at work I noticed heart palpitations, then got extremely dizzy and almost passed out three times before a coworker brought me to urgent care.  I stayed very dizzy with severe anxiety / panic attack’s that lasted for a week.  I had to miss several days of work.  This was the first time I had experienced anything like this.\"", "(taken for less than 1 month)", "September 24, 2018"]},
{"text": ["\"This drug has been a miracle for me. I have all the symptoms of what one physician termed \"profound anxiety.\" NO DOCTOR until I found the right psychiatrist had even mentioned this drug. I've tried a lot of both tricyclic and SSRI and SNRI meds. All they did was give me side effects that made me feel worse. The benzodiazepines are addictive and not for a long term fix since their side effects and lasting effects are not good for the aging brain (I'm 75.)\"", "(taken for less than 1 month)", "September 22, 2018"]},
{"text": ["\"So far it hasn't done anything other than decrease my anxiety by about 10%. I'm still having almost constant anxiety mixed with common occurrences of panic attacks.\"", "(taken for 1 to 6 months)", "September 21, 2018"]},
{"text": ["\"My Psychiatrist prescribed 10mg twice daily. I was so irritable on this medication. I was mad at my family for no reason. The littlest thing would make me so angry I would start to cry. I wasn’t me on this medication plus it brought on more anxiety. I continued to take the medication for about 4 weeks to see if that side effect would subside but I couldn’t take it any longer. I haven’t been able to find any other person with that side effect. This medication does work for a lot of people so don’t get discouraged!\"", "(taken for 1 to 6 months)", "September 21, 2018"]},
{"text": ["\"I am extremely thankful this drug exists.  It has changed my life.  I suffer from PTSD from a previous illness and it has relieved my anxiety, 5 years of muscle tension and given me a clear mind.  Really mild side effects at 20MG a day.\"", "(taken for 1 to 6 months)", "September 20, 2018"]},
{"text": ["\"I actually felt a difference the second day but, it did take over a week to really work. I had severe anxiety from PTSD, after about 9 days on it....I feel so much better! Don't even need anti depressants now, honestly.\"", "(taken for 1 to 6 months)", "September 15, 2018"]},
{"text": ["\"every time I take buspirone it clouds my brain and I have ringing in my ears. I don't take it anymore. Switched to sertraline and duloxetine\"", "(taken for 1 to 6 months)", "September 12, 2018"]},
{"text": ["\"Why do I not feel good in the morning but I do feel good in afternoon.   Take same dosage of buspar in morning as in afternoon\"", "September 12, 2018"]},
{"text": ["\"Works!!!Had immediate results. No panic attacks, but must remember same time everyday with food!\"", "(taken for 1 to 6 months)", "September 12, 2018"]},
{"text": ["\"I'm currently prescribed 15mg three times a day. My experience is that you can feel it's \"effects\" in 20 minutes, the effects for me are as follows: some sort of fuzzy sensation of waves being pulsed through my body every 10 seconds or so, I should mention the sensations of electricity waves would be at a pain level of 0, it's not painful as much as it is a bit annoying, the main annoyance being I've found that it makes standing up or moving quickly after sitting down make you feel out of breath, for example sometimes I'll have to brace myself and grab onto something as to not almost collapse. I'm 22. It has also very much so increased my overall libido . I don't notice any panic/anxiety/avoidance reduction effects, even at peak plasma concentration, I've come to the conclusion it doesn't seem to help my troublesome symptoms.\"", "(taken for 6 months to 1 year)", "September 8, 2018"]},
{"text": ["\"Didn't helped at all just made my anxiety worse  and gave me bad headaches and no energy only on it for three weeks\"", "(taken for less than 1 month)", "September 1, 2018"]},
{"text": ["\"Did not really do anything except make me feel a bit dizzy, unfortunately.\"", "(taken for 1 to 6 months)", "August 30, 2018"]},
{"text": ["\"When my doctor talked with me about this medication I was a little  skeptical about the drug it’s self.  But before I buckled down and decided to go see a doctor, about 2-3 months prior I’d be dealing with a very horrible life experience at the age of 23 years old I had just undergone a horrible very traumatic experience that involved a wreck in an semi truck, that knocked me out stone cold. I was knocked on the left side of my temple and received cuts in my head. I was having bad anxiety, panic attacks after the wreck, went to visit a doctor who prescribes this medication Busiprone I gave it a chance tried it, stayed on the prescription a little over a year. It was definitely helping me. I unfortunately couldn’t get the next refill of it. There are days I feel as if I know it would help me greatly now and I could really use it today and there are days I know it would help me,  100%  .\"", "(taken for 6 months to 1 year)", "August 28, 2018"]},
{"text": ["\"I was first prescribed Buspar a few years ago when my anxiety was much, much worse and neither my doctor nor I wanted me to start taking benzos. About a year into it I stopped taking it because it was making me a little too relaxed during the day, but I started it again last fall at a lower dose and I've only had positive experiences with it since. I will say it's probably more for milder GAD. I am now dealing with some pretty fresh PTSD after a violent assault a couple years ago and I've found the combination of Buspar and Lamictal to be perfect for this. I have a very high tolerance so I can't speak to any of the negative side effects, but I can say that this is milder than most but still effective enough to continue taking.\"", "(taken for 2 to 5 years)", "August 26, 2018"]},
{"text": ["\"30 mg day, age 70, female, white with lifelong chronic depression, +anxiety=bipolar. I have had  40 years of psych med, individual therapy & my 2 pm 10mg gets me thru day w/o suicidal thoughts. + 30 yrs drag as multiple personalities. Have tried it all\"", "(taken for 1 to 2 years)", "August 19, 2018"]},
{"text": ["\"I'm supposed to take 5mg twice a day but I wanted to start with just 5 mg once a day to see if there were any side effects and I must admit there are with only 1 dose a day so I'm definitely apprehensive about taking it twice a day. The main thing I have noticed is dizziness! Its horrible, I take it in the middle of day so I don't drive but I do have to drive for work sometimes so I'm not sure I can take this drug if the dizziness keeps up. Does the dizziness go away?\"", "(taken for less than 1 month)", "August 13, 2018"]},
{"text": ["\"I've always had crippling anxiety. This medication relieves me from my anxiety without taking a scheduled medication (Xanax, Valium, Ativan, etc) and coming up in a drug screen. This medication hasn't taken my anxiety totally away (and everyone has a normal amount of anxiety), but it has diminished significantly. I've had no side effects while on this medication (I take 60mg a day) and I've been taking it for about 6 years.\"", "(taken for 5 to 10 years)", "August 12, 2018"]},
{"text": ["\"My Dr.  prescribed  Buspar 5 .  I felt drugged with no energy. \nNow taking 2.5 twice a day and feel more relaxed and energetic. \nExperiment with different doses before you give up. The Dr. doesn't have a clue what dose you can tolerate as everyone is different\"", "August 8, 2018"]},
{"text": ["\"I started on 10mg and it has done very little for me. My doc has upped it to 20 mg but  this drug feels like a placebo. It’s done nothing to ease my PTSD symptoms and I am feeling very despondent about it , I will give it a zero for relief , the only thing it’s doing is make the big pharma rich .\"", "(taken for 1 to 6 months)", "August 8, 2018"]},
{"text": ["\"I started with 10 mg 3 times a day for anxiety and panic disorder. Related to Asperger's syndrome. It didn't help fully it  and was still way out of control, so they added Xanax to take with it. For the first few months not much help still having high tension and anxiety. At this point in time I'm taking 30 mg 3 times a day of buspar with about .50 mg of xanax 4 times a day. It is a bit more stable but my tics are coming back and so are my triggers for the asperger's. Its like riding a bull and weighing my options.\"", "(taken for 6 months to 1 year)", "August 7, 2018"]},
{"text": ["\"Feeling angry and still have lots of anxiety.  Trouble sleeping taking 10mg in morning and late afternoon.  It's been almost 4 months and still anxious.  Started Lamictal 3 weeks ago. Not sure if there is an interaction.\"", "(taken for 1 to 6 months)", "July 31, 2018"]},
{"text": ["\"Buspirone did absolutely nothing for my generalized anxiety disorder, no positives and no negatives, just nothing. I started on 5mg and over 8 weeks increased to 40mg, still felt no different so just stopped. I was gutted as it seemed a safer option than antidepressants. I would not recommend.\"", "(taken for 1 to 6 months)", "July 31, 2018"]},
{"text": ["\"I currently take 5mg of buspirone before bedtime.  I have taken this drug for about 4 months. After a couple weeks, I felt it helped with my anxiety. I am now feeling very anxious on a daily basis. I feel unbalanced and unsteady.  My blood pressure is good and no signs of any other medical issues. I feel dizziness daily. I’m wondering if anyone else has had these experiences on buspirone? My doctor ordered a carotid ultrasound and CT scan.  She never suggested that it could possibly be the buspirone.  I called the pharmacist today and they said busiprone can be stopped or taper taking my dose every other day.  I’m sick of feeling anxious, dizzy, and unsteady. Again, has anyone experienced these side effects?\n\nThanks,\"", "(taken for 1 to 6 months)", "July 30, 2018"]},
{"text": ["\"BuSpar has significantly reduced general anxiety in my life. The first couple weeks, I felt a little out of it, almost buzzed, especially when going from 10mg to 20mg, but nothing unmanageable. To this day, I still have this sporadic and strange eye pressure that comes after I take a pill, but it's usually gone within 15 minutes. \n\nBuSpar helped me through what otherwise would have probably been an extremely stressful divorce. The number of thoughts of imagined scenarios that rarely happen have been eliminated to almost zero. I'm also much more social and as such, confident.\n\nIt hasn't helped with some things like adrenaline and subsequent anxiety from things like public speaking, but that's why there's Xanax.\n\nIt's not a cure all, but it's still 10/10 if you have general anxiety.\"", "(taken for 1 to 6 months)", "July 22, 2018"]},
{"text": ["\"It works alright on my days off when I'm not doing much. But when I have a busy day and I have to be out in public it doesn't do much at all for my anxiety.\"", "(taken for 1 to 2 years)", "July 1, 2018"]},
{"text": ["\"They recently increased my dosage by only 5 mg. With disastrous results.  Big increase in anxiety attacks.  Bad Drug.  Caused me to experience 5 anxiety attacks in 24 Hours!  A new record for the number of anxiety attacks that I’ve ever had in 24 Hours!  And they want to slowly increase it to 60 mg a Day.  No way!  Feel like rubbish!  And that’s just with a small increase!\"", "(taken for 1 to 6 months)", "June 27, 2018"]},
{"text": ["\"This medicine actually increases my anxiety and makes sleeping so hard to obtain.\"", "(taken for 1 to 2 years)", "June 27, 2018"]},
{"text": ["\"Definitely curbs my generalized anxiety, and helps with my social anxiety, it’s not a cure all, as I still have insomnia but it has definitely improved my quality of life. SSRIs never worked for me because I felt like my depression was rooted in anxiety and not the other way around, plus SSRIs gave me panic attacks and so did trazadone after two weeks. I take 1/2 a 7.5 as soon as I wake up and then I take another half again a couple hours later then a whole one a couple hours before bed. The first two or thee days it made me feel slightly funny but it’s definitely beginning to level off and I’m definitely much more content, less rumination, and a general feeling of well-being this far...\"", "(taken for less than 1 month)", "June 15, 2018"]},
{"text": ["\"I have started this medication generic from manufacturer Mylan and had bad reactions by 10 fold but I had stuck it out hoping it would work.  Then I had received my next  prescription from a different maker - came in a bar form and to my surprise this was a total different feel of medication. \"How is this possible? More of a sedative feeling instead of such anxiety over the top which worried me so much that I decide I have to stop this medication  and ween off.  It's disturbing to think you want to get better but how can you if the generics you are prescribed are different from each other.  I go through Kaiser and so far disappointed with how things are all handled. Stick with one manufacturer not multiple different manufacturers of a medication as they are different...\"", "June 10, 2018"]},
{"text": ["\"I have been down a long road. I had gotten inappropriate sinus tachycardia with stopping a beta blocker. And was put in another heart medicine to control my heart rate with less weaning side effects. Anyways they diagnosed me IST (Inappropriate Sinus Tachycardia). But since being off the medicine my heart rate has been fine. Not over 100 bpm. Anyways took 2.5 mg of buspar last night and my heart rate has been under control. I just want to cry cause I haven't seen my heart normal without being on a heart medicine even then it didn't really help much. I guess I found my miracle drug and my heart rate was due to anxiety since doctors give me high anxiety and panic\"", "(taken for less than 1 month)", "May 23, 2018"]},
{"text": ["\"I found that I felt more focused and it calmed me down a great deal. It did make me feel a little dizzy at first, but that could be because, I'm also taking keppra and losarten and amlodopine - the last two I've taken for one month and the Keppra I just started yesterday - so that could be the reason. But overall the buspar makes me feel good and I don't feel the despair and tension like I was going to explode. Hopefully this medication will also help me with my blood pressure that was out of control. The highest was 239/200 it is now 169/93 it's better..so we will see...\"", "(taken for less than 1 month)", "April 26, 2018"]},
{"text": ["\"I'm on 15mgs of Buspar a day, its been 2 months and its not working that well. It evens me out a little but I still get anxiety attacks. I'm also gaining weight because of sugar cravings.\"", "(taken for 1 to 6 months)", "April 15, 2018"]},
{"text": ["\"Where has this medication been for the last 5 years? I am on day 3 and I finally feel normal again and I never thought that was possible because I didn’t even know what normal for me was anymore. My life had caught up to me, 4 kids (including 2 yr old twins), career and just a demanding household has weighed on my life heavily. I had become an angry person, an angry and short fused mom. I began yelling, which I had never done before. I regretted it but my anxiety/stress level would reach a boiling point and I couldn’t control it. I just wasn’t a happy person. I called my dr and asked for help. I’m currently on 75mg Effexor for depression. She added Buspirone 5mg 3x a day. This was a game changer. Day 3 I’ve completely noticed a change. Things that bothered me before don’t bother me anymore. I’m able to rationalize with my children rather than yell. This medicine is helping me be a better parent and I’m so thankful. I am HAPPY and I never thought I could say that.\"", "April 15, 2018"]},
{"text": ["\"For years I've been taking buspirone for anxiety. It has been extremely helpful and have not had any side affects.\"", "(taken for 2 to 5 years)", "April 12, 2018"]},
{"text": ["\"I have severe social anxiety, I've had it my whole life. I was on ativan for years and I wanted to get off them. So my dr. prescribed me Buspiron ( busbar), well what a nightmare.!!! The first few days I felt like I was going to die. My heart was raising, I could feel my heart  pounding out of my chest, couldn't sleep, made me speed like crazy awful. Scared me so bad. It was so bad  about a week in, I had to go to ER. It made my anxiety 100 times worse. I had to go to ER in a ambulance, I couldn't breathe. I only gave the a 1 because I had to put something, otherwise it would have been 0. If you have bad anxiety I wouldn't recommend this. But if it work for you thats great, we are all different, but it was a total nightmare for me.\"", "April 8, 2018"]},
{"text": ["\"Quit drinking cold turkey after 2 years of life altering changes. Never had anxiety. Well I do now. Crippling scary moments only about midday. Morning and evening I'm fine which is weird. Was scared to death to take a med like this because other than high BP I'm good to go. Broke down and tried one 5mg dose. About an hour later I felt smooth. Was told 5mg 12 hours. I take 5mg 3 times a day. Usually every 4 hours so 15mg. 4 months sober and a month after starting Buspar it's a life saver for me. I've read that it doesn't work for everybody and everybody I'd different I understand. But it has done the trick for me so far. I tried every vitamin concoction and drink known to man with no luck. It made me very dizzy the fist couple weeks. Now I don't even notice taking it except feeling more calm. Not recommending taking it like I do but it works for me.\"", "(taken for less than 1 month)", "April 6, 2018"]},
{"text": ["\"I've had anxiety for several years with full blown panic attacks that have sent me to the ER. Fortunately, I've kept those at bay for the last year, but I still get anxiety at night. I finally decided to go to the doctor but didn't want a benzo. I was prescribed 15mg tabs, I take one at night...and it does absolutely nothing for my anxiety. If anything, it makes me a tad drowsy. Not what I was hoping for.\"", "(taken for less than 1 month)", "March 30, 2018"]},
{"text": ["\"I've been on Buspar for 5 mths. My doc gave me 15mg. After a week I couldn't even describe how great it felt not to be so constantly worried about everything. \nI did end up getting depressed (but that had already started due to other things), and my anxiety seemed to get a bit worse for a couple months. Doc then put me on 150mg of Wellbutrin which takes 4-6 wks to kick in. During that time (1st 4 wks) I was VERY depressed & anxiety & panic attacks were very bad (had my worst panic attack ever), but then she upped my Buspar to 25mg which helped calm down the anxiety and panic attacks. 4 wks after starting Wellbutrin she upped that to 300mg. In a week depression disappeared & anxiety calmed down and its been 4 wks since.\nI think it takes the right dose and combo of meds as well as continuing for a bit through the rough patch that sometimes comes with new meds while trying to get the dose right. Don't give up too soon.\"", "March 29, 2018"]},
{"text": ["\"Now at 5mg at three times a day it finally started working for me--calmer on a day to day basis. It took about a month before I could really feel a difference. Well, if this is good, I think, let's get the doctor to up it to 7.5mg three times a day. What a difference--but not in a good way! I felt foggy and dizzy and my mood swings were worse. More is not always better.\"", "(taken for 1 to 6 months)", "March 28, 2018"]},
{"text": ["\"Makes my anxiety tremendously worse, even after months of use! Don't believe the fake big pharma comments. This is not a replacement for any benzo, in any way! It is only 'known' to be 'effective' in general anxiety disorder. AFter my switch I couldn't sleep for a week, dehydrated, thought I was gonna die, so then they gave me Zoloft in conjunction with the buspar that I was already on for 2 months! The Zoloft made it even worse, I am surprised to be alive and writing this today.\"", "March 27, 2018"]},
{"text": ["\"I started 10mg today and I feel so loopy, my mouth is very dry, and kind of anxious and my head is hurting after 1 dose.  I don't know if I will take a 2nd dose.  I was prescribed 10mg 2x day.\"", "(taken for less than 1 month)", "August 29, 2016"]},
{"text": ["\"I've been on this for two weeks. I went to my doctor because I was experiencing anxiety and worry way to often, for too long. I tried to manage it on my own, but the feelings persisted. I made an appointment for a psych, but the wait was three months. I assumed I had to go to a psych for medication management but a friend told me my doctor could prescribe something.  My doctor gave me a script for 7.5 mg twice a day. Soon after, the constant knot in my stomach and consistent worry subsided. I see that people say it takes a while for this to work, but I feel like I had pretty quick results. I have had no side effects on this med thus far.\"", "August 22, 2016"]},
{"text": ["\"I was recently prescribed Cymbalta for depression.  It helped but I felt very jittery and anxious on it. My doctor added Buspar and now I feel very much calmer and in control. I take 30 mgs twice a day.\"", "August 21, 2016"]},
{"text": ["\"I just started taking buspirone today and I hate it, my heart feels like it's going to explode my leg won't stop shaking I feel even more antsy my stomach feels bloated my mouth would open a little bit I believe it even affects my mood because I ended up having 0 tolerance for anything. I would not recommend this medicine to anyone and I just started it today. It's 10mg twice a day I will not continue taking this no matter what the doctor says.\"", "(taken for less than 1 month)", "August 21, 2016"]},
{"text": ["\"Anxiety was eating me alive! Finally I went to my Dr to ask for help. I started with 7.5 mg twice a day and she worked me up to 15mg twice a day. I feel so much better! I'm sleeping like a log now because anxiety is not keeping me awake or waking me up. I do feel hot and a little shaky about 20 minutes after I take it but it don't last very long, maybe 30 minutes. I'm also losing some much needed weight. Probably because I'm not eating at night since I'm actually sleeping through the night for the first time in my life! This stuff changed my life for the better!\"", "August 20, 2016"]},
{"text": ["\"I've only taken buspar 7.5 for 2 days now, I've been prescribed 7.5 2x day, but until the side effects go away, I'm not about to take 2 a day. Within 20 minutes or so after taking  (with food), my head starts whooshing and I'm very dizzy (almost feel drunk/high). It lasts about an hour then I feel better. Is this someone else has experienced? Is it something that will go away? Is the side effect an allergy to the drug? Basically, I'm taking to get rid of anxiety/ panic attacks and help me to need less xanax. With these side effects I'll need MORE xanax!! Lol \"", "(taken for less than 1 month)", "August 20, 2016"]},
{"text": ["\"I have been taking buspar for 4 months now and it has helped pretty well for my anxiety. I take 3 10mg a day. I mostly like it because it helps with the extra anxiety and slight depression i get from the come down off of my adderall i take for adhd every day too. The only side effects I've had from the buspar has been nausea but as long as i eat a little bit of food whenever i take them it subsides that pretty well so i would recommend it to anyone with the same situation.\"", "(taken for 6 months to 1 year)", "August 19, 2016"]},
{"text": ["\"After years of klonopin/Xanax & zolft, MY so-called Dr switches me to Buspar& Lexapro. This is the most worthless bunch of junk medicine ever created. It just sent me into benzo withdrawals !!! Horrible ones that last days. I have to find another Dr that had mercy on me and put me back on Xanax.\"", "(taken for less than 1 month)", "September 11, 2017"]},
{"text": ["\"Started 3wks. ago, have stayed on it but awful side effects, can't get through to my doctor without having an even greater Anxiety Attack than I'm already having. This medication Goes right up on the Top Worse Self for Bad Medications I have been on. \nShaking inside, dry chalky mouth & throat, upset stomach, vomiting, nervousness & even more emotional than normal (if that's possible).\nIt feels like everything that's wrong with me has been intensified!\"", "(taken for less than 1 month)", "August 25, 2017"]},
{"text": ["\"This medication is great!! I've been suffering severe anxiety for three years now, and I finally decided to get on some medication for it. Zoloft didn't work for me, and made me feel horrible, so we tried buspar next. The only side effects I got was slight dizziness and feeling fuzzy for the first three days and then I was fine.\nI'm definitely way less anxious now, and it was great. I suggest giving it a try if its just anxiety and not depression, cause that's what things like Zoloft focus on.\"", "(taken for 1 to 6 months)", "August 14, 2017"]},
{"text": ["\"I have been fighting High BP and anxiety for 11 year with no relief. Tried every class of BP meds and SSIR meds. Its early yet but my BP is down from 170/100 to 130/80. I just switched to Buspar 10 mg twice a say, Nifedipine 30 mg and 0.5 mg clonazepam. I'm praying this is the magic bullet. Don't give up!\"", "(taken for less than 1 month)", "August 9, 2017"]},
{"text": ["\"Feel very uncomfortable, shaking, feels like pulses/shocks through my body, doesn't help what my #worthlessDoctor said it would.\"", "(taken for less than 1 month)", "August 9, 2017"]},
{"text": ["\"Have been taking 5mg twice a day for the last 4 days, stopped taking it today. It was like I had drank 6 Redbulls. Jittery, sweating, dizzy, nauseous, twitching. The Welbutrin I take is awesome, not a single side effect, but needed something more for some anxiety. But I had to stop taking this, just waaaay to gnarly even for a bigger guy like me.\"", "(taken for less than 1 month)", "August 8, 2017"]},
{"text": ["\"I love this drug! I started 4 yrs ago when I was just starting recovery from sex addiction and childhood sexual abuse and trauma, and I started out on just 5 mg/day. Within a week, I noticed my anxiety significantly lessen. Within 3 weeks, I was able to stop compulsively having sex with a new guy every week. It helped me get my life back on track, and about 9 months later, I finally started taking it as prescribed (5mg twice per day,) and the difference was even more significant. I slept better, had fewer racing thoughts, and I stopped obsessing about my therapist as much. It didn't cause any weight gain and had virtually no side effects after the initial blurry vision for the first few days. Highly recommend Buspar!\"", "July 29, 2017"]},
{"text": ["\"I've been on this for 2 days so far. 7.5mg twice a day. Every time I take this, I feel weak, shaky, and like I need to lay down because I think I'm going to faint. I've notice a slight change in my worries so far but only because nothing major has happened. I hope the side effects go away because I have horrible anxiety and I don't want to take xanex due to my brothers addiction to them and my grandpas anxiety that made him out of it so it worries me. If this doesn't work I don't know what else to do. I hope this works for people who have severe anxiety like me that avoids anything social, worries constantly, racing thoughts, etc.\"", "(taken for less than 1 month)", "July 27, 2017"]},
{"text": ["\"I have been on Buspar for about 2 months now for anxiety from keppra. It seems to work sometime but when I get an anxiety or panic attack it hits hard. I was on 5mg twice a day and now my dose is really high. Like today it seems to have no effect. And I'm always lightheaded dizzy fogged out feeling. And my other doctor said to try Xanax.\"", "(taken for 1 to 6 months)", "July 24, 2017"]},
{"text": ["\"I was prescribed this drug for anxiety I took it home and managed to take it for 2 days but immediately noticed severe insomnia that after two days made me stop taking it. On top of the inability to sleep despite feeling tired I had absolutely zero appetite. In the little over 48 hours I had only managed to eat a handful of cherries... \nHowever when I was on the drug I did notice less irritability and increased fatigue which I attributed to not sleeping or eating.\"", "(taken for less than 1 month)", "July 24, 2017"]},
{"text": ["\"I started talking this medication last Monday and was only on it for 4 days before I had to quit. I had so many of the different side effects of this drug like lack of appetite, stomach upset, extremely worse anxiety than I had before I started and extreme drowsiness during the day but insomnia at night. It was an absolute nightmare for me but that doesn't mean it wouldn't work for someone else.\"", "July 22, 2017"]},
{"text": ["\"I've been on Buspirone for many years. I also take Lamotrigine (Lamictil).  I have a less anxiety but a lot of social anxiety still. What I didn't connect, until reading a lot of fellow Buspirone takers here, is that the faintness I get (feeling like I'll pass out if I don't sit) and also about every 3 months I get the dizzyness.  Sometimes when I lay down in bed the ceiling looks like it's spinning wildly.  I always have to bring snacks with me everywhere for those times of faintness.  I thought they were just how I am normally.  I'll have to check with my doctor. I'd have thought she'd have brought that up before :(  I don't remember if I had the other symptoms of some here, with the headaches and nausea.  Too long ago.\"", "July 20, 2017"]},
{"text": ["\"I started out on 5 mg, 3 times day and am now at 10 mg 3-4 times a day. I've experienced no side effects. I do feel less anxiety (constant worry, easily irritated), but feel it come back about 5 hours later. It has taken the edge off of social anxiety but has taken about 2 months to get there. It is a mild anti anxiety med. It doesn't make you feel drugged or spaced out. It helps to give you the ability to stop the anxious thoughts but doesn't seem to do it all for you. I have ADD as well and take Wellbutrin along with Buspar. I have taken Lexapro and although it does wonders for anxiety it also caused me to feel a bit manic over time. Lexapro also wiped out my memory. I have a grandson now and I want to remember and be at my best for him.\"", "(taken for 1 to 6 months)", "July 12, 2017"]},
{"text": ["\"I just started taking this medication a few days ago, I will write an update later as I give it more time. Thus far my side effects have been a slight numbing of my mouth, I am extremely sensitive to medication and this has happened with other meds I have taken so I am not alarmed by this. I am taking it with food and I do feel a bit of slight nausea and tiredness about an hour after taking it, I also feel a bit spaced but I am hoping these will subside over time. It isn't anything unmanageable at this time, I am on a very low dose 2.5 mg BID, it isn't what the doctor prescribed but after talking with my pharmacist about my sensitivity to meds he said I could build up to the dose. I was prescribed 5 mg BID to increase if needed.\"", "August 18, 2016"]},
{"text": ["\"my experience was very positive\"", "(taken for less than 1 month)", "August 14, 2016"]},
{"text": ["\"I have taken buspar for 5 months. Prescribed max dose of 15mg 4x/day. It took a couple weeks to actually notice the difference. I don't feel like a zombie after taking it. I really just came to the realization one day while driving to work, an activity that used to leave me recovering from an anxiety attack, was suddenly a very simple task. My social anxiety, much improved. It's very subtle, but after sticking with it, I can look back and I see that it changed my life. It does make me sleepy, in a walking around functioning while yawning kind of way and I get a lot of headaches. The good definitely outweighs The bad. I can take a lower dosage on easy days and still have a positive outcome. also take 150mg of Zoloft and 25 mg Wellbutrin\"", "(taken for 1 to 6 months)", "August 14, 2016"]},
{"text": ["\"I have been on this drug for about 9 days now. I started off with a pill twice a day for a week and now I'm taking it 3 times a day. Honestly my anxiety is still here full force. I depend on my girlfriend to go with me everywhere but now I have to get used to her being gone so now I've been getting more anxiety trying to go out and do stuff on my own. I just want to be happy and be able to go run my errands. Buspirone didn't even touch my anxiety. I became very angry and irritable and it's starting fights between me and my girlfriend. She had to leave me by myself today because my anger was stressing her out. I've developed an \"I don't care\" attitude and it has freaked me out. I'm done taking this drug. Everyone is different but be cautious.\"", "August 13, 2016"]},
{"text": ["\"I had a lot of stomach issues - IBS-D.  I suspected it might be due to anxiety.\r\n\r\nBuspirone has made a huge difference.  I can live a normal life without being in fear of the stomach issues coming up at the most inconvenient times.  I feel comfortable eating out and going to people's houses.  I used to take four immodium a day to control the stomach issues.  Now, I rarely take it.  Buspirone also had a very gradual effect...things kept getting better. I had to recently reduce the dose a bit as I'd get dizzy after taking it but it still works.\r\n\r\nDoctors had insisted that I try antidepressants first.  The side effects (several brands and low doses) were awful and the medications didn't help.\"", "August 13, 2016"]},
{"text": ["\"Ive been on Buspar for about 6 months or so for anxiety. I first started off taking 5 mg 2 times a day. Then went to 10 mg 2 times a day.\r\nLately I have a I do not care attitude! This is not me. \r\nI see my doctor tomorrow. I think I would rather be on the lower dose and still have some anxiety and care....rather than the I do not care attitude\"", "August 4, 2016"]},
{"text": ["\"This is scary. Doctor put me on this 3 weeks ago. Made my depression horrible. Im extremly mean to my 2 year old.  I have passed out twice  one of which i crashed my car in a field! I have dry mouth, dizzyness, shaking, my body will jerk. I have a rash on my neck, constipation, insomnia. Im exhausted but just cant sleep. And that's  all i want is to sleep!!! And ive probably eaten a handful of pretzles  in the last week. I feel so sick all the time :( and im on a low dose!\"", "(taken for less than 1 month)", "August 3, 2016"]},
{"text": ["\"I personally don't think it works that great however, I also take prozac and the buspar was prescribed to \"boost\" the prozac. Sorry to say but  personally, I didn't notice a difference, I wish they would have just boosted up my Prozac instead. Also, I take 3 7.5 mgs a day of boat and 60 mg of prozac\"", "(taken for 1 to 6 months)", "July 28, 2016"]},
{"text": ["\"I take 10mg twice a day, with food. Pamphlet says to take either with or without food, but be consistent. Only frequent side effect is tiredness, but I was always tired anyway. Infrequently I will get dizzy and nauseated for about 40 minutes after taking depending on how much caffeine I have had or how long after a meal I wait to take it. \r\nI noticed results after the first few doses, though I was warned that it may take longer. My mood has noticeably improved as well as my ability to handle day-to-day tasks like talking on the phone. I still have situational based anxiety, but that is more manageable than general anxiety.\r\nI have noticed that if I am a few hours late for a dose I get irritable for the next few doses.\"", "(taken for 1 to 6 months)", "July 18, 2016"]},
{"text": ["\"I like that it calms me down but I'm sleepy all day. I don't like feeling sleepy, I have things to do. It does help me get a great nights sleep. I sleep like a rock but wake up still feeling drowsy. \r\nSo anyway- may not take it anymore unless its at night from time to time since it works rather quickly with for me. \r\n\r\nYawwnnnn!!! \r\n\r\nAC\"", "July 13, 2016"]},
{"text": ["\"its helpful but doesn't cover the day\"", "(taken for less than 1 month)", "July 11, 2016"]},
{"text": ["\"It has done great for me. I used to \"bite my kids' heads off\" in the mornings and startle a lot easier, for examples. I can also take it in small doses at a time to keep from sleeping all day from the side effects.\"", "(taken for 2 to 5 years)", "July 11, 2016"]},
{"text": ["\"was on 20 mg Cipralex  then doctor added q\r\n150 Buspar within 2 weeks my anxiety and depression got a lot worse, trouble sleeping and uncontrolled shaking Not for me\"", "July 4, 2016"]},
{"text": ["\"Started a 90 day prescription right after I had my daughter and it was horrible. Gave me anxiety and terrible panic attacks. I had to hop in a cold shower once. I felt as if I was gonna have a heart attack or my chest explode. Just got prescribed wellbutrin hoping to have better luck.\"", "June 21, 2016"]},
{"text": ["\"My anxiety was extremely bad and I had tried lexapro but the side effects for me were horrible; so my doctor started new on BuSpar. I've been on it now going on two weeks and I can say I do feel a slight difference. My anxiety is still there but not as bad... I'm still having attacks off and on but I'm going to stick with this and give it some more time. The only side effect I have is the dizziness but I've learned if I eat even just a piece of toast that it helps with that. Other than that no side effects. I say if your suffering give this a try and stick with it.\"", "June 20, 2016"]},
{"text": ["\"I had depression for years and in that last 8 months that turned into anxiety that gave severe shoulder and abdominal pain , sweaty palms and pounding heart , ruined my career and my social life and affected my decision making . Finally after trying to fight it with out using medication I had to go see a doctor because I couldn't take it anymore , doctor gave me buspirone and recomanded 3x 5mg a day . I started with 1 5mg every 24 hours and I can tell a difference , I am calm and I sleep better . The physical pain is almost gone which I assume was happening due to surge of my stress hormones which are now under control . It has been 3 days of peace and quite and hope it stays this way .\"", "June 17, 2016"]},
{"text": ["\"One week on, started full dose yesterday. 30m. \r\nNo side effects, and no haziness.\r\nI get slightly dizzy but doesn't interfere with walking. \r\nI have tried 3 others before this, And each time I had flu symptoms, couldn't leave the bathroom, couldn't work or take care of my children.\r\nThis medicine has been nothing but great for me, I haven't had a headache or the tremors for a few days which is already life changing! I can focus, and I have slowly realized that my mind is quieting down:) if nothing has worked for you, please give this a try! No addiction to it they say.. \r\nI'm excited that I feel this great:) I can't wait to see what next week and the week after is. I'm looking forward to tomorrow, which is a foreign feeling. \r\nGood luck:)\"", "June 13, 2016"]},
{"text": ["\"Ive been on 15 mg 2x daily for one week now. After taking Xanax for years, I tried to stop and ended up having a seizure and hospitalized for a few days. The doctors there prescribed me the buspirone, and I have not experienced any anxiety so far. I am now sleeping through the night which was a huge concern for me since I was going days with little to zero sleep. Only problem now is I could sleep all day! And I constantly have a dull headache. I try to ignore it and carry on, but its there all the time. I dont want to go back to benzos but they seem to have the best results.. I'll check back in a month with an update.\"", "June 11, 2016"]},
{"text": ["\"How this \"medication\" ever got approved is beyond me. In my case, I have been taking the maximum dose allowed (60 mg per day) for months, and my reaction is a big yawn. Zip, nada nothing. Doesn't help with anxiety, and forget my panic attacks. Too bad my docs refuse to give me Xanax (alprazolam) any more... guidelines! I guess I'm supposed to chew on a stick when I get anxiety or panic attacks. Right.\"", "(taken for 1 to 6 months)", "July 12, 2017"]},
{"text": ["\"I started Buspar 2 days ago, I'm not sure if is working, my personal situation is creating chaos in my life and anxiety and panic attacks are everyday occurrences. I'm having serious problems to be able to sleep after 2 am ( always woke up and can't go back to sleep). Today I'm trembling and have terrible headache, nausea and tiredness. I don't know if continue this med or stop it before I get worse. Can anybody experience this side effects the first days and then got better???, I don't know what to do and I can't stand still.\"", "(taken for less than 1 month)", "July 8, 2017"]},
{"text": ["\"I experienced my very first Anxiety attack three months ago, stemming from stress from work and eventually from fear of dying (provoked by the symptoms of the attacks). I began to fear nights, because they occurred at night, preventing me from properly sleep. I went two months without seeking medical help, until I did. I was diagnosed with Generalized Anxiety Disorder. They prescribed me BuSpar/Busporine; I've been on it for a little over a month now (7.5m.g. twice a day) and OH MY GOSH, it saved my life. I haven't had an anxiety attack since the first day I began taking it! The first week, the only side effects I got were feeling groggy in the morning, but at night when you take it they do help you immensely to fall asleep.\"", "July 5, 2017"]},
{"text": ["\"I just started this, I am on my third day my Anxiety has not gotten any better.\nI am wondering how long  it takes to help? I just want to feel like my old self again.\"", "(taken for less than 1 month)", "July 2, 2017"]},
{"text": ["\"Thought this was a miracle drug for me. At first I was taking 5 mg a day twice a day with no side effects. NO SIDE EFFECTS, it was a dream!  Since I tried all the SSRIs with no luck, due to intolerable side effects I had very high hopes.  Once day six came around I started to feel the drug working more.  That night I came home after working two 12 hour shifts back to back,  and I had the worst insomnia of my life. I have NEVER EVER had trouble sleeping after my twelve hour shifts. I was up for almost 24 hours it was so bad and I was absolutely exhausted and miserable. Needless to say, I deemed the insomnia not worth taking this drug.\"", "(taken for less than 1 month)", "June 30, 2017"]},
{"text": ["\"This medication did not work for my anxiety.  BuSpar actually allowed my anxiety to increase with severe insomnia and vivid dreams.  It also caused severe stomach and intestinal problems.  I also experienced dizziness irritability and incoordination.  There are other symptoms from BuSpar these are the main ones that caused me to stop  taking the drug.\"", "June 29, 2017"]},
{"text": ["\"I was on 15 mg of buspirone for many months. I recently lost my job and have a lot of anxiety and depression. I am seeing a psychiatrist who said my dose was too low and upped it to 60 mg a day. I still don't feel like it is working. I am also on Zoloft. I still am having a lot of anxiety. Years ago I was on Ativan and it was a miracle drug for me. I would like to stop the buspirone and just take the Ativan as needed. I see my psychiatrist in a couple weeks and am going to suggest that. I also have the feeling of a huge lump in my throat that I know is stress related.\"", "(taken for 1 to 2 years)", "June 28, 2017"]},
{"text": ["\"Developed anxiety and panic again after not having it for 30 years.  Could  have been triggered by an attack of vertigo.  Dr. put me on Buspar 10mg twice a day.  I was also on Prozac 20 mg once a day and Clonopin 0.5mg once at night for years and felt just fine.  The Buspar made me spacey and did not help the anxiety.  They reduced it to 5mg twice a day.  Still a little spacey and did not help anxiety.  Upped my Clonopin to an extra 0.5mg in morning and 0.25mg in afternoon.  Buspar is not helping.  Going to ask my doctor to change to something else.  Been on it almost a couple of months.  Any help anyone can give me?  Thanks so much.  I am also afraid to be alone at home since hubby works 2nd shift but is going to 1st shift next week which will help.\"", "(taken for 1 to 6 months)", "June 27, 2017"]},
{"text": ["\"I've been on this for about 3 weeks now. At first I thought it was helping my anxiety a bit but then I realized it was just making me tired and loopy after I took it, and that's worn off now (which is good but now I realized it wasn't helping). Giving it 3 stars because it didn't hurt me except for the tired loopy feeling, and I can't orgasm easily at all. Also my appetite is gone so I've lost some weight, which is nice except having no appetite meant I wasn't taking in enough calories so I was even more tired. Basically it was just pointless and didn't help.\"", "(taken for less than 1 month)", "June 27, 2017"]},
{"text": ["\"I used buspar 5mg once every few years.  It's very good for me and very mild.  I tried double dosage once and I was groggy.  But on 5mg, I was perfectly normal.  When I get my anxiety attack (once every decade or so) my hands shake, can't eat, color of my face goes pale....  but immediately soon after taking buspar, I feel much better.\n\nPlease note that these medication don't work just as well on everybody.  The nature of psychotropic medication would work wonders on one person, and horribly or not at all one another person.  You gotta keep trying until you find something that works for you.\"", "(taken for less than 1 month)", "June 26, 2017"]},
{"text": ["\"I was very nervous to take any medication but after trying therapy, some meditation & self-help. I decided to try buspirone. Other stuff helped to some extent. I was so anxious.  To start I split 7.5 pills in half and started at 7.5mg a day.  After a month I increased it to 3 times a day. Again I split 7.5 in half so I'm taking 3 times a day for a total of 11.25 mg a day total current dosage last (6) months Pros: I did start to feel less anxious, I didn't like overreact to stress like I used to. I still get anxious but its prob decreased by about 60-70% which is fine. Some anxiety is fine. I'm glad I take it. Cons: Do feel tired especially first month or two and sometimes still. I currently added Bupropion (Wellbutrin) for depression.\"", "(taken for 6 months to 1 year)", "June 26, 2017"]},
{"text": ["\"Started taking the lowest dose, when that seemed ineffective the doctor upped the dosage, a few times. The entire time I was on the medication I had horrible dizzy spells. I had to time my taking it just right so I would be able to drive to work safely. At first I felt better. I was hoping this was the medicine that would help me with my anxiety. I had hope my body would \"get used to it\" and the dizziness would eventually end. That never happened. I gave it a full year (I know now how ridiculous that was). During this time period I also had really negative thoughts that I absolutely believe were linked to the medication. I have been off of it and on a different medication for almost a year now and can finally see what it was doing to me.\"", "June 20, 2017"]},
{"text": ["\"I am being weaned off of Clonazepam and onto Buspirone. I can't even described how miserable I am. I'm a month in and suffering panic attacks, having terrible muscle pain and haven't been able to stop the Clonazepam totally. I hate it. I can't sleep at night. My arms and legs are so sore I am in constant pain. I want off of this drug!\"", "March 26, 2018"]},
{"text": ["\"Buspirone hasn't done much for reducing my anxiety.... I still worry about everything all the time.  What I have noticed as a positive effect though is that when I have \"anxiety spikes\" (my term for a panic attack that's not quite a panic attack), it doesn't spike quite as high.  So it mutes my sharp anxiety episodes, but doesn't really help me to actually worry less.\"", "(taken for 1 to 2 years)", "March 23, 2018"]},
{"text": ["\"I have debilitating anxiety and paranoia. I hate valium, xanax etc as it causes me shocking  depression and lose all motivation. I'm currently taking pristiq, seroquel and Armodifinil. After just a few days on 10 mg twice a day I feel so much better. I've stopped the morning dose as it was causing me to feel spaced out and numb until 2pm. Been on it now two weeks and all my physical anxiety (pounding heart, shortness of breath and irrational negative thoughts) has basically disappeared!! I feel so good I've even booked an overseas holiday soon. Something impossible before the Buspar. I love this medication it's changed my outlook in life :)\"", "March 21, 2018"]},
{"text": ["\"Works well for treating anxiety. \nI would occasionally experience tolerable dizziness for 30 minutes if taken prior to eating a meal. \nI took this medication for about 8 months, but eventually switched to Lexapro because I didn't like having to take it 3 times a day. I also didn't like how the anxiety would start coming back when the medicine was wearing off. \nI would consider taking this again in the future because unlike SSRI's, there are no sexual side effects and it is safe to take during pregnancy.\nI do recommend this medication if you don't mind taking it multiple times per day and can accept that you may occasionally feel mild dizziness for a short period of time after taking a dose.\"", "(taken for 6 months to 1 year)", "March 18, 2018"]},
{"text": ["\"I being in buspirone 5mg for 3 days I take it 3 times a day. I never had sleeping problem now I can't sleep also I had never being treated with anxiety.  I hate taking pills so I stopped it right now. Also the side effects are ridiculous  so no reason to take it anymore.\"", "March 17, 2018"]},
{"text": ["\"I started experiencing extreme anxiety and panic attacks out of the blue a few months ago. I did not want to take any type of addictive drugs like Xanax or Valium so my doctor prescribed Buspar, 20mg twice a day. It has worked extremely well for me, I feel much calmer with no side effects.\"", "(taken for 1 to 6 months)", "March 16, 2018"]},
{"text": ["\"Since I started this medication about 4 months ago, my depression increased dramatically. I went to several different doctors because I KNEW something was seriously wrong, but I didn’t know what it was.  I couldn’t stop crying and couldn’t function at work. Over the last week I tapered myself off of Buspar, and today I didn’t take any. I gradually started feeling less crazy and today felt GREAT!  I’m sure this med works for more people than it hurts. But, believe yourself even if the doctors don’t. If you feel worse, it may just be the Buspar!\"", "(taken for 1 to 6 months)", "March 15, 2018"]},
{"text": ["\"I can take 15mg three times a day but most of the time I  only take two a day as I was told not to take after 6 pm. But it works for me great. I haven't had any side effects or anything. It keeps me relaxed and calm and even when I want to get upset I really cant. I thank God for this drug. Give it a try if you haven't.\"", "(taken for 1 to 6 months)", "March 13, 2018"]},
{"text": ["\"Took for 21 days only , it didn't do anything for my anxiety nor the shortness of breath , in fact I think it increased my anxiety a little bit more and I was irritable. Also no positive  affect on depression , and I felt like it was causing a memory and sexual problems a bit .\"", "(taken for less than 1 month)", "March 12, 2018"]},
{"text": ["\"I was doing much better on Clonazepam.  I believe therapy and medication has as much to do with having quality of life than to changing to another medication.  I found that if my therapist had no experience with anxiety counselling, I didn't do well with that therapist.\"", "(taken for less than 1 month)", "March 12, 2018"]},
{"text": ["\"I have narrow angle glaucoma and there are only two anti depressive/anti anxiety drugs that will not raise my eye pressure...wellbutrin and buspar.  Wellbutrin tore up my stomach and upped my anxiety so after three months of that I switched to buspar.  I must be very sensitive to drugs because even 5mg was too much and caused \"brain zaps\".  I cut it in half and 2.5mg seems just right so far and it's only week two.  I feel calmer and I intend to give this drug a chance to really work.  Side effects are minimal and I take my second dose mid afternoon due to sleep issues if I take it in the evening.  It doesn't do much for my depression but my depression is secondary to my anxiety.  Like I said, I'm giving it a chance.\"", "(taken for less than 1 month)", "March 6, 2018"]},
{"text": ["\"Well I kinda came here for help to see if it was normal to feel nauseous and stomach hurting and just feeling a little anxious, I just started today on 5mg of this drug and I’m only 18, my body feels very relaxed and I feel kinda happy but my stomach feels awful, will this go away? Will I be okay?\"", "(taken for less than 1 month)", "March 2, 2018"]},
{"text": ["\"I took my first dose 0.5mg right before bed and I knew right away it wasn’t for me. I felt terrible. My doctor told me I shouldn’t have any side affects from this med and it was a lie. I felt sick instantly.. throwing up..lightheadness..pressure in my chest and I couldn’t sleep. I had really high hopes for this medication. I can’t seem to find what’s right for me. Maybe I’m just a little sensitive to anxiety medicine... because everything I take for anxiety just makes me feel terrible. I mean everything!!! Hopefully I find something that works for me soon.\"", "December 19, 2017"]},
{"text": ["\"I have been suffering from SEVERE anxiety all of my life. It was debilitating for me, people around would never know I was experiencing it because I would make myself losing and look happy, when really I was full of anxious energy and worry. I worried about EVERYTHING. Death mostly. It was obsessive. I never wanted try medicine so I just kept dealing with it. Recently, it peaked to the point I could no longer handle it. After researching medications I decided to try BuSpar, specifically for anxiety.  I know most do not see the benefits for at least 2 weeks, however, I’m on day two and I feel “normal”. I have never felt normalcy ever in my life. But I finally feel free of anxIety. I felt dizziness upon the first dose, nothing else yet.\"", "December 15, 2017"]},
{"text": ["\"Began taking a small dose of Buspirone in Feb.  Had dizziness, headache, feeling nervous & excitable, and mostly feeling sleepy.  Side effects have gone away.  Did help with my anxiety.  Caused a few days of jitters when I got off.  Now I take 1/2 a dose when I feel anxious or know I am going to be in a situation I will not be comfortable (lots of people, etc.) If I take half a dose for only a few days I only get the jitters for a few hours when I go off.  Really like this drug!\"", "(taken for 6 months to 1 year)", "December 14, 2017"]},
{"text": ["\"I was prescribed Buspirone in October of this year to help with anxiety and a very fast heart beat. When I originally went to see my doctor the very first time my heart rate was 116. Two weeks later, and two weeks after starting Buspirone, my heart rate was 86. It now seems to fluctuate between 98 - 74. \nThe first few weeks were miserable and the first week was the worst. I actually ended up quitting  on day 2 because of the dizziness and restarted a week later. When I restarted the symptoms weren't as bad. I still get dizzy sometimes but my doctor said it's most likely because my heart is slowing down.\"", "(taken for 1 to 6 months)", "December 13, 2017"]},
{"text": ["\"pros: significant decrease in GAD and social anxiety, easier to reach orgasm, less paranoia, felt more \"normal\" cons: no motivation to finish day to day activities, made me irritable, gave me anxiety when thinking about how to reach future goals because it prevented me from pushing myself to take the necessary steps to achieve the things I want.  It was costly without insurance, & even though it relieved a lot of my social anxiety I feel it's prevented me from being as social as I used to be, even with the anxiety.\"", "(taken for 1 to 2 years)", "December 12, 2017"]},
{"text": ["\"I've been on buspirone(buspar) for a year. It took about a month for me to start noticing the effects. It definitely helped my anxiety and paranoia drastically, and I was able to be more social without always worrying what others were thinking about me vice versa, however I really think it affected my motivation to get things done. This past year, I've worked the least amount of days possible and have found it hard to make a to do list everyday, let alone get a majority of the tasks done, even with my adderall. I ran out of buspirone a couple days ago though, and I've noticed my anxiety is slowly coming back, but I've gotten more accomplished in the past few days than I have in the last month. unfortunate I can't have best of both worlds.\"", "(taken for 1 to 2 years)", "December 11, 2017"]},
{"text": ["\"Hi, I have been on buspirone for now 3 weeks and I am amazed at how well this medication works so far for me. I have strong generalized anxiety but manifest mainly psychologicaly. I take 25mg per day.\n\nOn the positive side so far: I have way better concentration since I'm worrying a lot less than I used to, I have more mental energy,  more productive at work and overall way more relax.  I used to cancel all my plans last minute because I was stressing out and now I feel relaxed enough to go on with my plans which makes me feel more happy and confident.\n\nOn the negative side so far: I felt some dizziness after taking the doses. I am now trying to take more of the dosage before going to sleep instead of early in the morning.\n\nCheers everyone\"", "(taken for less than 1 month)", "December 4, 2017"]},
{"text": ["\"Been on Buspar 6 weeks & 1 day today. Trying to stay the course & not give up till 8 weeks.\n\nOn 15mg (3x /day) & titrated my way up over the last 6 wks. Tried 20mg but felt like I took speed & my extremities had very uncomfortable tingling. \n\nEven at 6 wks when I take my 5mg dose my heart still races & I get dizzy & feel some heightened anxiety about an hour after taking it. Lasts about an hour. I also have some left leg thigh pain now.\n\nI’ve read so much on this drug & it’s hard to know if you should go up or down in dose to get the right level for your body. My pDoc doesn’t seem to know much more than I do. \n\nIn those 6 wks I’ve only had a few hours out of 2 non-consecutive days of anxiety/fear relief.\n\n I’ll write another review at 8 wks\"", "(taken for 1 to 6 months)", "November 24, 2017"]},
{"text": ["\"I did not like this medication nor do I recommend it.\n I don't know if I was taking a low dose or a normal dose but I was on 10 mg twice a day. That medication made me feel very tingly, I felt like a rubberband that was stretched pulled, this was a daily feeling, it was scary. \n I also had feelings of not being able to control myself. For example when washing dishes I felt that I was out of control. So I hurried and washed dishes.\n I took this medication for about 2 months, I stopped taking it. I will never again take it again.\n What did help me with 95% of my anxiety attacks was to stay away from sugar and flour products. Now I rarely have anxiety attacks. More Protein!\"", "June 19, 2017"]},
{"text": ["\"Only been on it for about a month but so far it's really helped. Had me on Paxil as well at first and I hated how I felt on that - lots of headaches and sweating. Doing much better on the Buspar alone.\"", "(taken for 1 to 6 months)", "June 12, 2017"]},
{"text": ["\"I've been taking buspar in differing doses on and off for over a year. I was prescribed it and 0.5mg xanax for severe anxiety and panic attacks. Taken together it was helping only couldn't function or take care of my daughter while taking both. Since moving to another state I stopped taking the xanax and then got pregnant so can't take it anyways. My anxiety and panic issues got better after moving to the new state. But getting pregnant again my anxiety came back . I was started on a slightly lower dose then was taking before and it was too much for me so my ob and I decided on a lower dose but I upped it due to not being helpful I will be upping again and hopefully it helps... Its a good medication if the right dose.\"", "(taken for 1 to 2 years)", "June 10, 2017"]},
{"text": ["\"I been perscribed this for GAD I haven't begun yet cause I've never taken anything besides occasionally valuim at the dentist. I been reading reviews and am worried until it works will I be able to function. ?\"", "(taken for less than 1 month)", "May 26, 2017"]},
{"text": ["\"Prescribed 7.5mg twice a day, to eventually move up to 15mg. The first dose made me so dizzy and lightheaded that to had to lie down. I tried just one small dose for a few days after, kept getting dizzy spells and feeling faint. Actually increased anxiety because I was so worried about the side effects\"", "(taken for less than 1 month)", "May 24, 2017"]},
{"text": ["\"I'm taking buspar for anxiety that I'm having due to an injury. I broke my wrist about 8 weeks ago, and I am in a cast from the tip of my thumb to just below the elbow. My Dr. told me I might be in this cast for 12 weeks or significantly longer.\nI started having bad anxiety and panic attacks. So my family Dr. put me on buspar and zoloft for the duration of being in a cast.\nSo far it hasn't seemed to help very much, 7.5 mg twice daily. I'm hoping that it will start helping with the anxiety.\nI do feel a little light headed and I'm always tried.\nThis isn't my first broken bone or cast, but this is the first time I've ever experienced anxiety.\"", "(taken for less than 1 month)", "May 20, 2017"]},
{"text": ["\"I have debilitating anxiety which keeps me from leaving the house many days. Before, I would cry almost daily, even when life was going better. The little things tore me apart. With the buspar... it's like I'm getting \"moments\" back. I still get anxious sometimes, but I have occasional periods of feeling. ... normal. Clear. Simple, natural interactions with family and friends are possible again. As time goes on, I'm experiencing more and more \"moments\" of real life again, or, life before anxiety. Multiple friends have told me I seem much happier. Though I don't particularly think of myself as suddenly \" all sunshine and roses\",  I feel like I have my life back. I'm actually living again.\"", "May 7, 2017"]},
{"text": ["\"FAINTING SPELL. About 30 minutes after taking this, for about 15 minutes my heart would race (~135bpm?), and I would feel as if I were about to FAINT (head rush?). I would spend 15 minutes trying to remain calm, fighting the urge to collapse. I tried it twice and had the same response. Thank goodness I wasn't driving when it kicked in. My wife had a similar reaction. Seriously, please be cautious when first trying this medication.\"", "(taken for less than 1 month)", "May 7, 2017"]},
{"text": ["\"I still had anxiety. I woke up in the middle of the night, but in the morning I was dizzy till about 11. Can't be productive on this medicine!\"", "(taken for less than 1 month)", "April 28, 2017"]},
{"text": ["\"28 female- I was diagnosed with Bipolar, manic depressive when I was 14. I have been on an off of medication for years. When I approached my PCP for medication for my anxiety they were nervous about giving me a SSRI due to they make me manic. They tried giving me abilify but that landed me in the ER. Buspirone was my last resort. It's been about 4 weeks and what a difference. I'm enjoying my life with my kids, family, and friends again. I used to go everywhere with no problems but the past 7 months I could barely leave my house. I shut down completely. Buspirone is changing me back to the person I was. My anger has diminished. My paranoia is gone. I can go out in public without a panic attack or racing thoughts.\"", "April 28, 2017"]},
{"text": ["\"I am taking the buspar but it making me feel too relaxed and giving me worse anxiety. My whole body is tingly and I have a huge headache I don't have anything else that to take but I am so afraid to take it - it is Saturday I can't get a hold of my dr. I just don't what to anymore anyone have any ideas\"", "April 22, 2017"]},
{"text": ["\"I started on 5 mg for anxiety caused by my OCD. I got bumped to 7.5 and within 3 days could feel some of the terrible anxiety burn I get in my upper back go away. A month went by and I had a terrible setback with depression because I could no longer could deal with my panic & OCD. Doctor bumped me to 10 mg. Same pattern occurred.... within 3 days I was feeling better. In fact, had the best day in a while. It might just be a coincidence and therapy might be helping in conjunction with, but I notice Buspar does help with my extreme anxiety, but only when I went above 5 mg. I have not noticed any side effects. I'm also taking zoloft, zyprexa 2.5, and klonipin .25. I have endured a lot with panic attacks, OCD, and depression hence all the meds.\"", "April 15, 2017"]},
{"text": ["\"So, I give this 7 out of 10. I'd give it 10 out of 10, but the first week on this was really uncomfortable. I almost stopped using it. I started out at 10 mg buspar once a day and then after a week increased to 10 twice a day . The first week, I won't lie, was a doozy. My psych said that her patients either love it or hate it and it's pretty much 50/50 with little gray area. But since it's inexpensive, been around for a while, and is pretty safe, she likes that to be the first option when dealing with GAD. Fair. The first week, I was really, really dizzy. Felt a bit fuzzy in the head. kind of jumpy. I had to pull over while driving and sit down for a bit. BUT after about two weeks. Whoah. My life is changed. I'm no longer so anxious!!\"", "April 14, 2017"]},
{"text": ["\"This medication can be effective when used correctly. It has to be taken every day around the same time, much like the way an antidepressant works. It takes a few weeks to become effective. It is not to be taken as needed, as someone mentioned. You have to keep a steady dose of it in your system. For me, it works much better at low doses, best benefit with least side effects, when taken this way.\"", "(taken for 1 to 2 years)", "April 13, 2017"]},
{"text": ["\"Started taking about 4 weeks ago. I have bad anxiety that had manifested into depression. Doctor was trying  me on lamictal, To help with my severe mood swings, and anxiety.\nI was on it for 2 months,  \nI take this medication twice day. I notice I have bouts of being really talkative. Sleep is good, although I take Ambien. My over all mood has done a 180, anxiety level is maybe a 1-2.\nI've noticed a decrease in my appetite, not as hungry . Has not affected my energy level. I work out 5 days a week. \n\nMy libido has increased, that may be from just being in a better mood.\"", "February 26, 2017"]},
{"text": ["\"Have been on Buspar for a few months, and I like it a lot! It has made severe and paralyzing anxiety lift to a manageable level, even while taking a low dosage of 10 mg daily. My Dr. told me that I can increase the dosage, since in taking so little it doesn't rid me of anxiety completely (no med can). But I noticed that when I upped my dose my appetite came back more than I would have liked. Essentially, I think it works to strengthen my SSRI (sertraline); and I did have dizziness when I first started and felt pretty bad, but that's common for anti-anxieties and usually goes away as your body gets used to it. I do still find however after I take my morning dose (usually) with coffee I do feel a bit woozy but it usually wears off quickly.\"", "February 24, 2017"]},
{"text": ["\"Buspar* Took 5 MG at 10:00 pm and stayed up until 2 am the night before work (due to being very mentally hyper and aware). Mouth and eyes very dry the next day.  Felt very weird all day the next day. Very hyper.  Wanted to continuously talk.  Felt wired but yet didn't really want to move.  Hard to function at work, but yet was in good mood (almost felt drunk). Seemed like I was slurring(possibly from dry mouth?)\"", "February 24, 2017"]},
{"text": ["\"I've been titrating up on Buspar after going off of Xanax last year and then starting up with 5mg fluoxetine and 10mg doxepin. So far, this is working far more gently than the xanax. I don't have a zap of relief following by impending panic attacks within hours. I am much more level. I am having side effects of nausea, dizziness, and light-headedness for a few days after each increase in dosage. I'm up to 20mg 3x a day and I'm supposed to sit tight here so I'm hoping to be done with the side effects soon and get into a stable state. I had a ton of problems with withdrawal from the benzos so I don't want to go back to them; buspirone has been a great alternative so far. My anxiety is so bad that I'd rather be dizzy and nauseated than anxious\"", "(taken for 1 to 6 months)", "February 21, 2017"]},
{"text": ["\"This stuff is HORRIBLE. Made me very irritated/jumpy/even more anxious. Felt like my mind was racing...felt even more overwhelmed. This is the worst stuff I've been on yet..I had to stop taking it because I couldn't even function right.  This stuff is really, really bad.. doc put me on Lexapro today hopefully that helps!!\"", "February 21, 2017"]},
{"text": ["\"My doctor put me on this medicine on 2-17-2017 twice a day at 7.5mg for my anxiety and stress levels. Today is 2-20-2017 and I'm already having issues. I ended up getting extremely light headed, heart racing, sweating, and dizzy all in the matter of five minutes. I went to go to the bathroom so I could try and feel better. Next time I remember I was on the floor laying in a pool of my own vomit. At that time, I had no idea what was going on, what had happened, or anything. I ended up having a bad seizure. I was locked in place for five minutes, not breathing properly, and throwing up everywhere. I was extremely confused and exhausted like I had just ran a marathon. Went to bed and had another one six hours later.\"", "(taken for less than 1 month)", "February 20, 2017"]},
{"text": ["\"I feel like most of the reviews that say they had panic attacks on it is because they had reduced or stopped a benzo Xanax, kolanapin, valum. I am on Xanax and feel a difference after taking buspar for a while. My doctor did not take me off the xanax or lower the dose but said see how you feel. I also have a non addicting personality but I am dependent on the medication ill admit. i feel that most of you should have started taking the buspar and took the benzo as well because you might be feeling the anxiety more because of that not the new medication. You are withdrawing. These medications need to be slowly weened off and only after the new meds have started working. I feel bad you guys didn't give it a chance because of your Drs.\"", "February 17, 2017"]},
{"text": ["\"I've been on bupropion for depression several years with dry mouth being the only side effect. Panic attacks started a couple of years ago. Take Xanax and it works great for me. Last year the panic attacks started occurring more often with severe anxiety this past fall. I didn't want to get addicted to Xanax by taking several times or more a week. Started Buspirone 7.5 mg 2/x per day. I felt relief from my anxiety in about 3 weeks, but around 8-10 week mark I felt like it contributed to weight gain and bloating . Taking 7.5 only once a day lessened side effects. However 3mo. now weight gain is 5-6 lbs (a lot for 5'1\"), bloated and water retention none of which is reducing with proper diet, exercise and increased water intake.\"", "February 15, 2017"]},
{"text": ["\"I left a review awhile back, but now I have to revise it. When I first started taking Buspar I was happy with it, but then it stopped working for me. I'm now on the max dosage of 60 mg. I take 30 mg in the morning & 30 mg in the evening, but it is not helping me at all. I still have very bad anxiety, panic attacks & paranoia. Since it isn't doing anything for me I will probably stop taking it.\"", "(taken for 2 to 5 years)", "February 15, 2017"]},
{"text": ["\"I've had panic and general anxiety for years. It's been exacerbated by hormonal changes and menopause, and I've had major trouble getting a full night's sleep. I have used Xanax occasionally and love the way it eliminates my anxiety, but I don't want to get addicted. My doc had me try a low dose Buspar and it didn't work for me at all. Gave me a horrendous headache, very very painful. I tried it for about three days and had the same experience every time. I had to stop taking it since this side effect was debilitating. I was hoping it would work for me, and so glad it works for others. Just putting my experience out there in case others have this problem. I'm trying Celexa now instead and have learned to limit Xanax usage.\"", "(taken for less than 1 month)", "February 2, 2017"]},
{"text": ["\"It is too bad that doctor's are so freaked out about addictive behavior to the point where they are willing to let people suffer.  Valium in low dose works and this is just junk.  It may work for some but even results using test rats I have seen state they have low results.   I resent it when a person really needs help for acute conditions and they are given this kind of low performing medication.\"", "January 30, 2017"]},
{"text": ["\"I have bipolar disorder with anxiety problems. My nurse practitioner  at my psychiatrist office persribed buspar for my anxiety. I got home took it and went to bed, only to wake up in the middle of the night with the bed soaked in sweat, i'm burning up with my heart beating so fast my chest was hurting. I went back to my old medicine after that.\"", "January 30, 2017"]},
{"text": ["\"I've long used BuSpar, and it is an odd duck. Alone, it did little, but in combination with other meds it's amazing. Particularly SSRIs. It seems to amplify other meds, from painkillers to Prozac. It's not something I'm afraid to take, the boost is subtle but it definitely helps my anxiety slip away. I've not noticed any sick withdrawal efffects, being off it once for 2 months. I take 30 mg/day in two 15 mg doses.\"", "(taken for 2 to 5 years)", "January 30, 2017"]},
{"text": ["\"I'm a 32 year old male and I've been taking buspar for about 10 months. At first it did nothing but make my anxiety worse. I would wake up with to full blown panic attacks and have the worse nightmares ever. However I'm now taking 40mg of citaloptam a day mixed with the buspar 15mg and 1mg of xanax twice a day. And Zanax! I have  insomnia mixed with with deep anxiety issues. The problem that I have is the buspar makes me so fat! I'm literally considering stop taking it and just see of the other meds can help. Buspar Alone is no  substitution for anxiety drug and wouldn't recommend it...\"", "December 31, 2016"]},
{"text": ["\"Good medicine\"", "December 30, 2016"]},
{"text": ["\"I am a very anxious person, socially especially. I take valium 5mg 3x a day (but lately only as needed, I'm tired of going through my script so quick) & yesterday asked my doctor to prescribe Buspar (buspirone) and to let me try it in addition to my valium. He agreed it was safe to take with my other medications (quite a few that I take for chronic pain and anxiety) but this medication, that is the ONLY FDA approved medication for anxiety that is NOT addictive, or so he says, actually has made me smile and made my general social and overall anxiety go away. I just started yesterday, 15mg 3x a day, and even tho I am staying on valium for now, this med may help me wean back to a smaller dose of benzos. Good luck!\"", "(taken for less than 1 month)", "December 29, 2016"]},
{"text": ["\"Dumb drug under tested\"", "December 24, 2016"]},
{"text": ["\"This drug is awful. My Dr. took me off my klonopin because she was worried about addictive behavior.   This drug i only took ! time and will not take again. It made me very dizzy, sick to my stomach, my hear was racing. It basically gave me the worst panic attack I've ever had. Odd since this is supposed to be for anxiety. I understand the risk with taking benzos but it the only thing that has ever helped me. I would recomend never taking buspar.\"", "December 21, 2016"]},
{"text": ["\"I started buspirone last week. Prescribed to take one 7.5mg twice a day. I'm not big on pill taking so with my doctors consent have only taken them when needed. \nThe first day was... a unique one. I was extremely lightheaded and dizzy. As if the entire room was spilling but at the same time I had this unbelievable sense of relief from my anxiety. There are no words for the sense of relief and calm that i felt.\nWith each day I've taken them the dizzy spell has gotten weaker and weaker. I do have a dull headache afterwards but it passes with time and Tylenol. I'm hoping that goes away as well. But if I have to choose between minor dizziness, and a slight headache over the chest pounding, agonizingly severe panic attack... I choose the buspirone\"", "December 19, 2016"]},
{"text": ["\"My first ever medication I tried for anxiety and with unfavorable results unfortunately. Taking it the first week I felt slightly less anxious and ready to move. After this though, I started to can a terrible dizziness that would keep me locked in my bed for hours until it subsides. I tried using this in different settings, times and with different meals to see if anything was going to work but the dizziness was deafening. Had to come off of it after less than a month of feeling like I was on a horrible plane ride.\"", "December 16, 2016"]},
{"text": ["\"Geeze. I started buspar 2 weeks ago in hospital. They had me taking 5mg twice a day. My psyc said too take three times a day because I have come off adavan. My issue is, the first dise works great, the second one I take at 6:00 knocks me on my butt after I eat. Literally I become kinda lathargic, I am also med sensitive. Help please\"", "(taken for less than 1 month)", "December 10, 2016"]},
{"text": ["\"Buspirone has improved my life!  Initial response was unpleasant.  Prescribed 10mg 1/2-1 pill every 6-8 hrs. First dose felt odd, not myself, jittery, detached.  Others positive reviews prompted me to started w/only 1/4 pill before a nap then 1/2 before bed. Being asleep made a difference, woke up refreshed, alert, at ease. Then took 1 pill 3 x day.  Day 5 the constant ringing in my ears from tinnitus was less noticeable and my stress level better.  After a month I feel so much happier!  Positive, alert, more in control. Negatives: vivid dreams.  Symptoms of my autoimmune disorder are improved, it appears Buspirone helps in more ways than is listed and has turned out to be the single most effective med I take. Wish I had it years ago!\"", "(taken for 1 to 6 months)", "December 10, 2016"]},
{"text": ["\"I started on 5mg twice a day for the first month and now am on 10mg twice a day for 2-3 weeks now.  It made me really dizzy after taking it and it still does but I just make sure to take it when I'm sitting down for awhile. I did not really think it was working at all because I was getting anxious constantly still.  However this last week I have had zero anxiety.  In fact I feel so weird not worrying all the time. But I am happy because it's actually working.  I am glad I stuck it out. I recommend staying on it for 6-8 weeks before deciding it does not work. Yes there are some side effects but nothing like SSRIs that I had taken in past.\"", "(taken for 1 to 6 months)", "December 7, 2016"]},
{"text": ["\"Why is everyone on such extremely low doses of Buspar??  I've been taking it for approx  3 years for anxiety at a prescribed dose of 30 mgs every 4 - 6 hours for a total not to exceed 150mgs daily.  The half life of Buspar is only 2-3 hours so it makes absolutely  no sense to me that someone would only be taking one dose per day unless they're only wanting to curb their anxiety symptoms for 4-6 hours per day.... . .\"", "(taken for 2 to 5 years)", "December 3, 2016"]},
{"text": ["\"Buspirone doesn't work near as well as Clonazepam. I was hopeful but hopeful does not stop my anxiety.\"", "(taken for 1 to 6 months)", "February 14, 2018"]},
{"text": ["\"Buspar does the job better than other medication so far. Everything else has made me feel worse. \nThe first couple of times I took this medication my heart rate increased and I felt dizzy. This went away after a couple of days taking it. \nIt makes me sick to my stomach if I take it on an empty stomach, so I definitely recommend eating a meal right before you take a pill.\"", "(taken for 1 to 6 months)", "February 13, 2018"]},
{"text": ["\"Day 4 on buspirone, or as I have called it “bed rest from extreme nausea.”  I’m on 7.5 mg twice daily and have only taken the required 2 doses one day because of the nausea. Someone, please tell me there is an end in sight. On the anxiety front...I only feel extreme angst about this nausea, other than that, pretty numb.\"", "(taken for less than 1 month)", "February 9, 2018"]},
{"text": ["\"I started out taking 2 doses of 5 mg a day. The first few days I did notice a little mood boost but it didn’t last long. We raised my dose 5 more mg (15mg a day) and same thing but it went away. Didn’t help with my panic or separation anxiety. Did help with depersonalization.   It made me tired, nauseous & gave diarrhea the first couple days. Those went away after that but it did give me a weird feeling about 45 minutes after taking each dose. I tapered off after 2-3 months.\"", "(taken for 1 to 6 months)", "February 6, 2018"]},
{"text": ["\"It's working fine for me so far\"", "(taken for less than 1 month)", "February 2, 2018"]},
{"text": ["\"This was my first night of taking Buspar for anxiety 15 mg and it made it worst, I am tensed , I feel tingly , cold and jumpy. And I can’t sleep at all. I do not like this feeling at all. Worst feeling ever.\"", "(taken for less than 1 month)", "January 30, 2018"]},
{"text": ["\"I went on Busiprone Jan 10 it is now  30th, 20 days of half being good, but the last week  I have had the worst panic attacks ever in my life being on this stuff. 7.5mg x 2 twice a day. heart palps, panic attacks, coldness, dizziness,  tired eyes, back and chest muscles are tight, especially in between doses, yet everyone said wait the 3 weeks, no thank you! today is the last day,  anxiety hasn't improved and a massive panic attack almost sending me to the E.R. tonight, they were more constant on this stuff!  I have had 4 attacks in my life, this week  its been 4/5 per day, every other day. Idk,  tonight I thought I was going to loose my mind after I took them. The ending point was I could feel the meds kick in, but this last attack was so severe, it scared me I  know it was a weird reaction to these meds, cuz now that it  is out of my system, I feel fine.. this drug is horrible.\"", "(taken for 1 to 6 months)", "January 30, 2018"]},
{"text": ["\"I've struggled with anxiety all of my life. I am also about to get tested for ADHD in my 40's. The Buspar has stopped the constant worry, but the focus issue and being scattered brained hasn't changed. My anxiety is definitely better. But it's all at a price. I feel emotionally numb. I don't really feel much anything. I'm could just sit and stare watching everyone life go by except for continuing to fidget and tapping my feet constantly. I'm on 5mg twice a day for two weeks now. Its nice to have relief from the anxiety but my fidgety mind is trapped in this sluggish emotional state. My heart and my head feel like two separate entities strangely. And my dreams are so vivid I feel like I'm in something as real as when I'm awake. I dreamed I in  an earthquake, tsunami and I saw my dog get bit in the face by a gigantic snake. I almost would rather deal with the anxiety. At least I felt normal.\"", "January 28, 2018"]},
{"text": ["\"I took my first buspar last night. I was told to split it in half the first week. So my prescription was 15mg but, my first dose was 7.5mg anyways...20 min later..I was lying in bed playing a game on my phone when suddenly my vision got blurry and then five min after that I started to tremble uncontrollably and then came the diarrhea. I had a hard time falling asleep too. I went from feeling just \"ok\" to a full blown freak out. Never again will I take this drug.\"", "January 14, 2018"]},
{"text": ["\"Horrible drug, made my anxiety worse! An hour after my second dose I became nauseous and had the spins bad.\"", "(taken for less than 1 month)", "January 11, 2018"]},
{"text": ["\"DO NOT TAKE THIS CRAP! My experience was so bad I actually turned to Burboun to get me out of this hole that buspar put me in. I can only explain it like this: take the most familiar place to you and suddenly this place you know so well doesn't look the same. Like all the furniture got rearranged but nothing moved. Like your home was relocated to the twilight zone. Not cool. Neither are these people who are  taking people off meds that work and handing out garbage like this to save their own skin.\"", "(taken for less than 1 month)", "January 5, 2018"]},
{"text": ["\"It took away my ability to sleep. I didn’t notice anything more.\"", "(taken for less than 1 month)", "January 2, 2018"]},
{"text": ["\"Age: 25\nWieght: 305lbs\nHeight: 6'2\"\n\nReason for taking: anxiety & depression\nDosage: two 10mg tablets twice a day\nSide effects: (mild) racing thoughts, (mild) cluster headache, (mild) fuziness\n\nUpsides: This drug does in fact amplify the effects of other drugs. I also exercise daily with an occasional day off and I feel incredibly good mentally while doing the exercises. It is uplifting (very lightly) somewhat similar to how an antidepressant makes you feel without as much zombie effect and not as happy. You have clear thoughts (though some might have racing) and are able to be yourself. I get great sleep and the dreams are good too.\n\nRecommendations: three a day at a lower dose, take last dose 8-10 hours before needing to be up the next day.\"", "December 31, 2017"]},
{"text": ["\"I started Buspar 2 months ago and at first I did have the side effects for the first 3 weeks, but was given anti nausea med and reduced the nausea. Have lost 12 pounds and have kept it off. Eating a little as no changes in what I eat. No sweets. And that makes me happy. And no more anxiety\"", "(taken for 1 to 6 months)", "November 18, 2017"]},
{"text": ["\"I’ve found Buspar to be fairly effective helping control health-related anxiety. Buspar has helped tremendously. Two very important things: First, it took probably two weeks to really kick in. Second, the correct dosage was critical. The doctor initially started me on 15mg per day. While it helped, I was still having days. We bumped it to 20 mg, and it has made a world of difference. We gradually increased the dosage to 30 mg, but my arms began aching with no significant improvement, so we went back to 20 mg. My morning dose still makes me lightheaded for a bit, but I’m better able cope with my anxiety.\"", "(taken for 6 months to 1 year)", "October 30, 2017"]},
{"text": ["\"I've been begging for years to take an anti anxiety medication. I was initially diagnosed with depression & anxiety. My neurologist increased my Effexor from 75mg to 150mg/day to treat the numbness and tingling in my feet due to diabetes. I became manic with my driving and spending habits. I was then re-diagnosed as being bipolar. I went years without anxiety medication and had several trips to the hospital with anxiety attacks that felt more like heart attacks. \nI was put on Buspar and took my first dose last night. This morning I couldn't find my wig. I ended up late to work in hopes of locating it. It's not where I left it and I wonder if I was sleep walking. Anyone experience anything similar?\"", "October 23, 2017"]},
{"text": ["\"Just started Buspirone 10mg twice a day. For years I have been on Celexa, Bupropion, and Clonazepam. Those 3 worked for me, but my doc suggests instead of taking clonazepam daily, I should try Buspirone for long term use, & clonazepam for when my panic attacks are truly out of control. \n\nSo far the drug combination has had no major negative interactions. I take the Buspirone with food. The first 2 days in & I had pretty bad headaches, about 2 weeks in now & tonight I'm having severe dizziness, which is making me nauseas. I'm definitely going to keep going on them though.  I LOVE my clonazepam (klonopin). Its almost instant relief during an attack, but after reading about it extensively & talking with my 2 docs, I'm ready to get off of it.\"", "October 20, 2017"]},
{"text": ["\"This is my second day on buspar 5mg once a day. My Provider’s  (psych) instructions were 5mg 3x day, but she went out of town, so I called the pharmacy asking other questions and I was told to start with 1 a day, then after 5d to move to twice a day, then a few days later go to full dose of 3x.day.\n\nI have anxiety and panic disorder.\n\nI’m also currently on 15 mg of mirtazapine and I’m slowly weaning off it (1/10th the dose every 45d). Mirtazapine NEVER helped me but made me feel much much worse. Evil POS drug.\n\nWhat I found interesting is an hour after the first dose of Buspar yesterday I felt the fear and anxiety go away, nearly completely. It was amazing. But today after taking it i feel the same as I did before ever taking it. \"", "October 14, 2017"]},
{"text": ["\"The medication allows one to become calm, if they allow it to work. You will need time to get used to how it affects you in the long run. It will make you sleepy.\"", "(taken for less than 1 month)", "October 9, 2017"]},
{"text": ["\"I had high hopes that this would help my anxiety but it seems like it made my anxiety a lot worse. I now experience bad nausea and trembling which didn't happen before. I also had low appetite and more severe anxiety attacks.  I took 15mg twice a day for six weeks. Thankfully it doesn't have withdrawal effects but unfortunately it didn't work for me.\"", "(taken for 1 to 6 months)", "October 9, 2017"]},
{"text": ["\"I started taking buspirone 5mg 3x a daily due to having severe anxiety I've been on it for a few days now and I noticed it's effectiveness the very first day!! I did have a terrible headache the first day but none since then. It definitely helps keep me calm and I'm able to function without an attack, I was a little skeptical at first looking at all the negative reviews but it actually has done wonders for me in the few days I've been on it.\"", "October 6, 2017"]},
{"text": ["\"I've been on Buspar for two years. The drug does not 'kick in' quickly, but once it does start working, one notices a nice, quiet calm. (It started working for me after ~ 30 days. )It's nothing like the benzodiazepines (thank goodness) and does not make me feel like a zombie with memory problems like Clonazepam (Klonopin) or Valium, etc. I use this in conjunction with Cymbalta and this combination helps me with both anxiety and depression. The only side effect I notice is that I might sweat a bit more. It is non-addictive, but as with any drug used long-term, one become physically dependent upon Buspar and one should follow a withdrawal schedule formulated by your PCP.\"", "October 6, 2017"]},
{"text": ["\"I was put on this medication for anxiety and man do I regret it. I have only taken this medication for one day and cannot stop vomiting. I have the sweats, my skin is clammy, I'm very dizzy, I am very weak. I have tried eating chicken noodle soup and sipping on a Powerade and I can already feel that wanting to come back up! No way will I continue this! It may work for some but I can't even make it past day one...\"", "October 5, 2017"]},
{"text": ["\"I augmented my SSRI Lexapro with BuSpar to help bring my initial startup anxiety down the first few weeks of starting an SSRI. I must be one of the lucky people who found BuSpar to be effective because it did greatly relieve my anxiety, especially tapering up my dosage over a few weeks time. I only had to take one Xanax over the period of a month when starting up my SSRI thanks to BuSpar.\"", "(taken for 1 to 6 months)", "September 27, 2017"]},
{"text": ["\"Overall- waste of money long term because it only works for a few weeks.  Exercise and meditation will be more beneficial.  However, if you're doing exposure therapy in addition to, those few weeks the medicine is working may help you overcome the initial hurdle. \n\nInitial side effects were dizziness and terrible fatigue.  Only lasted first 3-4 days, then you could feel the medicine start working.  Buspar only worked for two weeks though.  Regardless, I took it 4-5 months while still having regular anxiety attacks.  I started tapering off last week, and thankfully no withdrawal symptoms (not like Xanax).  That is at least a plus.\"", "(taken for 1 to 6 months)", "September 24, 2017"]},
{"text": ["\"My doctor prescribed Buspar 5mg 3x daily as I eased off Effexor. The Effexor worked great except for the sexual side affects and the hardcore addiction. I have nothing good to say about Buspar. I thought I was losing my mind. Felt severely unbalanced. Nauseated. Confused. Thirsty. Insomnia. You name it! My endocrinologist thought I might be diabetic because of family history. No, it was all the Buspar. Why should something that is suppose to help generalised anxiety make you feel like you are losing it? \n\nI ended up slowly getting off of Effexor and pitching the Buspar. I need something for generalised anxiety but I am scared of another bad trip.\"", "September 21, 2017"]},
{"text": ["\"When I started having severe anxiety and panic attacks years ago I had a doctor who had no difficulty shoving me on Xanax and Klonopin. I was completely unaware how addictive and awful these drugs were. I weaned myself of the drugs after years of taking them. After withdrawal I did fine. About a year ago my anxiety and panic attacks returned and I was going to a different doctor. She tried me on Zoloft first and very sparingly gave me Xanax for those \"I'm going to die moments\". After about 3 months the Zoloft wasn't helping much without the occasional Xanax kick so she doubled the Zoloft and I about crawled out of my skin. She asked me if I want to try Buspiron. No anxiety and sleeping like a baby.\"", "(taken for less than 1 month)", "September 19, 2017"]},
{"text": ["\"Took buspirone for 2 days. It definitely helped me stay calm, but made me drowsy during the day and gave me the worst insomnia I've ever experienced at night. I know trialling it 2 days is nothing for a med, but I have a family and a demanding job where I cannot afford to not get at least a couple hours of sleep a day. The severe insomnia alone is enough for me to stop taking it. I also got insomnia from the two antidepressants I took (generic Paxil and Zoloft), so I am very sensitive to meds. I will say this though, it did seem to keep my calm and better able to focus. It works in those terms. I would recommend anyone who hasn't had success using anti depressants to try buspar/buspirone for anxiety. It just might be your golden ticket.\"", "September 18, 2017"]},
{"text": ["\"Effective. Regular constant use led to a solid stable benefit. The drug is mild, unnoticable but with time you realize something has changed for the better. Positive effect on libido. Improved concentration, mood, curiousity, rest.\"", "(taken for 1 to 6 months)", "September 18, 2017"]},
{"text": ["\"Taking Buspar 4 or 5 days 4x day 30 mgs all toll.     It                                                                                                          didn't work very well, added 0.5mg Klonopin, told to break pill in 1/2 take 2x day. Last night took buspar at bedtime woke up after 3 hrs shaking panic attack. I took xanax hadn't picked up Klonopin yet. I waited 2 hr took buspar. Still no help  1 hr later panic attack off the charts.  Why I'm I taking Buspar it only lasts  maybe 3 hrs or so. I'm 72 why can't he just prescribe xanax which helps me.     I'm confused what these drs are thinking. He said he wants to see me in a month.\"", "September 13, 2017"]},
{"text": ["\"I take it when I start getting overwhelmed, I don't take it every day just as needed ,works good for me , I  don't like long term meds or anything that makes me weird in the head, so far I take at least 2 or 3 in a weeks time sometimes less, it calms me down to where I can function, all in all I'm ok with it, everyone is different and have different effects\"", "April 11, 2017"]},
{"text": ["\"I'm on the fence about this medication, I used it for generalized anxiety disorder which was exacerbated after my mother passed away unexpectedly.\nWell I have to say, I was shaky like I was just as anxious, so I though it was the anxiety, so I stopped the medication after 6 months and I am not shaky anymore, I also feel like everything is clearer.\nI was on a very light dose 2.5mg three times a day.  Maybe I did not take enough.\nSo he gave me Lexapro, which I have not started, I am holding out, when I get anxious I take a half of a .25 xanax and it keeps the anxiety away.\nSo if I was to say I don't think this medication helped very much.  Maybe at a higher dose, I don't know.  I am skeptical about taking anything like this.\"", "April 6, 2017"]},
{"text": ["\"I been like a lab rat for many years.  Have been on and off this trash  Hasn't ever helped me.  They (different Dr throughout years)  will try this first.  For one.  I don't want to be over or under medicated. I understand everybody reacts differently to prescriptions or any thing they eat, drink, or put in body.  Honestly for me I believe these are placebos (like a sugar or salt pill).  I do not abuse any medication.  I've been up to 75 MG throughout a day.  I can tell you   .5mg of clonazepam 3 times  a day and I function pretty well.  Have had Valium, xanax and felt like a zombie throughout the day.  Do work with your Dr.  Hopefully you have one that will listen.  And offer suggestions if this doesn't work.   Good luck\"", "(taken for 5 to 10 years)", "April 5, 2017"]},
{"text": ["\"Works well in combination with an SSRI. I stopped Buspar due to drowsiness and immediate weight gain. I experienced increased appetite and wanted to eat constantly. \nI was diagnosed with Adult Attention Deficit Disorder without Hyperactivity. I currently take Adderall, low dose Wellbutrin XL, and low dose Prozac. \nThe Prozac and Wellbutrin XL assist in alleviating depressive symptoms during the winter months. \nEveryone is unique. Talk to your doctor; follow their advice.\"", "April 4, 2017"]},
{"text": ["\"I took this medication for several months for anxiety and it did nothing to help at all.  In fact my anxiety got worse.\"", "(taken for 6 months to 1 year)", "April 4, 2017"]},
{"text": ["\"Cannot see any difference in depression\"", "March 26, 2017"]},
{"text": ["\"Didn't do anything but make me tired.. started at 15mg and went all the way up to 60mg with no improvement.\"", "(taken for 1 to 6 months)", "March 26, 2017"]},
{"text": ["\"I think buspar is working really well for me.. I also take zoloft and its a great combination so far. I do get a little dizzy but my anxiety was so bad that I'd rather be a little dizzy than anxious..\"", "(taken for 1 to 6 months)", "March 22, 2017"]},
{"text": ["\"Have had anxiety for many years, have tried numerous meds and none worked for long. Because of numerous surgeries I have a high drug tolerance and sometimes weird reactions. After taking Cymbalta for 3 years the excessive sweating just became too much, I am now on Lexapro and was using Clonazapan when an attack would start,concerned about addiction to Clonazapan my doctor suggested Buspar. I started with 7.5 twice a day did not feel much until starting the third week then 10mg 3xs a day. Did have side effects but was encouraged to wait 4wks, so glad I did. 1st time in years and I mean years, I feel like the old me, sleep through the night, no side effects. I encourage you to wait and see before you give up on it, for me well worth it.\"", "(taken for 1 to 6 months)", "March 18, 2017"]},
{"text": ["\"Not sure about this one yet. I have been on it for only five days now and it's a roller coaster ride. Sometimes I feel okay and other times I feel like I'm going crazy. My doctor prescribed me to take 15mg twice daily which I think was way too much to start out with. I literally felt like I was going to lose my mind because of the thoughts I was having. I also think this has increased my depression and feeling of isolation. I know that this medication takes time to work in your system and that it can make symptoms worse while it is working so I'm going to try and ride it out a little longer. I've cut my dosage in half to 7.5 twice daily and I'm going to see if that helps.\"", "(taken for less than 1 month)", "March 10, 2017"]},
{"text": ["\"Today is the THIRD day I've been on it and haven't taken todays dose  YET.. .  The first day I took it I felt a little bit weird in my brain but felt great, the foggyness was gone. Second day, I hadn't the chance to take it earlier in the day than before, felt weird in my brain for the first hour then I felt like a million bucks, when I took it for the second time that day, I was almost SURE it was 8 hours later, iIfelt like I was going to die.. trembling, dizzy, nauseous. Everything was wrong.. then after a couple hours I felt like a million bucks... it just makes me suffer soooo bad for the first hour or two then it's GREAT. So I was wondering  if yesterday  I took my doses 2 close together yesterday? I just am scared that I'm gonna end up having the first seizure of my life or something....\"", "(taken for less than 1 month)", "February 26, 2017"]},
{"text": ["\"I started taking this medicine last Saturday after I had an attack and passed out on the floor Friday and was sent to the ER. Well they prescribed me this, I have never had any situations like this before, and since I have been taking it I have been so confused, slow to react, tired, dizzy, and can't even hardly function at my job right now.\"", "January 25, 2017"]},
{"text": ["\"I know this med doesn't work for everyone, but I really love buspar. When I started it, and whenever I have gone up in dose, I'll get a few days of headaches, but the side effects are so mild, and this is coming from someone who couldn't handle 5mg of lexapro.\n\nBuspar is the only med I take and I no longer have crushing and debilitating anxiety. I've got a totally normal level of anxiety. Best of all, I feel like myself completely (minus the anxiety, lol).\n\nI take 15mg twice a day\"", "(taken for 1 to 2 years)", "January 24, 2017"]},
{"text": ["\"I started Buspar because I was having anxiety with the horrendous pain from gallbladder attacks. I started out at 7.5 for three days and then was supposed to advance to 15 mg.  During the week of starting this, I had to have an emergency surgery for my gallbladder.  When I was finally able to take this consistently, I found that I suffered from insomnia, felt restless and nervous, dizzy, and down right horrible. I have taken it less than a week and I have an appointment to see the doctor tomorrow.  If I stop taking this, will I have withdrawal symptoms?  Or should I do this gradually?  My gallbladder symptoms are gone and my body feels great after the surgery.  Any suggestions?\"", "January 16, 2017"]},
{"text": ["\"I've been on Buspar for 7 days, and I have already noticed that my life-long intrusive thoughts/rumination have died down a lot. I have also noticed a decrease in social anxiety. I'm taking 15mg a day, 7.5 morning/evening. I wasn't on anything before, so I have nothing to compare to but my untreated state.\"", "(taken for less than 1 month)", "January 15, 2017"]},
{"text": ["\"Went into anaphylaxis after third dose. Increased anxiety. Had to go to the emergency room via ambulance. Mouth, tongue, & throat were swollen, chest was tight, severe all over itching, & itching throat. Found out this only works 50% of the time. That it's a hail Mary drug. It works on half of the people, makes the other half worse. Be very cautious with this one. Because it's a 50/50 chance.\"", "January 14, 2017"]},
{"text": ["\"I take it when I have an Anxiety - feel relief in about 30min.\r\nAlso I take it before bedtime and I find it a very good sleeping pill.\r\nIf you have insomnia- take 7.5 Remeron. It will do good! I promise\"", "January 13, 2017"]},
{"text": ["\"I began taking buspirone 10mg 3 times per day and had it increased to 20mg 3 times per day. Buspirone only made my anxiety worse and gave me panic attacks daily. I am also taking fluoxetine and ziprasidone. Once I stopped taking buspirone the panic attacks stopped. This medicine didn't work for me.\"", "(taken for 1 to 6 months)", "January 12, 2017"]},
{"text": ["\"It's an excellent alternative to benzoids. I didn't notice anything right away. One day, a few weeks later I  noticed my mind wasn't racing itself into destruction anymore! I'm glad there's no benzoid withdrawal.\"", "January 12, 2017"]},
{"text": ["\"My doctor just started me on Buspirone, 7.5mg twice a day! It makes me super drowsy as if I'm drunk. I am always lightheaded, and drowsy without, I am even wondering if I have anxiety....I been on it since friday and today is Monday. So maybe in about 2 weeks I will feel better! I sure hope so!\"", "(taken for less than 1 month)", "January 9, 2017"]},
{"text": ["\"Needed something for severe anxiety and this worked really well at first. I was amazed at how well it worked for the first month and then it all went downhill from there which is strange because I have read it takes a month to work in some people. Was taking 2 doses a day and it worked great but it was short lived. Tried 3 doses a day and that only made it worse. Just felt horrible on it after a couple of months. Maybe it will  work for you but it was not for me\"", "(taken for 1 to 6 months)", "January 6, 2017"]},
{"text": ["\"I started taking buspar about 2 months ago. I started having \"brain zaps\" and I thought it was temporary. It was not. I started getting water retention and I wanted to eat more than usual. I also was extremely irritable constantly. \n\nI was told to take 5mg twice daily. I started with half a pill then after a week the whole pill 2x daily. \n\nI since then I decreased my dose to half. Now I'm off completely.  All of the side effects have stopped almost immediately.  No brain zaps, irritability decreased slowly, and water retention stopped. \n\nThis pill didn't do anything except all of the bad. On the positive side - getting off of it does not give you severe withdrawal.\"", "January 6, 2017"]},
{"text": ["\"I have Epilepsy as well as Generalized Anxiety Disorder. I have been taking Klonopin and my Doctor is concerned about addictive behavior, so she put me on Buspar and decreased Klonopin. After the first dose, I had a massive panic attack (which can trigger seizures) so I also had a seizure in which I had to go to the E.R for. It also made my hands and feet sweaty, I was shaky all over, and always anxious. I was very appreciative that my doctor let me get off of Buspirone because it is just awful! I would not recommend it to anyone, especially patients who have epilepsy!\"", "(taken for less than 1 month)", "January 4, 2017"]},
{"text": ["\"I started this for my moderate anxiety and the side effects were so terrible I had to stop. Felt like my head wasn't attached to my body, really dizzy and therefore nauseous too. I took it with food and within 15 minutes every time I feel like this. Made me vomit the first time because I was so dizzy.  I'm going back tomorrow and refuse to take it anymore. I couldn't feel any positive effects because I was too busy trying to stand straight\"", "November 30, 2016"]},
{"text": ["\"Not good experience AT ALL. I Have anxiety and depression - usually managable with 20mg paroxetine but exacerbated by stress at work- also diagnosed with C-PTSD. Take diazepam as and when to deal with most severe panic attacks. Psychiatrist assured me I could still take diazepam with this drug. After 1st dose I felt drowsy, spaced out and dizzy with heavy legs. I actually fell down a small flight of stairs in my house and later on in the day slipped on the main staircase. Decided to persevere and take another in the evening. Woke up feeling like a zombie, could hardly stay awake, headache and on edge. Discontinued. That night, woke up TERRIFIED and spent next day (today) either having intense panic attacks or wanting to commit suicide\"", "(taken for less than 1 month)", "November 29, 2016"]},
{"text": ["\"Started taking this medication for GAO. I had never taken any medication regularly before. I got diagnosed with GAO at 31.\n\nStarted on a low dose 5mg per day and over the course of a month it got bumped up to 15 mg twice a day.\n\nThis drug didn't give me immediate relief. It took six weeks but all of the symptoms of my GAO have disappeared. I am finally reaping the rewards of the full clinical effect, I feel like myself again!\n\nInitially I had side effects like dizzyness, ringing in my ears and nausea but over time they have lessened. I still don't feel too hot for the first hour after I take it but after that hour, I'm golden. I had to be patient and just deal with my GAO, which sucked. \nMy take: The juice is worth the squeeze\"", "November 27, 2016"]},
{"text": ["\"I am always hungry since starting Buspar and getting fat! But it does help with anxiety. Doctor denies it can cause weight gain. How can I stop gaining weight and lose??\"", "(taken for 1 to 6 months)", "November 26, 2016"]},
{"text": ["\"I have severe panic disorder for years now. I've been taken off ativan and put on buspar, 15mg 3 times a day. I feel amazing. no full blown panic attacks in weeks, thats a true miracle for me. my appetite is low, and I'm losing much needed weight. I'm also on neurontin for anxiety, lexapro for anxiety and depression. I have to say, this is the best I've felt in over 10 years. this buspar works for me, amazing drug.\"", "(taken for less than 1 month)", "November 26, 2016"]},
{"text": ["\"My GP prescribed this at 10mg up to 3x a day but only as needed. As in when I would start feeling an overwhelming foreshadowing to an anxiety attack. Taken as such, this medication did nothing for me. I only got like a rush of dizziness shortly after taking. So I stopped. A couple of months later I went to visit my psychiatrist on my regular visit and I explained the buspar and dosage I was told. She absolutely disagreed with my GP's dosage and informed me I should take this drug consistently 3x a day and not just as needed since this needs to build in your system to be effective. I can't say if this is AS effective for me yet as I was misinformed on dosage from my 1st doc but it's starting to work better than only taking as needed.\"", "(taken for 1 to 6 months)", "November 25, 2016"]},
{"text": ["\"I tried buspar in addition to 200mg of zoloft. it was meant to enhance the zoloft. Unfortunately , it didn't work for me. I was on it for about 5 months, and during that time i kept having on and off discomfort , like my heart was beating harder,my stomach was always really bloated, my body heat would rise and I'd have a hard time cooling down. The symptoms were so mild I didn't really pay much attention to it, but after a while i got tired of the negative side effects and decided to call it quits. Almost immediately after i stopped taking the medication, all of those negative symptoms went away so I definitely know it was the buspar. if anyone has similar side effects, just stop the medication after two weeks max, its not worth it.\"", "November 24, 2016"]},
{"text": ["\"I finally went up to 30 milligrams a day. It helped tremendously with my anxiety. I went off after I lost my insurance and had no withdrawals like I did with benzodiazepines.\"", "November 24, 2016"]},
{"text": ["\"this medicine has worked very well for me, my anxiety has been reduced greatly, I feel I can get through the day without feeling nervous or anxious all the time. I recommend this medicine to all who struggle with moderate to severe anxiety\"", "November 22, 2016"]},
{"text": ["\"Like you, I came to this website in a desperate attempt to find any medication thst would help alleviate the mental and physical pain that I was experiencing.\r\n\r\nI have tried a couple of different SSRI medications in the past at different times but eventually discontinued them after a couple of months due to their limited effectiveness in reducing my anxiety and the side effects they caused (headache, sense of detachment, inability to gain erection or orgasm, nausea).\r\n\r\nBuspirone has been very helpful at reducing my anxiety and improving my quality of life. I am currently in week 5 of my treatment of 22.5mg per day. I take 7.5mg at 8:00, 12:30, and 5:00.  Only side effect that I experience is dizziness 15 minutes after taking.\"", "(taken for 1 to 6 months)", "November 20, 2016"]},
{"text": ["\"Was on this for a month... i went mental!! I was less anxious but the side effect were really....really bad.  I was extremely depressed and aggressive! I was itchy all over but no rashes and had an awful headache that tramadol couldn't even touch!!! Went to wedding and spent most of the time in the bathroom just to avoid people. Personally if a GP suggests this drug to you I would say no, GOD NO! But this only from my own experience. I'm now on Prozac and diazepam because it messed me up so much. Looking forward to some normality in my head!\"", "November 19, 2016"]},
{"text": ["\"I was just wondering what does everyone started out at, and if and when they knew to increase.\r\nI am currently at 5mg 2x day, I originally started out just taking 5mgs once a day at night, and then just recently increased to 5mgs 2xs a day. I know that is has helped, but i am still waking up anxious, and having some breakthrough anxiety in the day. I was wondering how others increased their does, and how they knew when they were at the right does for them.\"", "November 17, 2016"]},
{"text": ["\"I can say, Buspar (Buspirone) has helped me.  I am also on 40 mg Citalopram once day and 5 mg Buspar twice daily.  \n I have experienced way less anxiety, able to enjoy life better.\"", "November 14, 2016"]},
{"text": ["\"Buspar (or buspirone hydrochloride) works very well for me.  I have severe social anxiety and i never could talk to people.  It's still weird sometimes talking to people but i don't feel as nervous while I'm talking or when people i don't know start a conversation with me. I was taking xanax before but that wasn't working. Buspar works much better and is much safer in my opinion. I take 60 mgs a day,  15 mgs in the morning,  15mgs in the afternoon and 30mgs in the evening. It's very effective.\"", "November 13, 2016"]},
{"text": ["\"First couple of weeks it seemed to help a lot with my anxiety, I was taking 5mg twice a day. Now it seems every time I take it It I get an overwhelming dizzy feeling, kind of spaced out to where nothing seems fun and literally can't get my mind off of it. Also seems to make my anxiety much worse, started getting real bad panic attacks. Seems to make me depressed and cry a whole lot for no reason. Also nausea and stomach pains constantly. Thank god im going to the doctor tomorrow to get off this and hopefully find something that works.\"", "November 8, 2016"]},
{"text": ["\"I experienced suicidal ideation during the week that I was on this medication. Significantly increased those thoughts as well as my depressive symptoms.\"", "(taken for less than 1 month)", "November 3, 2016"]},
{"text": ["\"I suffer from depression, anxiety and panic attacks. I take Remeron for depression and Buspirone 15mg twice daily. I was on Xanax for 6 months but my doctor switched me to this because i will just continually need to be bumped up on the Xanax and it's not that effective in the long run, which is true. .5mgs do nothing for me anymore when they are supposed to suppress a panic attack and I really need them. The Buspirone puts up this big dam to hold back the river of emotions I have. I feel like I have emotions of steel compared to crying all the time. Part of my anxiety is racing thoughts. This helps me FOCUS. I haven't been this productive in 10 years. However this does NOTHING for panic attacks.\"", "(taken for 1 to 6 months)", "November 1, 2016"]},
{"text": ["\"Great medication\"", "October 28, 2016"]},
{"text": ["\"Just a little back story for you I am on low-dose Suboxone for opiate addiction that I had throughout most of my twenties (I'm 30 years old now  ; I also have anxiety) . For the past 6 months my .50 milligrams of Suboxone has helped me be clean and sober without any Cravings whatsoever !!   On day 4 of taking Buspar,  I started drug seeking Behavior . Literally was a wreck.  I was told that this would not have any interactions , that was clearly not the case with me . Please use with caution if you're an addict. It was literally a nightmare =(\"", "(taken for less than 1 month)", "October 24, 2016"]},
{"text": ["\"Before starting buspirone I read some awful reviews on it which made me not want to take it. I am now glad that I did start taking it as I've had zero side effects and it is slowly making me feel a little more human.\"", "October 23, 2016"]},
{"text": ["\"This medication did nothing....absolutely NOTHING for me, if fact, there were days when I actually felt like the world was crashing down on me for absolutely no reason, so I have a suspicion that it made my anxiety actually worse. I had pretty damn severe anxiety to start with, but like I said there were days when I was crying and hyperventilating when there wasnt even anything going on. The only good news is it didnt give me any other side effects...besides the increased anxiety. I didnt get the dizziness or fatigue that I was warned about, I'm so happy it didnt make me nauseous at all, which I was really worried about (one of my phobias is vomiting so...yea).\r\nMake sure you take this med at the same times each day, I made that mistake.\"", "(taken for less than 1 month)", "October 21, 2016"]},
{"text": ["\"Took 1dose today for the first time and I felt dizzy instantly and was out of it for the first hour , within that hour I ate dinner. I felt ok but I experience this sharp pain in my head that was worse than a migraine. The pain was excruciating. I really hope its just a small side effect otherwise if I take it again tomorrow and I get this headache again. I'm not taking it anymore..;( so many side effects . Medical marijuana might help... ;))\"", "October 18, 2016"]},
{"text": ["\"I have suffered from anxiety & depression (with a side of bipolar disorder) since I was a teenager. I've tried so many different medications over the years! I now feel like my doctors and I have found the right mix for what my body needs. I suffer from severe degenerative arthritis as well as a few other medical concerns that placed me on Tramadol & Flexeril to try to manage my pain. When I asked for an anxiety medication back (they took me off 7 months ago), she prescribed Buspirone 7.5 BID PRN. It's only been 3 days, but let me tell you, I have noticed a SIGNIFICANT difference in my thought processes, my nerves, and my sleep. ALL of them have had positive effects. I've only experienced drowsiness in the mornings.\"", "(taken for less than 1 month)", "October 15, 2016"]},
{"text": ["\"I am on 5mg of buspar 2x a day to start and I hate it! I feel very nervous, jittery, and wired like I drank a bunch of coffee. My ears are ringing... actually it feels like my whole head is buzzing. My throat and skin hurt. I told my doctor this made me feel this way in the past but she didn't care. I feel worse like this than I do when I have constant panic attacks. I am also on 30mg Remeron. I can't sleep for more than 3 hours and I can't eat. I am 5'7\" and under 100lbs. I have tried Tazadone and ended up in the hospital. I can't handle these drugs. I am going through hell right now because of a life stressor and I know the doctors are only trying to help, but these drugs are bad for me!\"", "(taken for less than 1 month)", "October 9, 2016"]},
{"text": ["\"For GAD I take 10mg once a day in the afternoon currently.  I've been on this dose for approx 2 months and the only side effect is bad lightheaded slightly dizzy feeling approx 30 minutes after taking it which lasts for 30min to 1 hour.  I was hoping it would go away after taking it for awhile but the dizziness comes on like clockwork after taking it.  It greatly helps my anxiety in the evening after taking it but my anxiety returns mid morning.  I'm not sure I could take a morning dose because of the side effect of being light headed for awhile.  If I could get past the dizziness this medication causes and get to a 10mg 2x a day I think it would greatly improve my GAD 24x7.\"", "October 5, 2016"]},
{"text": ["\"My body is hyper sensitive to all medicines. I've had horrible experiences with all SSRI's. I take 15mg of buspar. I take all 3 pills at once before sleep. It helps calm my body down. I can say it's slightly helped and helped with my depression. I suffer from severe anxiety attacks that always result in intense dry heaving and diarrhea. (UGH I REALLY HOPE TO BEAT THIS ONE DAY!!) Because of the severity of my anxiety I do take other things to help level me out. I'm on a low dose of xanex (which I regret, I can't get off without crazy withdrawal symptoms.) I also take 50mg of 5htp at night, and recently magnesium every other day which I'm starting to feel a difference with. Hope this helps! Consult a doctor and see what works for you!!\"", "October 2, 2016"]},
{"text": ["\"Dr prescribed for anxiety...Took 1 pill...had brain zings, trouble sleeping palpitations...will never take again..\"", "(taken for less than 1 month)", "October 2, 2016"]},
{"text": ["\"Have had some anxiety for the second time in my life. The first time I did well with Xanax as needed and also Ambien as needed. I got through the rough patch and didn't need anything anymore for almost 2 years now. Right now it's been slowly coming back due to some stress back in my life. So I went and they gave me Ambien, which I do well with and Buspirone. I took it (only 5mg) today at 2pm. 30 mins later I started feeling very off, like my anxiety was getting worse every minute. My heart started racing, I was sweating all the sudden and when I tried to sit down and drink some water, my hands were so shaky that I could barely drink it without spilling. I was TERRIFIED!!! \r\nWent to the ER and my heart rate 204. Never take this horrific med!!\"", "October 2, 2016"]},
{"text": ["\"I took busprione for three weeks I quit taking it because the side affects were to much. After I got off it I had non stop headaches for two weeks and still going. I have never had these headaches before in my life until I stop taking this medication.  I was so worried that I got a CT scan just to make sure I was fine. Dr told me everything check out but the headaches are still coming.\"", "September 28, 2016"]},
{"text": ["\"23 male, been taking buspar for 3 years now for anxiety/ocd with intrusive thoughts. I originally started with 10mg 2x a day. Took about 2-3 weeks to take effect, after that I really noticed a difference in my anxiety and intrusive thoughts. It really helped me get through the day and feel normal. I occasionally still had panic attacks that would eventually pass with drinking a bunch of water and sometimes taking an extra \"helper\" dose. Recently switched to 3x a day still at 10mg since the med doesn't seem to last as long as it used to. Still occasionally take a \"helper\" dose to fall asleep. Side affects were/still are antsy legs, dizziness, drowsiness, and extreme appetite all for only about 30 min. Overall better than anti-depressants.\"", "(taken for 2 to 5 years)", "September 28, 2016"]},
{"text": ["\"I've been on buspar 15 days now. I can't say as if yet if it has helped alot or not. It's not bad but I have noticed certain things I go through that I'm not sure if it's side effects or just my anxiety. Like I feel drowsy about 30 minutes after. I've noticed tingly or itchy sensation in hands, feet, arms (different times). Also more headaches than before I started buspar. LightheadedNess even though I've felt that way before taking it. Upset stomach, or nausea. Sharp sensation in different places. Oh yes and definitely noticed wierd dreams. The reason I rate a five is because I do feel like it brings a calmNess over me and my racing thoughts aren't so bad and after the first week I can see that it keeps me tired more and I do sleep better.\"", "September 21, 2016"]},
{"text": ["\"I have worked in the pharmacy going on 22 years. I hate taking medicine! However Buspar saved my life. I am prescribed Buspar 10: 1 tab twice daily (12 hours apart). I take it for anxiety (Severe chest pain, worry wart). I have experienced these chest pains that started in my late teens. As I got older, the chest pains got worse, to the point it would take my breath away. I played with the dose & after 2 years...I only take 1 tab at bedtime. Once in a blue moon I will take a morning dose if my chest starts to feel heavy. If you have doubts or concerns, please talk to your pharmacist. A dr sees only his patience, a pharmacist sees ALL patients from every walk of life. I have also lost weight because now I sleep through the night. Down 12 lbs\"", "September 16, 2016"]},
{"text": ["\"I am taking SSRI to help me deal w my job, and daily life stressors.  I switched from Zoloft to buspar approximately 3 weeks ago, due to side effects.  I have sleep issues due to being a night shift person, and probably anxiety, so I'm on Ambien as well.  Lately, I'm having worse sleep problems, and having weird dreams.  I've read, Buspar can cause insomnia.  Planning on taking my dose all at once during my waking hours.  Anyone taking it just once a day?  And what's your experience.  Thank you.\"", "September 13, 2016"]},
{"text": ["\"My experience with buspirone is that it gave me horrible headaches, but on the occasions I don't get a headache, I REALLY like the way bispirone makes me feel- chill. I was on Zoloft & lexapro and all those did for me was make me nauseated. W/ buspirone, iwould break the tablet into .5 & sometimes go up to 15, Even with food and water intake. \nAnyone else whose had this experience w/ buspirone, please share your story whether it's similar or different- would love the feedback. \n& anyone with the same head ache side affects, how do you go with treating that?\nAlso, If you've had success with taking buspirone & Xanax together or within the same day, please advise\n\nXo\"", "(taken for 1 to 6 months)", "September 10, 2016"]},
{"text": ["\"You have to take this for about a month before you will notice a difference in your anxiety. Please don't take anyone else's medications. It's illegal and unsafe. Work closely with your MD to find the dose that's right for you and it can help a lot. I'm an ER nurse. It worked for me. Peace!\"", "(taken for 1 to 6 months)", "September 10, 2016"]},
{"text": ["\"Buspar has been a godsend for me. First, was on 10mgs twice a day. Now I'm on 15mgs twice a day. No side effects and I've had no need for benzos since. On one year now.\"", "(taken for 1 to 2 years)", "September 10, 2016"]},
{"text": ["\"It didn't help at all with the panic attacks and actually made my anxiety worse. The first few weeks it would just put me to sleep. After four weeks I became very depressed and had suicidal thoughts constantly throughout the day. It gave me horrible headaches, it made me really dizzy all the time and I felt lightheaded and nauseous often. After four weeks I could not sleep at all and my anxiety increased along with the panic attacks. I don't recommend this medicine for anyone who has suffered PTSD or who has had high anxiety levels for a long time. It just makes things worse. After five weeks I stopped taking this medication I could no longer handle the side effects.\"", "(taken for 1 to 6 months)", "September 8, 2016"]},
{"text": ["\"I have never written a drug review but am now in hope of helping those who feel as apprehensive as I do about meds. I suffer from anxiety and was prescribed Buspar and out of fear didn't try it for 4 mos. By request I was given the lowest dose, 5 mg BID. One day I got up the nerve to try it after speaking with 2 pharmacist getting the ok to safely break it down. I broke it into eights, which was around 62mg, not enough to do anything but they were sympathetic to my reluctance, I went up an 8th every couple of days. I am now on 7.5 BID. I had no side effects minus slight tiredness, I attribute the easy transition to slowly going on it. I have been on it 3 weeks now, I can't tell a huge difference so I am hoping more time is what in needed.\"", "September 6, 2016"]},
{"text": ["\"I was prescribed Buspar for anxiety. If I knew that Buspar had the side effects that I got, I would never drink it. I drank it for 4 days only and it almost got me killed. I started having panic attacks, I could hardly breath, I had electric shocks, brain zaps,  horrible medicine. I quit right away. Little I knew that quitting even after 4 days would cause side effects. I could not sleep for 2 weeks afterwards, I thought I was dying. Horrible medicine. I will never drink any anti-depressants or anti-anxiety medicin that is not natural!!!!\"", "September 2, 2016"]}
]