[
{"text": ["\"I began treatment for anxiety at the age of 16years old. Now 7 years on and I have used a variety of different medications to try to relieve symptoms. My list includes: sertraline at dosages 50mg and 100mg (1x daily); citalopram at dosages 10, 20 and 40mg (1xdaily); diazepam (Valium) dosage at 2mg (3xdaily); zopiclone (sleeping aid) 3.75mg (1xdaily) and propranolol (beta blocker) 40mg (3xdaily). At the moment I am taking a combination of sertraline (100mg), diazepam and zopiclone and this JUST keeps things under control. I am often tired throughout the day and suffer from sleep paralysis at night or in the morning. The only notable side effects that impact my life day to day are a reduced libido and headaches. I also see or speak to my psychologist and my psychiatrist weekly who help manage my medication and emotions while providing self help techniques and support.\"", "(taken for 2 to 5 years)", "November 16, 2018"]},
{"text": ["\"Let me start off with thanking valium for helping me to get onto an airplane after years of fear! I got on that plane like I owned it lol... got into Mexico and was still calm as a clam on the taxi ride to the hotel. OK but now my anxiety has come back to me lately and I've felt the need to take 5mg of valium almost every other day...I'm a changed person on it... I have no fears, it helps me save the world... it brings my appetite back to the point I want to order everything off the menu... I'm more calm with my children I'm happy and playful. I do also see a counsellor once a week and I am aware of the unfortunate withdraws valium could possibly have.\"", "(taken for 1 to 6 months)", "November 5, 2018"]},
{"text": ["\"These where the only thing to even touch my my severe anxiety and depression, I took 20mg a day which I believe is the highest dose a doctor would recommend? Which I needed. But anyways fast forward roughly a year later and before I can get more I notice how awful I start to feel, then I realised I'd become dependant on them. So I took it up with my doctor who refused to help and an addiction clinic who said because of the dosage and length of time I'd being taking them I needed to go to the hospital (but I didn't want to let anyone know how bad I was) and basically the next 6 weeks where hands down the hardest time of my life and I genuinely thought I was going to die at times but I stuck at it and finally 8 months later I'm able to function semi normally. With only an occasion relapse when the PAWS (Post Acute Withdrawal Syndrome) act up. My advice? Be careful and do exactly what your doctor says. A year of mental stability was in no way worth the 6 weeks of torture\"", "(taken for 6 months to 1 year)", "October 29, 2018"]},
{"text": ["\"I’ve been using Valium prn for 15 years, since going through an acrimonious divorce and custody battle, and raising  two boys on my own who both have psychiatric / emotional illnessess. Diazepam has literally been a lifesaver for me. I have what my doctor termed as ‘severe and persistent anxiety’. I never had any problems with cognitive function or tolerance until the last few years when relentless circumstances caused me to increase my doses and then started getting symptoms of tolerance withdrawal. I’m currently stable on 10mg and will be tapering next year when my son finishes school. I’m not looking to stop completely, just wanting to return to my as needed dose as I have a far better quality of life when I can use them as a tool to quell my anxiety and make non-reactivate decisions when I’m under stress. I would give them a ten if not for the tolerance, but this can be mitigated by responsible use.\"", "October 27, 2018"]},
{"text": ["\"I am in mid 70's. Fortunate to have had means for psych therapy over most of my adult life, off and on. clinical anxious depression, extreme losses in earliest years. I found immense help from Senequan (doxipen) in the mid 80's.  Valium was 5mg no more than 3-4times weekly. Those meds gave me a life. I am now on 20 mg Lexapro nightly 10 mg doxipen, and 2.5 mg Valium no more than occasionally. A life saver when used sparingly. I've not had any negatives in decades of careful use.\"", "(taken for 10 years or more)", "October 26, 2018"]},
{"text": ["\"Took this for maybe 7 years for panic. Daily usage, average of 15mg per day.  My life is ruined now. I was cut of it too fast and went into acute withdrawal, trust me you do not want to know how it feels. I thought it was so safe and innocent. I was already so panicky and agoraphobic. Now I'm in a constant spasm, feel exhausted and am losing my memory. Brain is worn out. I'm only 32. It's made my psychosis terrifying and I'm scared I'm dying every day. It is incessant and I could not cope without my dad. At first I noticed text moving around and a sensation that my brain was squeezing, then it was like I was falling into darkness in my mind and couldn't hold on. I fought and fought but I think I was just blacking out. Its not just sleeping, you are fighting for your life. I became so psychotic and scared I tried ending my life. Unless it is occasional, light use I'd stay well away from benzos. You don't notice you are slowly losing your mind over time. Its not worth gambling with.\"", "October 23, 2018"]},
{"text": ["\"I was originally given diazepam for migraines. I have been on it, then off and on it for ten years.  This past May I was taken off very abruptly. I had no withdrawals whatsoever! It worked for my panic attacks, migraines and muscle spasms. I was taken off of them because the drs. are too scared to give them to patients that actually benefit from them. The best medicine ever, now I have to take four different meds that still do not work!\"", "(taken for 5 to 10 years)", "October 22, 2018"]},
{"text": ["\"I've been on benzos for 15 years. And for 15 years I was miserable. Taking a benzo for a short time is ok but I got addicted to them and was in and out of the hospital 7 times in those 15 years because of them. I'm completely off all benzos, diazepam being the last one I took and I feel fantastic. I can go to sleep on my own and I have no anxiety or desire to take anymore. If you really need them they're good for a short time but confronting what's making you anxious and seeing a therapist is the best option. I take buspar once in awhile for any panic I might have and that works great. But please think about how your going to feel in the long term before getting on any benzo.\"", "(taken for 10 years or more)", "October 17, 2018"]},
{"text": ["\"Dose low 2mg 3  x day.\"", "October 4, 2018"]},
{"text": ["\"I was put on this medication for Ménière’s disease in March 2013 I am up to 30 mg a day and it helps my Ménière’s but is never helped my anxiety. It has made my anxiety worse to the point I have panic attacks and refuse to leave home. Doctor gave it to because it helps with my Ménière’s but for some reason it doesn’t make me tired it doesn’t do anything but help me keep my balance\"", "(taken for 5 to 10 years)", "September 24, 2018"]},
{"text": ["\"My psychiatrist prescribed Valium 5 mg 3x a day for anxiety. I didn’t tell him I had anxiety he told me I did! I had said it was depression. I never really felt anxious but took it thinking he must know what he’s doing. Well that was the beginning of the worse experience I’ve ever had. I took it as directed & within a week I started having horrible anxiety! Never did I ever have this feeling before. It was sheer panic & extreme agitation. It was especially bad between doses but even when taken it did little to stop it. I literally was in hell. How could Valium cause me severe  anxiety?? Well I learned it was a paradoxical reaction. My Dr brushed it off & I ended up in patient at a hospital for 2 weeks! They gave me muscle relaxers & neurontin  to try to calm me down. Then they gave me seroquel which made me a virtual zombie. These meds starting with the careless actions of a  so called Dr  destroyed my life for months & put me & my husband through hell.\"", "(taken for less than 1 month)", "August 24, 2018"]},
{"text": ["\"I have a phobia about going in for surgery. I have panic attacks thinking even when my husband goes in for his surgery . I have walked out of the operating room before. I've told doctors many times that I've needed something and they gave me a low dose of Xanax which just wasn't strong enough and I had bad experiences going in for my surgeries. This one doctor gave me diazepam 5mg told me I could take one to two the day before and the morning of my surgery - so thankful for this doctor giving this to me because it helped me and I wasn't so nerved up. I definitely recommend diazepam it calmed my nerves down a lot\"", "(taken for less than 1 month)", "August 17, 2018"]},
{"text": ["\"I have been taking it sparingly for years, just 1 (max. 2) mg to send me asleep when stressed out and anxious, nowadays, with horrible tinnitus.  The longest I took it was 6 days on the trot for extreme anxiety. It helps to calm down my stomach, the life-sapping stress response in the body. Then, I have a big break, try to use some of the CBT techniques I learned, then again, when it gets too much. It saved my ass many times.  In the meantime drink herbal teas (Melissa, nettle, Valerian) and try to exercise (walking, cycling) and eat healthy foods (lots of vegetables, fruit in moderation and organic meats, nuts, seeds, unpasteurized cheese, etc.).  I am so pleased that it is helping other people. There are times when you just cannot do it on your own. It can be hard but I hope there is a light at the end of the tunnel.\"", "(taken for 2 to 5 years)", "August 15, 2018"]},
{"text": ["\"I have GAD and depression ! Having surgery and pre-op tests. Blood, EKG and Dr exam. I’m so nervous can I take Valium before I go even with EKG\"", "(taken for 10 years or more)", "August 13, 2018"]},
{"text": ["\"totally makes me feel so relaxed and I end up falling asleep\"", "August 8, 2018"]},
{"text": ["\"Valium is the best benzo I've ever tried for anxiety and panic attacks. it blows ativan out of the water.\nValium 5 to 10mg as needed is perfect.\"", "(taken for 1 to 2 years)", "July 30, 2018"]},
{"text": ["\"I suffered from anxiety symptoms for years! I was having panic attacks daily! \nBy the time my dr tested for everything & finally suggested I get screened for panic disorder: I was so bad that I had not lefty my bedroom for months! I was diagnosed w/panic disorder w/severe panic attacks and agoraphobia and depression!  I started on fluoxetine and 10 mg of diazepam that I take at bedtime! I immediately felt better, was able to sleep for more than 2 hrs a night! It has been 2 years and I am still on fluoxetine, 10mg diazepam and I take clonazepam  during the day when /if I have a panic attack!  We have tried different cocktails of medicines but this seems to work the best for me! Every person is different: be patient & you will find the right mixtures of medicines that will help u control your anxiety! Hope this helps! good luck!\"", "(taken for 2 to 5 years)", "July 11, 2018"]},
{"text": ["\"I was diagnosed with anxiety, depression, panic attacks & PTSD. This medicine has helped me tremendously. Only take 2mg as needed & haven’t had any addiction problems. Often times when I get so worked up my family members & doctors remind me to take Valium. I use it as a last resort only when I can’t calm myself down, so I am definitely not addicted. I only have to take it a few times a month. For me 2 mg can keep me calm for 2 To 3 days. It helped me go back to work and go out in public places. It has given me a part of my life back. It does not make me sleepy and I have not had any side effects. This is the best medication I have ever taken for my anxiety& my depression. It has helped me live life again.\"", "(taken for 1 to 2 years)", "June 12, 2018"]},
{"text": ["\"Having been prescribed for anxiety, which is fairly effective, I recently tried 5mg of Valium for my period pain. I recently ceased the depo injections, which stopped my cramps and periods completely.\nThe pain is debilitating, I’m curled up wanting to cut my uterus out with a knife!\nI added the Diazepam into the mix along with the standard ibuprofen and Codeine, which help but not completely. Within 15 minutes, I use the heat whilst waiting for everything else to kick in, I start to feel better and after half an hour am virtually pain free. I’ve read that going down on my hands and knees would help, as the uterus hangs and relaxes. I do this with the heat pack stuffed in my waistband and maybe this helps take the edge off so quickly. I look like a fool, lol, but when it’s bad, as we all know it can be, you’re willing to try anything.\"", "(taken for 2 to 5 years)", "June 9, 2018"]},
{"text": ["\"I first begain taking diazepam after a long, candid conversation with my general doctor. I had used alcohol for years to suppress my anxiety. I quit that by tapering on my own, but knew I had to address the core issue if I could remain off of it. The dr. was very open and prescribed me a light dose of 2mg diazepam to be taken 3 times a day as needed. The medication worked wonders. There were (and still are) days that I would not use any, and days were I would need 2 or 3. I made sure to use the drug very carefully. So my dr. gives me a script each time I see him, every 3-6 months, making sure that I make them last. Unfortunately, people do misuse diazepam and all that really does is make it sound like a dirty drug to those of us in which it does wonders! Btw, with my insurance, it costs me just over $4 per prescription.\"", "(taken for 1 to 2 years)", "May 17, 2018"]},
{"text": ["\"15 years ago my mother gave me a Kolonopin to help me out on my first plane ride and the euphoria of freedom from anxiety was instantly addicting. I soon got my own RX and over the years I was up to 4mg a day and my anxiety wasn’t improving. A very incredible psychiatrist told me it was now just harming me and my tolerance was far too high and he amazingly got me off Kolonopin to taper with Valium because of the longer half-life. I’m now down to 12mg a day (from the converted 60!) and it’s been hell. I’ve never been so anxious and  depressed. Though this is SADLY normal with tapering.\nI’m working with therapists and trying to keep on a schedule of exercise and deep breathing but I fear I’ll never be able to break free from these terrible drugs that are killing me. (I also lost 80 lbs and my BMI is under 17 after the taper.) \nWhile I hate all benzos for what they’ve done to me, Valium is definitely the lesser of all the evils.\"", "(taken for 2 to 5 years)", "April 16, 2018"]},
{"text": ["\"Shame doctors don't use it for temporary help. Good stuff when not abused which I did do when I was younger.  Used in moderation  and works wonders\"", "(taken for less than 1 month)", "April 7, 2018"]},
{"text": ["\"I average about 10 valium pills (5mg) per month.\nHelps with:\n1) Blood pressure spikes\n2) Occasional anxiety\n3) Difficultly going to sleep\n4) Jetlag sleep disruption-international flights\n5) Have used prior medical procedure to reduce tension & anxiety\n6) Can be used when wanting to reduce alcohol consumption\"", "(taken for 2 to 5 years)", "March 11, 2018"]},
{"text": ["\"I am from the UK.\nI am prescribed 5mg diazepam for severe bouts of anxiety to take occasionally when absolutely needed. \nThe diazepam really helps but please don't under estimate how dangerous these meds can be when not used responsibly. Only use under the careful advice of a qualified Doctor. \nSo the insane hellish anxiety is calmed and soothed and I get a few hours of blessed relief with diazepam. It's like pouring a cooling balm over a painful burn. \n\nMy criticism is that the effects only last a few hours and they are highly addictive and can be very dangerous and hell to wean off. Please use responsibly for short term use only if possible. Please use wisely and also\nread the literature that come with the meds.\n\nDiazepam has been a blessing for me when used occasionally when absolutely needed. It has provided relief from severe suffering. But I can't emphasize enough to please use carefully and responsibly, and under proper medical guidance by a qualified person.\"", "March 10, 2018"]},
{"text": ["\"Hi\nI take Valium (diazapam) 1.5-2.5mg every second week for a few nights to help me sleep. My insomnia had become so bad it was effecting my memory and my work during the day and increasing my anxiety. I find it really helps me sleep well and function better during the day. Also reduces my anxiety and I don’t get side effects. My recommendations to take it less often so it works when you need it. I don’t find it addictive. It does have a long half life so it can build up in your system fast so that is something to watch.\"", "(taken for 1 to 2 years)", "February 28, 2018"]},
{"text": ["\"I've been on this medicine for over 3 months now and it has been a lifesaver for me, I take three 5mg diazepam a day about every 6 hours and I no longer have the panic attacks, depression has decreased 90%, I sleep at night since my brain can finally shut down, I have hardly any horrible thoughts anymore which plagued me before always worrying that something bad would happen to my kids or family members, I also don't have to get up to go to the bathroom 4-5 times a night anymore. My Dr also started me on Lexapro 3 months ago but I haven't noticed any effects from taking it since the diazepam is so helpful.\"", "February 27, 2014"]},
{"text": ["\"I am taking 2mg three times a day for anxiety. The anxiety is much better now and I can go places without having panic attacks. I feel the best I have felt in a long time.\"", "(taken for 6 months to 1 year)", "February 13, 2014"]},
{"text": ["\"Used it for 12 years and it was a life saver great medicine.\"", "(taken for 10 years or more)", "January 4, 2014"]},
{"text": ["\"It works well for Meniere's disease aka as vertigo but does absolutely nothing for my anxiety/panic attacks. I have been on 7.5 mg twice a day for 7 months prior I was on 5mg twice a day. I gave it a 4 because it helps the Meniere's but not the anxiety. I was also put on Zoloft but had to stop after 14 days do to side effects. I was only on 12.5mg tried 25mg and had horrible side effects.\"", "December 23, 2013"]},
{"text": ["\"Valium has been a lifesaver for me, I probably wouldn't be here without it. I suffer from severe anxiety, panic disorder and clinical depression. This has got me through some very bad times when I thought I was dying and couldn't cope. I take 10mg during bad spells and it gets me through.\"", "(taken for 10 years or more)", "December 22, 2013"]},
{"text": ["\"My experience with this medication has been very positive.  \"", "(taken for 5 to 10 years)", "December 21, 2013"]},
{"text": ["\"It took a lot of persuading my psychiatrist but eventually she gave in and prescribed me Valium 2 mg yesterday.  Within twenty minutes of my swallowing the first tablet, the difference it made was just incredible;  no anxiety whatsoever and I felt very calm, even happy, as I also have clinical depression.  Valium (diazepam) is simply great in my (albeit limited) experience so far.\"", "December 7, 2013"]},
{"text": ["\"Well, the first time I had a major attack they put me on diazepam but it messed with my head really badly and I had memory issues. My discharge papers noted that while medicated by it I had little to no acknowledgement of externally inflicted bodily harm/pain. What I do remember is waking up the next day with a swollen ankle and multiple bruises that hurt like hell from walking into things or just letting the car door close on me.\nLater, someone recommended me this treatment, and I'm very grateful with it, I can go anywhere I want without problem, no anxiety, no panic attacks, I'm a new person.\"", "November 16, 2013"]},
{"text": ["\"I rate diazepam a \"10\", it's still the best & safest in it's class -- but only when taken very sparingly. I liken it to a 'fire extinguisher', use only in case of emergency. If you take on a daily schedule (e.g., 3 times a day, every day) then you're making yourself a slave, and you'll be dull-witted & stupid much of the time. Just like reliance on any pill. We owe it to our families, friends, employers and ourselves to be productive, happy and helpful.\r\n\r\nI have the 5 mg. tablets in case of emergency. It acts fast, not too strong. There's no craving for 'another pill' hours or even days later, because it's very long acting. Be smart. Use only in case of real emergency and it's the best.\"", "October 26, 2013"]},
{"text": ["\"Without this I would be lost and panicking all the time. Keeps me calm through the tough time.\"", "(taken for 1 to 2 years)", "September 5, 2013"]},
{"text": ["\"It really relieves my anxiety.\"", "August 27, 2013"]},
{"text": ["\"Brilliant. A life saver for anxiety. No side effects.  Better than antidepressants any day.\"", "August 23, 2013"]},
{"text": ["\"All of my life I've had varying levels of social anxiety & agoraphobia, usually without any logical cause. Even riding in cars made me unduly nervous. I had a rough, fear-filled childhood and that seemed to set me up for chronic nervousness. But there's no room for that in adult life. Valium eliminates the unnecessary anxiety & also helps with muscle spasms from my fibromyalgia. I don't get fatigue from this during the day. I do find that taking one before bed helps me relax my 100-miles-per-hour brain (stupid racing thoughts & worries) plus my muscles don't get all kinked up in knots while I'm sleeping. I've never needed to increase my dose on it even after several years, since it works as well as the day I started it, personally.\"", "(taken for 2 to 5 years)", "August 20, 2013"]},
{"text": ["\"The best short term solution to anxiety!\nI've been on diazepam for over a year. \nIt's great to always have there in case a panic attack starts to come on, and it completely takes the edge off any stressful situation.\n\nIt seems doctors are reluctant to prescribe diazepam, however if you are prescribed this medication, it's definitely a life saver.\n\nI take 2.5mg at a time (from 5mg tablets).\"", "(taken for 1 to 2 years)", "July 21, 2013"]},
{"text": ["\"I have tried many medicines over the years for my anxiety, none of which ever worked. This completely obliterates my anxiety. I take 5mg twice a day.\"", "(taken for less than 1 month)", "July 14, 2013"]},
{"text": ["\"I take diazepam as needed for vertigo and the resulting anxiety--it's incredible!  2.5mg causes me to settle down and completely forget that I was anxious in the first place. I experience no withdrawal symptoms, but then again I take a low dose and only every few days.\nMy only side effect is intense hunger a few days after taking it--but that's a very small price to pay since now rooms aren't falling and I can sleep without the sensation of my bed swinging!\"", "(taken for 1 to 2 years)", "July 9, 2013"]},
{"text": ["\"I've experienced anxiety attack/panic attacks the last 2 years started off slow attacks then they started getting more frequent . Worried so much that I got rushed to hospital 3 times for over breathing . Anyway I work as a miner and so I have to fly a lot and because of my anxiety was getting worse i started getting attacks in the air that was freeking me out so I went to my doctor and he put me on 5mg of Valium and I tell you what I've never felt better just calms me down and relaxs me can't remember the last time I've had a panic attack its great :)\"", "June 16, 2013"]},
{"text": ["\"Very effective against anxiety possibly the best.\"", "(taken for 5 to 10 years)", "June 15, 2013"]},
{"text": ["\"Works Better Than Ativan(Lorazepam) And Xanax(Alprazolam)!\"", "(taken for 5 to 10 years)", "June 15, 2013"]},
{"text": ["\"It works well for my condition. I am under a great amount of stress and my body would shake I broke out in hives and my heart would beat very fast at times and I was not sleeping at all.\"", "(taken for 1 to 2 years)", "April 3, 2013"]},
{"text": ["\"I'm 36, have social anxiety, GAD, TMJ, fibromyalgia, muscle spasms, cluster headaches, & herniated vertebrae.  I've taken everything, including 12 years on a high dose of Xanax. After finally convincing a doc to prescribe me Valium, I felt like a different person. It kicks in FAST, but Its long half-life prevents that awful anxiety rebound effect. I find that Valium has a powerful (yet feels gentle) calmative effect on the body as well- which is absolutely wonderful when my muscles & joints are tight. Valium is hands down the best benzo anti-anxiety medication out there.\"", "(taken for 2 to 5 years)", "March 9, 2013"]},
{"text": ["\"I began taking Valium from doctors in 1968 or 1969 when I was in the Vietnam War and experienced a great deal of combat which affected me very much. It helped.\n\nI have been taking Valium for decades. It increases irritability greatly probably because of head wounds that caused brain damage. 1000 to 1200mg Carbamazepine stops or reduces the irritability.  Unfortunately, the combination of the two medicines causes tiredness.\"", "December 15, 2012"]},
{"text": ["\"It helps calm me down instantly. When I feel like I can breath and that I am drowning in anxiety it truly helps!\"", "(taken for 1 to 2 years)", "December 13, 2012"]},
{"text": ["\"Helped me through the worst feeling in my life up until that time I never thought that my body was capable of those horrible feelings or emotions.  Feelings of fear and dread of not knowing how to fix it until EVENTUALLY a very understanding doctor prescribed me diazepam. They gave me hope, they gave me the confidence I needed to fight back from this awful place I was in. I lost weight and weighed only 5 stone 10 pounds because I just couldn't eat but diazepam allowed me to start eating again. I did recover but the experience has left me with anxiety which is now 15 years ago. I struggle every single day and doctors at my surgery are anti-diazepam. I get so scared that my anxiety will get so bad again without them.\"", "November 14, 2012"]},
{"text": ["\"I have benign recurrent vertigo and migraine-associated vertigo. Both are a source of extreme anxiety for me, and that anxiety makes the spinning worse. Valium (2.5mg as needed) calms the anxiety within 15 or so minutes, and the vertigo tends to leave soon afterwards. I have had no side effects, save for being very hungry the day after I take it. It gave me my life back.\"", "(taken for 1 to 6 months)", "September 29, 2012"]},
{"text": ["\"I can't eat or be around a lot of people with out it or zannex. Zannex is good but doesn't last as long. My Mom even said while I was on diazepam, it's good to see a smile on your face:-)! It may may make you feel kind of goofy for a couple days but after that it just helps. The sedation subsides as well. A very tolerable medication that really does help. Trust me!\"", "(taken for 1 to 6 months)", "July 15, 2016"]},
{"text": ["\"I am a newbie to Valium. Just took my first dose today, 10 mg. The doctor prescribed it for the acute anxiety attacks I have once in a while. I have generalized anxiety disorder mixed with bipolar disorder. I take Pristiq for the anxiety and it has helped but it doesn't cover everything. When I'm anxious I cannot go outside and become bedridden. I am also on 70mg of Vyvanse for ADD and it took the doctor some time to be convinced of the benefits of taking a benzo. You know, the whole upper/downer concern. I took my Valium in the evening when the Vyvanse was wearing off. It worked wonders. It kicked in 15 minutes upon taking it. the only side effect is that I feel a little wobbly when standing. But the fact that I am calm makes up for it\"", "(taken for less than 1 month)", "July 12, 2016"]},
{"text": ["\"I also have analgesia for recurrent kidney stones. Diazepam is particularly useful at night - 5-10mg in aiding sleep and reducing the need for strong analgesia. It has also been great in helping reduce my alcohol intake.\"", "(taken for 2 to 5 years)", "July 8, 2016"]},
{"text": ["\"Date: 07-08-2016...Re Valium: I have been taking Valium for the past three years as I suffer from Generalized Anxiety Disorder. I very seldom take Valium. Like, 4 mg a week or 4 mg twice a week or I can go a month without taking it.  It is very subtle, it will start working after 20 minutes which has been my experience.  Valium does melt my anxiety and panicky feelings away even at 4 mg. After taking it, I would feel like my old self.  I tried to score it by 2 mg; however, it is not effective.  I think those who try it the first time should go 4 mg or 5 mg. I am also taking an SSRI for my anxiety condition.  SSRI is not perfect. \r\nSome days are tough so I tough it out by not taking a Valium. If you don't abuse it, you can take it for life.\"", "July 8, 2016"]},
{"text": ["\"I was prescribed to take Bromazepam, and the only thing i can say about it is that it made my head really confused. I felt drowsiness and sometimes even nausea. It affected my concentration and memory capabilities, which was really bad since i am a student. Valium, however, made me lessen my anxiety so much. The only \"side effect\" is that it makes you sleepy and it does kinda affect your memory abilities throughout the day. I use 5mg of Valium whenever i need it.\"", "(taken for 1 to 6 months)", "July 4, 2016"]},
{"text": ["\"I've tried all the benzos to treat my panic attacks, and this one I chose to settle on. It's the most mild on my system. The effects are subtle, but they successfully address the anxiety without making me too tired. I try not too take more than 2 10mg pills per week. I also take 200mg Lamictal and 20mg Prozac, which lessened the instances of panic.\"", "(taken for 1 to 6 months)", "June 17, 2016"]},
{"text": ["\"I have a very positive experience with Valium. I'm taking it 8 years now, only as needed. This medication allows my to relax and socialize.  But...\"God over everything\" is my motto.\"", "(taken for 5 to 10 years)", "June 13, 2016"]},
{"text": ["\"I had have valium for 4 years for anxiety and panic attacks. It works in the beginning but the last 2 years had been a hard struggle with witdrawal symptoms and it is a drug that is really powerful and will make u addicted to it. It is so hard to stop with valium and the taper had take almost 2 years!!! I have 40 mg in the beginning and is now on 11,25 mg. Will continue ten mor weeks. Thw w/d is the worst thing I ever felt. It makes me so sick. And I dont wish my worst enemy this. Never start with a benzo if u dont want to destroy your life fpr ever. In Sweden the smallest amount is 2,5 mg, we dont have fluid so I made my own titration. Valium had stole 2 years of my life ...\"", "(taken for 2 to 5 years)", "June 13, 2016"]},
{"text": ["\"My doctor will not prescribe medicine for my panic attacks.  I have depression and when I have a panic attack have trouble breathing.  Doctors will not prescribe valium for these attacks because he says they are addictive.  This is crazy.  I am not a drug addict and need something to help me thru these attacks.  What to do.  Maybe a little lead to the head would take care of these attacks.\"", "May 14, 2016"]},
{"text": ["\"I suffer from panic attacks. They occur maybe twice a year. When I do have one it feels like a heart attack. I have tried Xanax and hated the way it made me feel. Valium, or diazepam is the only pill that when I am having a panic attack I take it with in minutes it calms me down and I snap right back to normal. I have no side effects, no drowsiness. This is because I take it for extreme emergencies when I truly need it. One time I did take it just to fall asleep and I did hallucinate and made me feel drowsy. I never did that again. This pill works for panic attacks. Though mine a rare I would recommend it to anyone who suffers from them. They are not addicting if you take them the right way.\"", "(taken for 1 to 6 months)", "May 9, 2016"]},
{"text": ["\"I have taken this for many years 5mg x 3 a day. My nerves will take over without it and my new doctor wants me to quit taking them. Why when a medicine works for you does a new doctor want to undermine the other doctor it seems and change everything.  I am 58 and I think I know how my body reacts to medications a bit better than someone that has seen me in an office for 10 minutes.  They don't listen.  Is there doctors still out there that see some people need Valium to be able to function in life and their jobs. I have worked all my life and contributed to society yet to be treated like a drug addict when going in to the doctors office. Does anyone have any helpful advise on how to choose a doctor that understands? Thanks\"", "April 24, 2016"]},
{"text": ["\"I've suffered from Chronic Anxiety induced Agorphobia since 2nd grade. As I got older, my anxiety is getting worse by the day. I'm currently 23. I've been on Clonazepam 1mg 3x daily, Alprazolam 1mg 3x daily, and Lorazepam 1mg 4x daily. They ALL helped, but not enough. My psych finally introduced me to Diazepam, and put me on 10mg 4x daily. My first dose, I said WOW. What a RELIEF. It feels like a combo of all the benzos I listed above. I LOVE how it peaks very fast AND has the longest half life. Diazepam is absolutely the PERFECT Benzodiazepine.10/10.. Thank you DIAZEPAM!\"", "(taken for 2 to 5 years)", "April 5, 2016"]},
{"text": ["\"My disclaimer is: Valium is highly effective in treating stress and anxiety reactions. It has a wide therapeutic index. It is sometimes overly affective thus why people abuse it. If you do; I can promise the effects will be life damaging. When taken responsibly (usually a few times a week as needed) it is safe & a godsend for those crippled with anxiety. I had no side effects.\"", "(taken for 5 to 10 years)", "August 23, 2015"]},
{"text": ["\"I've suffered from debilitating headaches always beginning in my lower neck from tension. Often these headaches about twice a month would morph into full blown migraines lasting 1 to 2 days. 5mg of Valium relaxes my neck muscles with an aspirin and I'm good to go and have my life back.\r\nThe migraine meds caused terrible side effects.\"", "August 3, 2015"]},
{"text": ["\"My experience with this drug has been overwhelmingly positive. I suffer from panic attacks, as well as agoraphobia, and despite having been on Valium for many years now, it has retained its efficacy and it has greatly enhance the quality of my life. Frankly, I do not know what I would do without it. Yes, yes, yes, I am all too well aware of the numerous warnings and tales of woe which have accompanied usage of this drug by other individuals less fortunate than myself, but I can only speak to what this drug has done for MY life. I am now 51 years old, and have taken this drug on and off for most of my adult life, starting when I was 18 years old. I become angry when I read proposals to limit prescription of this drug to psychiatrists....\"", "August 2, 2015"]},
{"text": ["\"After taking Chantix for smoking cessation I fell into a spiral of severe dèpression. I didn't feel like leaving my home other than going to work  I gained 25 pounds and felt my life was hopeless   I had always felt like an extrovert trapped in an intraverts body. I stumbled upon  Valium when my husband gave me one for muscle cramps. The effects were amazing!  I no longer felt trapped in I my prison of isolation and misery. A word of caution though: this drug is addictive and should be taken in small amounts and withdrawal should be done slowly and under medical supervision. It is a shame Valium has such a bad rap\"", "August 1, 2015"]},
{"text": ["\"Was originally prescribed as a shortcourse to take 2 or 3 daily to get through a really bad patch but I have found it works better to only take occasionally when I really need it. \r\nProvides pretty fast (within 15 mins to half hour) yet lasting (up to 3/4 hours) relief of Anxiety. Works a treat it's probably the best thing i've ever taken for Anxiety. The only criticism is it can make you feel a bit out of it and slow but it depends on the dose. I was prescribed 5mg tablets and i find that snapping them in half to have 2.5mg still works but makes me less drowsy. I adjust the dose depending on how severe the Anxiety is. \r\nIt's a good idea to experiment when first prescribed so you know how it affects you.\"", "(taken for 6 months to 1 year)", "July 17, 2015"]},
{"text": ["\"I have fibro and stenosis and take cymbalta, flexeril, elavil and a few others. My Dr said I have adjustment disorder and sent me to a psychiatrist. He prescribed 5 mg twice a day and 10 mg at bedtime and it's worked wonders. I'm sleeping 7 to 8 hours a night for the first time in over five years. My mind and body feel relaxed. I'm so thankful that I saw this Dr, this med has been the only thing that's helped me.\"", "July 2, 2015"]},
{"text": ["\"I used to be on valium back in the 90s when it was easier to get for panic attacks and ptsd and when the narcotics laws changed I got off of them because my family doctor wouldn't give them to me. Panic attacks started happening again when I have a thyroid disorder. Now I'm seeing a psychiatrist to get them again and they have given me part of my life back. Before seeing psychiatrist my Dr tried me on multiple different ssri and none of them work. And ssri drugs have me ED. Valium has only 1 side effect to me and that is just being drowsy for an hour or so. Valium is a life saver.\"", "July 1, 2015"]},
{"text": ["\"I have had anxiety all of my adult life, and at times I have been almost crippled through panic attacks and nervous tension. I have tried nearly every benzodiazepine available, and for myself diazepam is by far the most effective, safe and trusted. It is also a very good 'all-rounder' tranquillizer, useful for anxiety, panic, insomnia, muscle tension through worry, tension headaches and irritable bowel syndrome induced through anxiety. I have never become addicted despite years of use, I mostly take diazepam only when required, but several times when going through a particularly bad period of anxiety and depression I have taken it regularly for several weeks and I didn't experience withdrawal upon discontinuation.\"", "(taken for 10 years or more)", "June 29, 2015"]},
{"text": ["\"Diazepam helps me through the days of anxiety. Helps me cope with going to crowded places. Sadly my doctor only will give me only 14 per one month prescription. So I have to carefully schedule, when I can go shopping, or attend a movie, or other activity. I've been on this medication for 12 years. It has changed how I react in crowded elevators, ( I also have claustrophobia ) and how I deal with anxieties. Doctor prescribed several other drugs for depression, no matter how often I tell him , I am not depressed and those meds make me feel bad. I sometimes wonder if my doctor knows the difference between depression and anxiety\"", "(taken for 10 years or more)", "June 27, 2015"]},
{"text": ["\"I think this experience would come under \"Anxiety\" but it may not.  My wife of 55 years died 3 months ago and to help with the grief the Dr. gave me Diazapam (Vallium) 5mgs to be taken 3 time a day for 28 days. This did seem to help calm me down but it didn't help to control the weeping not the deep seated feeling of lonliness. Now I don't take it regularly but when I start feeling really depressed about my situation  and loss, I can take a 10mgs pill which appears to soothe the bad memories away to some extent. Regrettably it hasn't helped with my sleep problem yet.  Prior to my wife passing away to a better place, I was able to drop off to sleep almost immediately when I climbed into bed, no it takes 3 hours before sleep eventually comes.\"", "June 24, 2015"]},
{"text": ["\"I suffer from PTSD, Ive tried nearly everything legal on the market, I don't suffer from depression, when I was on anti depressants It was like my brain, personality and soul was gone, I became a living zombie. Diazepam was the first thing my Doctor prescribed for \"short relief\". I find it to be one of the best things for dealing with PTSD, Anxiety and night terrors! it calms you down but you can still think and continue with day to day life\"", "(taken for 1 to 2 years)", "June 2, 2015"]},
{"text": ["\"Had social anxiety and depression since was a child.  Tried prozac and all.other drugs.  Valium as give me.my life back which I never thought possible.  One 10mg in morning and one.before bed.  Combatted my depression. And anxiety in one.  So happy now\"", "May 25, 2015"]},
{"text": ["\"I started having major panic attacks and general anxiety cuased by the bereavement of my daughter who dies unexpectedly a few months ago. I would wake up int he morning with butterflies in my stomach and feeling like a deer in the headlights. As the day progressed it only got worse. After weeks of this it was just unbearable. I went to see a psychiatrist who prescribed valium- the lowest dose. I take half a pill in the morning and evening and have been on this regimen for two weeks. I cannot begin to tell you what a tremendous relief this drug has provided. I am very sensitive to all kinds of meds and the strongest thing I ever take is Ibuprofen. I had no bad reactions nor any side effects. Awesome.\"", "(taken for less than 1 month)", "May 13, 2015"]},
{"text": ["\"I take this for severe life and death Anxiety and muscle spasms. I take 50 mg per day, 10mg 5 times per day as Directed by my Health Care professional. I have been taking this, vs. Klonopin or Zanax or Ativan or other Benzodiazapenes because of the longer term effects and the muscle spasm decreasing benefits.\r\nHave taken between 30 mg per day to 50 mg per day for 2 years now.\r\nIt does make me lazy. I have had weight gain.\r\nI have to exercise and I have to also use caution while driving.\r\nI take a high dosage, but without it, I would not be alive.\r\nIt is as simple as that. \r\nI am glad this medication, has been used for decades, tried and true, can cause anger if one does not realize they need to self filter, but it does relax anxiety and muscles.\"", "(taken for 2 to 5 years)", "February 6, 2015"]},
{"text": ["\"I have tried to Xanax and it doesn't matter how many milligrams I take it has no effect on me. I tried Klonopin which works however when it wears off I get horrible migraines which I found out can be a symptom of for some people. Valium is the only medicine I can take that reduces my anxiety. I ready here in some of the reviews people saying they had extreme anxiety and we're taking to milligrams my anxiety is so bad I take 10 milligrams 3 times a day just to be normal. It works it really works. It may be an old medication and it may not be prescribed very often anymore but I truly believe it is the best.\"", "February 4, 2015"]},
{"text": ["\"It's great.\"", "(taken for less than 1 month)", "January 17, 2015"]},
{"text": ["\"I am 21 and have suffered from major anxiety attacks and chronic depression the past few years and took every antidepressant tables going which have never made a difference. My doctor prescribed me with 2mg diazepam I took one with a cup of tea and I've never felt so calm and relaxed in my life and slept like a baby for the first time in six months. I highly recommend these if you suffer from the same problems one negative is they give me the munchies.\"", "January 5, 2015"]},
{"text": ["\"I have suffered from anxiety disorder for over 3 years now. Recently I hit rock bottom again and haven't been able to leave the house. I felt terrible. Doctor prescribed me 2mg of diazepam and after 20 minutes I already feel so much calmer. I only have a few days worth (just to help my citalopram kick in) - but it is great at calming you down.\"", "January 5, 2015"]},
{"text": ["\"Called my doctor as I was having serious anxiety attacks and panic attacks she prescribed me 2mg twice daily, I have suffered with anxiety all my life the moment. I swallowed the first pill 20 minutes later I can't even explain how perfect I feel no anxiety no panic, calm and so normal it's unreal serious life saver!\"", "(taken for less than 1 month)", "December 24, 2014"]},
{"text": ["\"Great all around benzodiazepine!  Lasts long and is generally mild but does the job!\"", "(taken for 10 years or more)", "December 22, 2014"]},
{"text": ["\"I have panic attacks the night before air travel and they are horrendous. I am a shivering, cold sweating mess and all I can think about is \"I'm gonna die\" as my mind becomes compromised and my heart is trying to get out of my chest. Diazapam is great. I take 4mg as I feel the attack starting and the medicine starts taking effect within 30 minutes. After an hour I am much more relaxed and can contemplate sleep. This effect lasts 10 hours then I crash as the medicine wears off and then the symptoms take over. I top up with 2mg as and when needed through the day. A panic attack only lasts up to 10 minutes but the symptoms can last for me up to 24 hours so taking that 2mg now and again keeps me strong. Diazapam means I can travel again.\"", "(taken for less than 1 month)", "December 7, 2014"]},
{"text": ["\"The medication I stopped for a month off a taper. And just went back on it. I was sweeting perfusely, along with social anxiety, and PTSD. It has been a god sent medication, But the only down fall is that it can have bad withdrawal symptoms!  But I was on xanax 4mg daily and Valium. The xanax withdrawal put me in the hospital but the Valium withdrawal is mild, but it is dangerous. Hope this helps someone in need of some advice!! Make sure it's only taken at the recommended dose and try too use it every couple of days not daily, otherwise you develop a tolerance.\"", "(taken for 10 years or more)", "February 20, 2018"]},
{"text": ["\"As I have really strong anxiety disorder I find it perfect for anxiety. I only take 2.5mg when needed for anxiety/panic attacks and it works within 20 minutes. It doesn't make me dizzy at all, it even makes my mind more clear.\"", "February 13, 2018"]},
{"text": ["\"After many years of suffering with major insomnia, and being prescribed many different sleeping pills that all had horrible side effects, I was finally prescribed Diazepam (as a trial). Although I'm aware that doctors do not like to prescribe this drug, I have to say that it was \"the one\" that gave me my life back.  I take 7.5 mg at bedtime only, and have been on the same dosage for approx. 8 years.  It has helped me tremendously with both anxiety and my sleeping.  I also had suffered my entire life (since childhood) from cold sores (at least one outbreak every 6 to 8 weeks) ugh. The oral drug I was given to \"speed up the healing process\" did indeed help, but was very hard on my system(constipation...tummy upset etc) Since taking Diazepam I have not had a single cold sore in 8 years. \n(it's a suppressant and therefore that makes sense, as cold sores are often triggered by stress)\n I've been lucky in that Diazepam (valium) has been extremely beneficial for me, and very inexpensive.\"", "February 8, 2018"]},
{"text": ["\"Works really well and at first it was sedative but not anymore. I can take up to 10mg a day and still function normally, I'm holding down a job thanks to diazepam. My anxiety is not gone but it's under control, though I wouldn't suggest this for daily use as you can become dependent on it.\"", "(taken for 2 to 5 years)", "February 7, 2018"]},
{"text": ["\"At first this medication saved my life (literally) but as time went on things slowly but surely started to get worse, feelings of unreality sometimes severe insomnia, increased anxiety & actually lead to feelings of depression.  I started of at 5 mg for one year then a year later 10mg and now my 3rd year taking this medication I am now on 15mg as you can see going up 5mg each year.  What I wasn't told before I took this medication is how addictive it was and as an ex drug addict they still gave me this medication. I am only 25 but this medication has ruined my life.  It is  ok for very short periods but do NOT take long term. If you  want my advice  it is do NOT take this medication it will ruin your life.\"", "(taken for 2 to 5 years)", "February 6, 2018"]},
{"text": ["\"best drug ever, I just wish I could control use\"", "February 3, 2018"]},
{"text": ["\"The safest benodiazepine medicine for anxiety.\"", "(taken for 1 to 2 years)", "January 22, 2018"]},
{"text": ["\"This drug helps at first but it's hell in the end! NEVER take Benzos!\"", "(taken for less than 1 month)", "January 15, 2018"]},
{"text": ["\"Well 2mg was prescribed I have took it a few times if I'm feeling like really anxious or unable to sleep and yes it calms me -  not massively  - I think I'd need a higher dose to feel extremely relaxed it just calms the anxiety symptoms.\"", "(taken for less than 1 month)", "December 29, 2017"]},
{"text": ["\"Diazepam 10mg twice helps immensely for my Panic Attacks, anxiety, night terrors. But only if I can get a generic that actually contains diazepam. I have been using Mylan and have had my urine screened for the presence of benzodiazepines for 6 months because I noticed that some months the drug had no effect whatsoever. I learned that 3 of the 6 drug screens found NO DIAZEPAM in them. So I called my MD and asked him to cancel my refills and to submit another requesting that Mylan not be used to fill it. I also contacted Mylan; they called the next day with questions relating to my experience. I looked up diazepam by Mylan I & found that there were many others who had the same complaints regarding Mylan and this drug being ineffective. Strict quality controls need to be in place.\"", "(taken for 1 to 2 years)", "December 13, 2017"]},
{"text": ["\"Having anxiety my whole life I never sought help and always hid it. Eventually it led to depression which I covered up too. The final nail in my coffin was when I acquired a parasitic infection in my gut l. The infection left me with permanent irritable bowel syndrome which I suffer from every day. For a year straight I seen numerous nerve pain experts and probably had 100 pill bottles in my drawer which nothing helped. My first psychiatrist started to prescribe medicines I already tried which I denied then asked for 5mg valium. Miracle drug that took all pain away, physical and mental. After 2 years decided to stop which was a devil's ride to hell. Miracle drug with insane withdrawal when stopped even tapering. Back to being miserable now.\"", "(taken for 1 to 2 years)", "December 7, 2017"]},
{"text": ["\"It has changed my life. It's a wonder drug for me.\"", "February 11, 2016"]},
{"text": ["\"I have suffered depression, social anxiety, and generalized anxiety for as long as I can remember. It has effected so many areas of my life, and this medication really has been a god send. I have also tried Xanax, though while effective, it is a short acting benzo with nasty withdrawal effects. Diazepam is much more gentle, and I've never experienced any adverse side effects. Unfortunately here in the UK it's practically impossible to get prescribed which makes the Internet the only option of obtaining. Why, I don't know since drugs like alcohol cause far more problems. It's a shame as I think responsible adults should be able to choose their win medication and what works for them. SSRI's certainly don't for me.\"", "February 10, 2016"]},
{"text": ["\"I love this medication and it frustrates me that it is shunned upon so heavily by most doctors and mental health practitioners. Its true the withdrawals can be incredibly bad but if not abused, this medication is a god send for those with anxiety. I have strong mood issues and while I try to meditate / exercise / eat small regular meals / keep busy and be active etc. which helps most days, sometimes it just doesn't cut it when I'm having a extreme anxiety and just need to relax. I was prescribed 5mg for travel (panic attacks flying) but I cut that in 1/4 and just take 1.25mg occasionally here and there when I need it. That's all you need and I find it does the job amazingly.\"", "February 7, 2016"]},
{"text": ["\"Diazapam is really a wonder drug I take one sometimes two 5mg tabs a day and within 30 minutes my anxiety symptoms are gone and I feel calm and relaxed.\"", "(taken for 6 months to 1 year)", "February 6, 2016"]},
{"text": ["\"I struggled with severe anxiety disorder and panic disorder for five years before I finally had a nervous breakdown followed by a week of severe suicidal depression - I caved in and took the Valium I had in my drawer and it saved my life that week. The first one I took actually made me feel completely normal - something I hadn't experienced in years. I take it now when I feel really anxious. 2mg calms the anxiety and puts me to sleep. No side effects. I am wary of taking too much so only resort to them when desperate. They reduce my panics both mentally (rushing disturbing thoughts) and physically. I know I probably shouldn't say this but they are amazing. However I would rather raise my own GABA naturally. Doctors don't like prescribing?\"", "(taken for 1 to 6 months)", "February 1, 2016"]},
{"text": ["\"I've been on Benzos for 4 years now.\nMy very first script was 0.5mg Alprazolam 3x daily. I expected it to be more effective, and it built a tolerance very fast. Then I got a Rx for 1mg Lorazepam 3x daily, worked better than Alprazolam. Then I got put on Clonazepam 1mg 3x daily. Worked WONDERS! But tolerance was the issue. My doctor introduced me to Diazepam, she said this benzo rarely raises tolerance on anyone. Took his word, got a script for 10mg Diazepam 4x daily. Now my life is SET. By far the best and most complete benzo. Thank you Diazepam!\"", "(taken for 1 to 2 years)", "January 31, 2016"]},
{"text": ["\"I had pain in my stomach no one could diagnose for three months. I was put on SSRI that made me worse an I lost 35 pounds with no appetite. Pain one day released and I became extremely anxious . by taking a small dose of Valium in the am and pm I am so much better also was given Dr Claire Weeks book which helped. I never thought I would recover hang in there.\"", "January 17, 2016"]},
{"text": ["\"I was given this for GAD, 5mg twice daily.  It works great for anxiety and for sleep.  I'm authorized 15mg daily but normally I take 10 as described above.  Before this I tried lie 20 different medications and they all gave me several side effects until the Doc gave me this one. Mild muscle relaxer which I also need, god for sleep and awake on day time when  need to be awake and alert.  Sure, if I lay back on day time after taking the pill I can easily take a nice nap. ;-)\"", "January 13, 2016"]},
{"text": ["\"Diazapan have saved my life I take two 5mg tablets a day. While on these meds my head seems more clearer I don't want to harm my self or others\"", "January 9, 2016"]},
{"text": ["\"Valium has saved my life. I suffered from \"neck tightness\" that almost drove me to the point of insanity, which no doctor could diagnosis or understand. I thought there was no solution and had lost all hope. It turned out to be a psychological thing (anxiety disorder) but the Valium immediately alleviated my symptoms. I take the Valium when I feel my anxiety symptoms flare up. These days I don't need to take it that often, knowing its just anxiety\"", "(taken for 1 to 2 years)", "January 6, 2016"]},
{"text": ["\"Had a nervous breakdown years ago after coming off steroids. I was agitated, angry and so anxious I could not function, I did not want to do anything, I'd stay in my room and hide away due to strong feelings of anxiety! Diazepam allowed me to be able to leave the house, interact with friends and family who I would have avoided, go grocery shopping and cope in large crowds! Wonderful drug and remember, theres use and theres abuse...\"", "January 4, 2016"]},
{"text": ["\"Totally relaxes me and I am able to do normal things like even just going to the shop and keeping appointments. \"", "(taken for 1 to 6 months)", "December 25, 2015"]},
{"text": ["\"I have been on diazepam long term,  started because of PTSD.  It is a mild sedative if I'm relaxing I'll get tired, if I'm working I don't get tired I just feel no negative feelings.  It really is a chill pill.  I am in construction field now and no issues and if I take one before going to bed my back pain  soothes (Valium is mild muscle relaxer) and I always seem to have pleasant dreams.  Never had a bad dream since on Valium, but at the same time it isn't luxurious or fantasy dreams either.  It has been a miracle drug for me.  I do not like how doctors now like to avoid benzos.  Valium is a great medicine.  I take 30mg per day generic brand.  Hope this helps someone.\"", "December 11, 2015"]},
{"text": ["\"My Saviour, Suffered severe anxiety panic attacks constantly for the last 4 wks heart racing trembling stomach, tried numerous meds citalapram, sertraline, prozac etc which all made my anxiety much worse. My dr prescribed 5mg twice daily of diazipam, morning & night I take 2.5mg in the evening a quarter in the morning & the other quarter in the afternoon so 5mg in all daily. It has instantly been a. lifesave and a wonder drug for me.  I don't plan on over doing it or staying on it for very long. but if anyone is suffering badly I would say there is no harm in giving it  a try. If you can -  the side effects from other meds I'd tried was horrific & with diazepam I've had non.  I hope this helps\"", "March 10, 2016"]},
{"text": ["\"This medication worked well fo me to relieve anxiety. It is only intended for short term use 4-6 weeks max. Valium is a Benzodiazapine and as such is highly addictive. I took it for 3 months 30 mg a day when I tried to stop the withdrawals were so severe I stayed on it. I stayed on it for 3 years eventually getting my dose down to 10-15 mg a day. But even this was up and down, I was eventually sent to a rehab to try and get off of it. While there I had two granmall seizures and almost died. Benzodiazepines are known as the worst detox in the world, heroin is a cake walk compared to them. The detox can last for months and they are one of the few drugs that can cause death during detox. You got to taper really slowly or you can die.\"", "(taken for 2 to 5 years)", "March 10, 2016"]},
{"text": ["\"I current take this medication to stay calm. I have bad anxiety due to some ptsd related issues.  I've tried em all from Ativan-Xanax, and this medication works well. I currently take a generic brand. The brand is TEVA. I did not like the Mylan brand, for it was chalky and was weak. TEVA is a great generic Valium and it helps very well for people struggling from anxiety disorder. I hope this helps somebody.\"", "March 6, 2016"]},
{"text": ["\"Used for 17yrs, worked well at first but needed increased doses as I became tolerant,held the same dose for past 7 yrs then suddenly became acutely anxious and agoraphobic dose was increased again but only result was awful unsteadiness on my feet.\r\n\r\nFinally was told that some people get withdrawal symptoms even whilst taking the same dose and it seems that is the problem I have,never been this ill in my life and now i face having to taper off it which scares me, my experience and opinion is it was fine short term but long term caused me more problems than it ever solved.\"", "February 23, 2016"]},
{"text": ["\"I've been on 5mg of Diazepam (Valium) for several years now.  My prescription calls for 2 pills/day per month.  The 60 pills usually last me 4-6 months, so I don't need to take them all the time.  When I get a panic attack 1 pill usually takes care of it. If not, I take another one a few hours later.  I have tried many anxiety meds, this is the only one that seems to work.\"", "(taken for 2 to 5 years)", "February 23, 2016"]},
{"text": ["\"I've always had problems with persistent depression since I was 14 (I'm now 25) but I've never been suicidal. It took me a couple of weeks to realise it but this medication made me suicidal! I was prescribed it for anxiety and restless legs at night, it did get me to sleep but I woke up several times through out the night. I was originally prescribed half a 5 ml tablet but had no effect until I took 2 tablets (10mg). Because I didn't become suicidal immediately after taking the tablets I didn't realise this was what was causing it but after becoming sus I googled \"can diazepam can suicidal thoughts\" and sure enough there were plenty of similar complaints. I've stopped taking it and doing much better\"", "February 23, 2016"]},
{"text": ["\"I suffered from severe anxiety and anxiety attacks for over 20 years. the psychiatrists I was seeing had me on different anti anxiety drugs but nothing worked. The attacks got so severe and so often that I had to sign myself into a mental hospital. the house doctor in the hospital gave me 2 blue valium and he told me to place them under my tongue. wow I couldn't believe it. After about 10 minutes I finally calmed down. the anxiety totally drained from my body.  As time went by I would feel another anxiety attack come on. I would take my valium and the attacks would go away. That happened about 30 years ago and I no longer suffer from anxiety attacks. Also I do not abuse the valium   I don't take them anymore.\"", "February 22, 2016"]},
{"text": ["\"This drug will ultimately ruin your life. The withdrawal has been described as worse than heroine.\"", "(taken for 5 to 10 years)", "February 19, 2016"]},
{"text": ["\"this medication was designed for short term relief of anxiety.  Which is 4 to six weeks. max dose is 20mg a day.   this medication is addictive.\"", "(taken for less than 1 month)", "February 19, 2016"]},
{"text": ["\"Increased quality of my life after trying several antidepressants (did\nnothing helpful at all!). Side effects made matters worse despite doing nothing for my chronic anxiety due to bouts of cancer.\"", "February 18, 2016"]},
{"text": ["\"Valium/is a life saver. INSTANT calming from anxiety,  depression.  Put the tablet under your tongue .. immediately  released into your system. ADDICTED? So what?,  it works .. no different than HAVING TO TAKE HEART MEDS for the rest of my life. I'm not addicted to them .. they keep me alive. Valium  keeps me sane and prevents depression & anxiety. .. difference ?..NONE .. Feel the same way about Ambian. Sleep disorders  my entire life... age 50  Dr recommended. Now really get a GOOD NIGHT DEEP SLEEP .. totally rested in the morning instead of tired.  ADDICTED  ... yup .. same same as Valium ... my body responds positively  ... so who cares if it is an addiction  .. it works for the purpose intended. And I am healthier & happier.\"", "(taken for 5 to 10 years)", "February 16, 2016"]},
{"text": ["\"Unless you are using this as a one off say for a flight or dental work do not touch it! Docs may warn it is addictive but they won't tell you that with long term use you can actually go into withdrawal whilst still maintaining the same dose.\n\nI have been on it for 17 years and it's ruined my life, anxiety is worse and I have developed severe agoraphobia and depression, did my research since the doctors are no help and these are common effects of long term use.\n\nNo one warned me and now I face withdrawing which is complicated and painful in itself but the only way I stand a chance of recovery, it will take a very long time though, the drowsiness was awful, that wore off but I am so unsteady on my feet that it amplifies my anxiety.\"", "(taken for 10 years or more)", "February 16, 2016"]},
{"text": ["\"Had major panic attacks and tried everything until diazipam and now for years way better\"", "(taken for 5 to 10 years)", "February 13, 2016"]},
{"text": ["\"I have severe GAD since my teens but it really hit me harder in my early 20's, I had been taking generic Valium for 8 yrs then got into a psychiatrist at first he switched me over to Xanax 1mg 3X daily which works for immediate panic attacks but would wear off very quickly and I would wake up first thing in the morning with my heart racing and had to take 1, I told him this and got switched back to my original dose of Valium which lasts all day, 1 and a half 10mg in the morning and the same at night and I no longer had to wake-up first thing for my meds, and they pretty much prevent my panic attacks unlike the Xanax.I can function just fine and work with people now that I'm at the right dose and not be self conscience great medication!\"", "(taken for 5 to 10 years)", "December 1, 2016"]},
{"text": ["\"I'm 24, and have PTSD, bipolar and anxiety disorder. I have recently had the scariest panic attacks, 911 calls and ER visits. So bad I thought I was dying...every night. I took klonodopin and it didn't help. My doctor prescribed this today and I haven't feel this relaxed or not in fear in a long time. I'm thankful to this medication. I couldn't handle it anymore. Nothing else has helped.\"", "November 30, 2016"]},
{"text": ["\"Thank you Valium!\"", "(taken for 1 to 6 months)", "November 21, 2016"]},
{"text": ["\"I have very severe anxiety that has landed me in the ER plenty of times before I was diagnosed with being in an \"Anxiety State\". My first medication was Ativan and I loved it but they switched me to 5mg Valium. I can function more on Valium. I take 1 during an attack and I'm calm for 5-6 days. I get very relaxed and I sleep great! So far I really like it. It says No Refills on my bottle so after I go through the 19 pills I have left idk what they'll have me take. So I'm with a  therapist for now that I meet with once a week for now.\"", "(taken for less than 1 month)", "November 3, 2016"]},
{"text": ["\"Lifesaver was having very bad panic attacks tight chest pounding heart sweaty palms dizziness, was even 5mg tabs cut one half because was very nervous of taking any medication at all, with in 20 min all symptoms have gone, tablets made slightly sleepy for first hour of taking them,was told to use them only when a really had to three days on still feeling good no need to take any yet fingers crossed :)\"", "October 31, 2016"]},
{"text": ["\"I've been on 20 mg (4x5mg  daily)for over 30 years now .Some days I take a few more ,Put on them after an operation went wrong and they are the only pill that helps with severe muscle spasms .\nHate being addicted but at my age refuse to come off .\"", "October 19, 2016"]},
{"text": ["\"Been on diazepam for approx 4 years. I became tolerant within a few months but it still helps to this day. That may be some sort of placebo effect, i don't know. Anxiety starting to subside so looking for something to transition to to come off diazepam as it is not something you want to be reliant on. However, excellent for PRN. Will most likely if not definitely save you from a anxiety attack and nothing will bother you at all. Thats not to say you will become reckless or impulsive but to say you can get on with things. I'd be in a bad way without this medication!!!\"", "(taken for 2 to 5 years)", "October 15, 2016"]},
{"text": ["\"I took Valium for almost 3 years and it helped my anxiety. I started on 5mg three times a day then that increased to 4 times a day. I started waking in the early morning thinking I had bad pills because they weren't working. I found out I was in tolerance and started having tolerance withdrawal. It's very hard to come off. I tried to stop cold turkey and on day 3 it felt like I had been shocked with a cattle prod. I went back to 15 mg and started a slow taper.  Added remeron for sleep while tapering. I would steer clear from benzos and find something else for anxiety, these should not be taken for long periods of time.It make your world a better place to be and forget life's problems for a short time but you will face consequences later.\"", "(taken for 2 to 5 years)", "October 13, 2016"]},
{"text": ["\"I've tried every drug going for anxiety and panic attacks. I will stutter , start shaking I can't think straight and if I'm in a room with someone I just need to get out, it's like being total paranoid.\r\nThen I got prescribed diazepam 5mg and wow a drug that's finally worked.\r\nI only use it if I'm going into a place where I'm going to have an attack , like a managers office etc , or if I can't sleep as tiredness triggers my anxiety.\r\nIf I could take it everyday I would but as it's so addictive I only take 2 or 3 times a week.\r\nI just need to not go over the limit .\r\nThis is a wonder drug but don't take it daily\"", "(taken for 1 to 6 months)", "October 11, 2016"]},
{"text": ["\"Excellent for anxiety, and panic attacks. Saved me from myself. However I have put a stone on in weight - I know this is unusual, but I have not changed my diet in any way, and prior to this I had lost 3 and half stone , which stayed off for over a year without any gain, prior to taking this medication. Very upsetting..\"", "October 2, 2016"]},
{"text": ["\"Diazepam 5 mg is helping\r\nRelieve the muscle pain induced\r\nBy chronic back pain. \r\nIt stopped my unbearable sciatica pain in a day. After  6\r\nTrips to ER. A DOCTOR prescribed\r\n it. It's a miracle. And I'm able to move more free. And able to complete daily tasks with a lot\r\nLess pain   And having sciatic\r\nAttacks has been a thing of the past.\"", "April 24, 2015"]},
{"text": ["\"I have been taking valium for 15 years for sleep and anxiety 15-30mg.  This drug has worked good through the years but I have begun to notice memory and balance issues so I decided to get off of it. The first time I quickly tapered and one night I awoke to a racing heart beat, tremors, & an intense feeling like my head, face, & back were on fire. I had to go back on because of this. Now I'm doing a slow taper so far have gone from 15mg to 7.5mg over 4 months. Going from 15-10mg was easy but going under 10mg has been very difficult at times. For years I was very much positive about this drug but I do not think you should take it for more than a month unless you just have to have it. Just be careful withdrawals can kill.\"", "(taken for 10 years or more)", "April 24, 2015"]},
{"text": ["\"I've got PTSD due to domestic violence 27 years ago which left me with chronic anxiety and panic attacks. I have too many side effects from anti-depressants so this is all I can take but they help through the worst times. My gp only gives me 28 5mg though every 5 weeks as not good and can increase your anxiety if you take regularly\"", "April 23, 2015"]},
{"text": ["\"Take 7.5mg twice a day and it prevents my anxiety from getting out of control and stops my frequent panic attacks. The only medication that has worked for me so far. Hopefully my doctor will be ok with this medication long term and not going back to trying SSRI after SSRI.\"", "(taken for less than 1 month)", "April 18, 2015"]},
{"text": ["\"Works great .I was having panic attacks all the time. This medicine calm them down\"", "(taken for 10 years or more)", "April 16, 2015"]},
{"text": ["\"Other than drowsiness for about 45 minutes after taking it,  great medicine!  Works in like 10 minutes,  so if I feel a panic attack coming on I take my dosage and before I know it I'm calm.  It enables me to go into mass public places and can go into crowded restaurants with my family.  Valium has given me a huge part of my life back.  I know most doctors are against it because dope heads have abused this type of drug.  You can only get it from a psychiatrist now but it saved my social life so I see the shrink monthly!  Thanks valium\"", "(taken for 2 to 5 years)", "April 15, 2015"]},
{"text": ["\"I have been taking Valium every day for 5 years for anxiety and muscle spasms. Good to kill 2 birds with one stone.\n\nI take a relatively microscopic dose of 2.5mg/day, and after 5 years, I have probably built up a tolerance to it so that this tiny dose has no physiological effect any more. But even if I'm now getting the placebo effect from it, I don't care. I don't have panic attacks any more and that's all I really care about.\"", "(taken for 2 to 5 years)", "March 29, 2015"]},
{"text": ["\"Two years ago, I couldn't sleep, my doctor gave me all type of sleep meds, nothing worked. The only med works is this. I take 5mg every night on and off for 2 years. No side effect.\"", "March 20, 2015"]},
{"text": ["\"mild-moderate anxiolytic effect but Long lasting. Definite calming effect and sense of tranquility. I weened off of 5mg of Xanax with this wonderful drug and had virtually no withdrawal. Makes me feel level headed and at peace when I start to stress\"", "(taken for 1 to 6 months)", "March 13, 2015"]},
{"text": ["\"I have started getting severe anxiety and panic attacks since been pregnant. It was so severe I couldn't leave the house. I was prescribed Prozac but had a bad reaction wich put me of taking further medication. I started seeing a cognitive thereapist wich eased my anxiety a little but I would have good days and really bad days. On a bad anxiety episode at 25 weeks pregnant I went back to my G.P willing to try medication again she prescribed me diazepam 2mg dose used up to 3 times a day only for my bad days. It took me a week to combat my fear and take my first pill wich I did yesterday and what a difference for the first time in 6 months I felt calm and my anxiety was gone. I would highly recommend this medicine don't suffer x\"", "February 25, 2015"]},
{"text": ["\"I know of people that have taken single 5mg tablet and they have been what I would say out of it all day.  So when the Dr suggested this to me I was very unsure.  However it is fair to say that for me after taking the first tablet I felt more grounded.  I use 5mg tablets as and when needed.  They don't zonk me out and help me on those days when things are just too much.\"", "February 24, 2015"]},
{"text": ["\"If you want something to control your panic attack for a short period of time this is perfect. It's only meant to be used for a few weeks. Its very addicting so watch out.\"", "(taken for 1 to 2 years)", "February 20, 2015"]},
{"text": ["\"Worked wonders to help my excessive sweating and anxiety from Postural Orthostatic Tachycardia Syndrome, a form of Dysautonomia. Also, helped me to sleep better.\"", "(taken for 1 to 6 months)", "December 4, 2014"]},
{"text": ["\"I reacted harshly to this medicine. It turns out that I am someone who is sensitive to this medicine and was best prescribed it at the pediatric level of 1mg. Now that we have found the correct dose, it does wonders for large overwhelming panic attacks.\"", "(taken for less than 1 month)", "November 19, 2014"]},
{"text": ["\"I wish I knew the panic I felt was something that I could calm with a single pill. Diazepam works great by just making you feel mellow and relaxed. I take 2mg here and there. My doctor prescribes it when I go through these severe panic episodes where I can't sleep and I become consumed with doom. Diazepam helps to rationalise things and makes me feel like its not the end of the world. I wish one day I wont have to take it but for now I am grateful for it.\"", "(taken for 6 months to 1 year)", "October 30, 2014"]},
{"text": ["\"I am 19 years old, and have tried all four of the most popular benzodiazepines for my social, general, and nighttime anxiety when several SSRI's failed: Xanax, Klonopin, Ativan, and Valium. Klonopin made me angry and Xanax didn't last long for me. Ativan did zilch. Valium is like Xanax's effects with Klonopin's long duration! It's the only medication that I can take effectively with no side effects! I take 5 MG only as needed and have no urge to take more. It's mild, kicks in quick, and lasts long. I don't find it addictive at all! Sometimes the oldest medications are the best. Lifesaver!\"", "October 22, 2014"]},
{"text": ["\"I have been dealing with depression and anxiety for almost 6 years now. I'm a 29 yr old female and I have tried it all. Xanax, Ativan, Klonopin, Buspar,  Vistril and lots more!!! Valium was the only thing that worked wonders for me, an absolute life saver. My Dr started me off on 2mgs every 8 hrs. But that wasn't strong enough as my anxiety attacks are debilitating!! Now she has me on 5mg 3x a day, and I also take Abilify and an antidepressant.  This has saved me. I can drive and go out without feeling like I'm gonna die.\"", "October 16, 2014"]},
{"text": ["\"This is the ONLY medicine in the benzodiazepine family that is useful to me for BOTH panic attacks AND sleep! Great results.\"", "(taken for 1 to 6 months)", "October 15, 2014"]},
{"text": ["\"I was given a sample pack, but it has the opposite effects for me, as I had an increase in fear of danger, and worrying, I was extremely focused, and unable to sleep. My doctor has had me test a few anti anxiety meds Ativan, antidepressants, and the only one that works for me is Xanax at a low dose.\nI would make sure you consult your doctor first on this one.\"", "(taken for less than 1 month)", "October 10, 2014"]},
{"text": ["\"I have self managed my anxiety and depression for years. Depression has been the worst factor. My most recent episode came out of the blue and was harder for me to manage as I wasn't depressed. I was hyperventilating, worrying about stuff that wasn't going to happen and was climbing the walls at my partner. \nThe doctor gave me diazepam 2mg after my blood pressure was too low for beta blockers. I've taken my first tablet and I feel more relaxed and able to process my thoughts and breath than I have done for days.\n\nI understand that they're addictive but to sort your head and get you on the starting blocks these have been life savers. I can go to work and cope with my mental health problems.\"", "September 26, 2014"]},
{"text": ["\"Suffered a major panic attack whilst driving 6 months ago, which left me with constant severe anxiety. My doctor put me on citalopram and beta blockers which made things much worse. I was now having panic attacks, night terrors, feeling very suicidal.  I was eventually put on 2mg Diazepam tablets.  This helped within 20 minutes of my first tablet.  I felt slightly less anxious and a bit medicated. Continued taking 2/3 tabs a day for the next few weeks.  Dramatic improvement.  When I'm feeling a bit dodgy I will still use as and when needed.\"", "(taken for 6 months to 1 year)", "September 5, 2014"]},
{"text": ["\"Recently began suffering generalized anxiety disorder, took me to the point of suicide, prescribed diazepam. The 1st time I took it I felt aggressive and annoyed easily however after a few days I can safely say it has greatly reduced my anxiety for now however my doctor has said he will not let me stay on it due to the bodies ability to easily resist the medicine over time requiring greater doses etc.  Desperately do not want to try antidepressants again (due to a previous severe reaction). We shall see.\"", "(taken for less than 1 month)", "July 19, 2014"]},
{"text": ["\"I have major depressive disorder, post traumatic stress disorder, obsessive compulsive disorder, and anxiety.  I take two antidepressants and Buspar and Valium for anxiety.  I have begun taking 10 mg of Valium several times a day and it helps calm my million mile an hour brain.  I wish I didn't have to take so much medication but to live a normal daily life, they are necessary.\"", "(taken for 1 to 6 months)", "June 26, 2014"]},
{"text": ["\"I started having panic attack, anxiety, which they all led me to insomnia for 4 days I was not able to sleep for more than 1.5hrs. I went to my GP and he prescribed me a dose of 7.5 mg of zopiclone  and this tablet acted very fast but only kept me a sleep for 3 hrs . My GP prescribed me 5 mg of diazepam for three days and when I took the first dose of 5 mg I waited and waited it just didn't do nothing and I had even more panic attacks and anxiety. So I decided to take all of them which makes 15mg  of diazepam and nothing happens just I felt like really confused and heavy headed after 6 hrs I managed to have some sleep for 8 hrs . I don't think this is the right medicine for me but next day it did make me feel calm and kind of relaxed.\"", "June 17, 2014"]},
{"text": ["\"I had ended up in the ER a few times with weird problems like not being able to catch my breath and hyperventilating before I even new they were panic attacks. They started me on Ativan but it made me so hyper and loopy I literately forgot a few days so when I was put on Valium it was a God send. It prevents and treats panic attacks without the loopy feeling and It doesn't affect my ability to perform daily activities so I'd recommend it to anyone seeking this type of help.\"", "(taken for 1 to 6 months)", "June 2, 2014"]},
{"text": ["\"This is a wonderful medicine for anxiety it works within 20 mins and lasts for a long time because of its long half life. However if you are suffering from depression, especially clinical depression I would not recommend taking this. It will worsen your depression symptoms if taken too often. If you started an SSRI antidepressant it can be used early on to help with some side effects like increased anxiety in the first few weeks on the medication.\"", "May 21, 2014"]},
{"text": ["\"I've been on just about every benzodiazapine there is and Valium (diazepam) is all around the best for combating debilitating anxiety symptoms.  It may not be the most potent benzo, but it has wide and equal benzo effects including sedation, muscle relaxation, anxiolytic, anticonvulsant and can be used for insomnia.  Now the main reason why Valium is the best is its extra long half life.  It's effects can linger for days which is helpful if you have chronic anxiety.  It also prevents those ups and downs short acting benzos cause like Xanax and Ativan.  Another thing to note is withdrawal from Valium is by far the most mild out of ALL the benzos.  This wonderful medication is an oldie but goodie.\"", "(taken for 10 years or more)", "April 8, 2014"]},
{"text": ["\"Been taking diazepam for a while now, its been helping my everyday life. Since Valium, I've been more upbeat with reality. Only side effect I have is drowsiness. \"", "(taken for 2 to 5 years)", "April 5, 2014"]},
{"text": ["\"Diazepam has helped me with my panic attack and anxiety.  I couldn't imagine going back to the old me without it.\"", "April 2, 2014"]},
{"text": ["\"Fantastic drug. I can take it for ages and come off with zero effects. Everyone is different.\nI'd take these over any anti depressants any day.\nYou only live once and what's the point of suffering I'd stress to a Dr if you're not allowed them. I have them for anxiety/spasms.\nMake sure if any brand you get/ask for actavis.. others are useless. Chemists/NHS like the useless ones as they're cheap\"", "(taken for 1 to 2 years)", "November 18, 2017"]},
{"text": ["\"Don't make the mistake so many others do by taking this horrible drug. You will get relief initially but make no mistake about it, this is really addictive and before you know it you will hit tolerance and will need to take more to continue feeling OK. However you may get to the point where it actually makes you feel horrible, waking up every morning with extreme anxiety and hopeless. I've off all benzos for 9 weeks now and I'm finally starting to feel normal. Before trying this med, do your research and you'll find out how many poor souls are out there suffering every day with very little relief.\"", "(taken for 2 to 5 years)", "October 31, 2017"]},
{"text": ["\"I have been taking 5mg Valium for the better part of 25 years. I was a huge drinker with a problem so I gave up the booze 12 years ago. However I have had major problems sleeping so I take a valium at night. Doctors hate given me Valium and it really blows me out as I don't drink and don't take illegal Drugs [ I did take heroin in the late 80s and some speed .. ].  I Haven't had drugs like that since 1980. I went two years without Valium and didn't bother me at all. I don't care what they say I will take valium until I die and I love the sleep I have. I have never taken one during the day because I don't wish to go to sleep or feel that way..\"", "(taken for 10 years or more)", "October 17, 2017"]},
{"text": ["\"I find these are excellent medication\n\nTop Notch!\"", "(taken for 2 to 5 years)", "October 16, 2017"]},
{"text": ["\"Was given 5mg to take up to 3 times per day for anxiety. Didn’t use it each day, only when really necessary. Initially worked well, but extreme fatigue was a problem. Within a few weeks I was only taking it on 2 or 3 days per week, up to 2 doses. Sometimes I would half the tablets. By that time it was only helping for an hour or two so I stopped taking it. The withdrawal anxiety has been horrendous. My GP didn’t even talk about withdrawal to me. I won’t be recommending this to anyone apart from for emergency use. I am angry that I was prescribed this so easily with no advice given.\"", "(taken for 1 to 6 months)", "October 12, 2017"]},
{"text": ["\"This may seem really strange but I swear I seem to have more focus when I read very complex material. Is that normal? I found myself behind in law school because of Hurricane Irma that left me without electricity and becoming increasingly behind with the material because of power outages. I took one before I started working on it and I feel wonderful and unaffected by the stress of trying to catch up. Very interesting. Was wondering if anyone had similar experience . . . .\"", "September 15, 2017"]},
{"text": ["\"My blood pressure was 270/120 and had to work through many drugs before this one lowered my anxiety and blood pressure. At 20 mg a day usually take all at night time for sleep to. Side effects sometimes headache. Strong addiction and should be weaned off it slowly or your head will hurt non stop for a month. A nightmare to stop cold. It lasts eight times longer than Xanax or Klonopin they are two brothers not to mess with. At first you may have the sedated effect before you become more resistant to the drug. Where you get the drug also makes a difference. Some stores give the yellow tablet which melts in mouth as clean as water. Other stores have an orange tablet that tastes like paper. Walmart has the good one and some grocery but not CVS.\"", "September 10, 2017"]},
{"text": ["\"Was previously on lorazapam and switched to Valium in February. Since then I never felt relief and suffered every day from anxiety. It didn't matter if I took 2mg or 12mg I didn't feel better and in fact I felt more anxiety. A week ago I decided to stop it cold turkey and every day since I have felt 90% better. I'm going through some withdrawal like tinnitus and night time sweats but I wake up better and have been feeling happiness. I strongly recommend staying off any benzodiazepine and if you are going to take it, only for bad panic attacks. Never take them daily as they are very addictive and quite difficult to get off of. They say that benzos are more difficult to get off of than heroin. Try Gabapentin for anxiety.\"", "(taken for 6 months to 1 year)", "September 4, 2017"]},
{"text": ["\"I have suffered with anxiety and severe panic attacks for many years.\n\nIt is a GODSEND. Initially anyway.\n\nI have noticed over the years I've had to increase the dose I take (which I've never taken daily).\n\n5mg of diazepam  (Valium) never did much for me. But 7.5mg used to have a perfect effect. These days I need 15mg for that same affect. \n\nIts a shame. And I thought I wasn't abusing it because I didn't take it daily. (Generally 2 or 3 times a week, depending how I felt).\n\nI'm still giving it a high rating for the many times its helped me.  \n\nBut even taking it as PRN has eventually caught up on me. If I don't take it for several days I start feeling sick. \n\nDevastated to lose a medication that can work so well.\"", "(taken for 5 to 10 years)", "September 2, 2017"]},
{"text": ["\"Never tried diazepam for anxiety or any other medication I also tried it for RLS . Its really effective but hard to stop and withdrawals are hell. I also acting like a zombie have risky sexual behaviour with this.\"", "(taken for 1 to 2 years)", "August 17, 2017"]},
{"text": ["\"I have been on Valium (diazepam) for 40 years, have never had any side effects, great drug. If prescribed properly, no one should ever have any problems with this drug if prescribed properly, & if taking it for the right reasons.\"", "(taken for 10 years or more)", "August 4, 2017"]},
{"text": ["\"I would like to say that diazepam is very useful I only take it when I can't take control of my breathing and get to the point of thinking I'm going to faint, I must say as I don't like taking these pills I take the lowest dose, 2 mg which might not even help me sometimes but other times will make me feel drowsy and make me go to sleep, I don't like taking higher dosage for the plain reason of wanting to be in control of my body, I don't want to fall asleep if I don't want to, or have a deep sleep and stop breathing, this I know is part of my anxiety, being scared of these things, so the only bad thing I can say is that depending on he dose you can feel sleepy and not function properly, for example I wouldn't dare to drive\"", "(taken for less than 1 month)", "July 27, 2017"]},
{"text": ["\"5mg to 10mg every morning gets me through the day without sleepiness nor euphoria side effects and makes me feel completely “normal”.\"", "(taken for 10 years or more)", "July 26, 2017"]},
{"text": ["\"I've suffered day upon day with extreme anxiety and panic attacks. I have tried all sorts of medications but they just made me feel like a zombie and couldn't function. \n\nMy GP prescribed me 2mg diazepam and I have to say this stuff has been amazing. My anxiety has reduced but when I'm in having a bad day they are brilliant as a quick release.\n\nNo side affects at all just a sense of calm :)\"", "(taken for less than 1 month)", "July 25, 2017"]},
{"text": ["\"I have tried a lot of different anti- anxiety meds and Valium is the only one that actually works for me and I don't get nasty side effects with.\"", "(taken for 5 to 10 years)", "December 3, 2015"]},
{"text": ["\"i've tried everything for panic attacks and depersonalization so far. i don't like ssri's they make me feel like a zombie. i don't really have any side effects which is very rare as i'm sensetive to a lot of drugs/food anything you name it. I do find sometimes the day after i'm still tired and a bit depressed. I have 4mg+ if i'm having a panic attack it seems to help quite a lot. i take 2mg if i'm going to a party or a new place and take more if i need to. i'm going to try propanolol next i heard it's great too.\"", "(taken for 6 months to 1 year)", "November 25, 2015"]},
{"text": ["\"I had several brain surgeries and because of these brain surgeries I developed a pinched nerve in my neck from the trauma. I have three incurable diseases and my legs are almost always hurting. \r\n\r\nI started out on neuro tin then went up to Lyrica. I can only take so many a day for the pain. My doctors wanted the dosage up, but my stupid insurance did not allow this or would not pay for it. So, I am stuck on the same dose and have been on the same dose for a while now. These two drugs are a life saver. I don't understand what reason why my insurance will not allow me to up the dose because it makes no sense considring it's doctors orders. Lyrica is a life saver (hands down) and so was neutorin. If you plan on stopping these drugs, Wean!\"", "November 16, 2015"]},
{"text": ["\"No good for depression or anxiety. For me just helps you to sleep\"", "November 12, 2015"]},
{"text": ["\"I have had very bad anxiety since I was in  my teens. Tried all sorts of other tablets nothing worked for me. I couldn't  leave the house, no girlfriends. Then I was put on valium  (diazepam). I take 10mg in the morning and 10mg at night and have done for 24 years. Changed my life. Got a great job, married, 2 kids, never took more than I was given. The doctor's tried to get me off it, I tried to come off it but went back into my head,fear off going to work, fear off going out. So went back on diazepam and was able to work, be a husband, Father. This drug saved my life. It makes me so mad because off dope heads selling it and given it a bad name. The  only thing is make sure you stick to your dose, and never just stop taken it.\"", "October 19, 2015"]},
{"text": ["\"I took Valium for nearly 20 yrs for anxiety and functioned just great. My Dr retired and I had to find another. He is weening me off, now down to 2.5mg twice a day. I am miserable ! I'm stuck in my home, can't sleep, and my heart and stomach are going wild. I don't know how much more of this I can stand ! I feel I'm going to have a heart attack, I've lost so much weight I look terrible. And my Dr doesn't seem to notice or even care. He says he cannot be writing for it. I am not a dope head. I am a 53 yr old grandma who needs help. My children worry about me all the time. What is a person to do ?? Go to the street ?? I don't know that kinda life and don't want to. I can't afford a psychiatrist, just a Dr that cares !\"", "(taken for 10 years or more)", "October 14, 2015"]},
{"text": ["\"I was given Diazapan today and took it tonight for the first time, All I can say is thank you doctor I felt the anxiety just melt away, I felt like crying because I couldn't take the feelings anymore it was making me physically ill, couldn't eat or sleep and my stomach constantly going over. After taking the tablet I felt normal I could eat. For the first time in a month I'm not panicking.\"", "(taken for less than 1 month)", "October 12, 2015"]},
{"text": ["\"I originally received it after a arm injury but did not need it as much so had plenty leftovers. Now when I'm in severe stress situations to almost nerves breakdowns I take one 5mg and it works to stop me from crying that I could not control otherwise. Just wasn't sure if I can take 2 instead to put me to sleep since the doc said 1 every 8 hrs.\"", "(taken for less than 1 month)", "October 12, 2015"]},
{"text": ["\"Diazepam is ok  in the very short term but is highly addictive and withdrawing from it will give you panic attacks, a real cold turkey sensation. Took me 6 months to get off it but still felt panicky at times. I was recently given it for head aches and tension after 30 years off it and can't say I was happy taking it even short term. It did relieve my tension after 3 days. I decided no more and although my sleeping is not good, it is better to soldier on without it if you can. Controlled breathing, lavender oil to breath in and pressure points to lower blood pressure were used instead. I feel better and brighter now by using self control. It is so easy to take a tablet and there maybe times you may have to if  it is a one off option.\"", "October 8, 2015"]},
{"text": ["\"I am male age 65 years old. My nurse practitioner is trying to wean me off Valium after taking it ( 5 mgs) since I was 23..that's 43 years. It has been doing it's job for me. It gave me back my life.  I have extreme anxiety disorders. My original physician gave me no hassle. He died, and I had to get a new Doctor. Things were fine until this past year when out of the blue she recommended me getting off the drug. I never abused it, but she is adamant about it. So, I am trying..truly am. It's not going too well. I am wondering if I should find a new Dr. and take my records there.  I think my age has something to do with it, but getting off it is almost a nightmare. Does anyone have any suggestions?? I really would like some feedback from others.\"", "September 28, 2015"]},
{"text": ["\"I don't like medication in general but this one got me thru work ,divorced single parent of 2 children. No side affects, very qualified professional work. Then I became wheelchair disabled on the job, I was ripped off by family of 96,000 dollars during a 2yr hospitalization. With corticosteroids I resumed the 5mg valium which helped.  For me I only need 1 a day although prescribed 4, so they last me 6 mos to a year. IM LUCKY for I don't like to feel dopey just normal. If I've gotten into an insomnia state for a stressful situation with my autoimmune condition is the only time I'd taken 2 to sleep if tylenol pm didn't work. \"", "(taken for 5 to 10 years)", "September 26, 2015"]},
{"text": ["\"I'm 21 years old and have terrible Social Anxiety, Hypochondria, GAD, and Night Terrors. I've tried Xanax, Klonopin, and Ativan for my anxiety. Xanax didn't last long enough, Klonopin gave me moodiness, and Ativan did nothing. My doctor gives me Diazepam (Valium) 5 mg/four times a day and it's a MIRACLE. I can't tell you how tremendously Valium has improved my life. I'm constantly mellow now, can think straight, and sleep restfully at night. The effects also last all day and keep me anxiety-free. Valium has definitely given me my life back!\"", "(taken for 1 to 2 years)", "August 23, 2015"]},
{"text": ["\"I was first prescribed Valium about 18 months ago to assist with combating panic disorder. My personal experience with generic brands of the drug have been, without a doubt, excellent. I believe my improvements are due to the combination of Valium, regular CBT therapy, and making consistent changes (ie pushing myself socially, improving diet and exercise). Many of us, can become overly reliant on medication, so I feel a holistic approach is needed for real, long term results. However, for moderate to severe anxiety/panic attacks, Valium is INCREDIBLE. Gives a true, gradual calming effect, with no grogginess or next-day hangover. The effect can only be described as feeling clear-headed. Definitely worth a try.\"", "September 26, 2016"]},
{"text": ["\"I have been on this medication for a few months now- but before this I was on xanax as well as klonopin. This medication is weaker in my opinion than klonopin, but it lasts a very long time which is great. It doesn't do much justice for sudden panic attacks but keeps my overall anxiousness at bay. Currently taking 5mg TID and it definitely helps me sleep. Klonopin is stronger but gave me odd and sudden mood swings, and xanax didn't last long enough. If you're looking for a good anti-Anxiety medication that lasts long this is good for you! Also if you are trying to taper off of Benzodiazipines in general, this is a good one to be on due to its \"weaker effects\" I would call it. Being on it doesn't make me tired during the day either!\"", "(taken for 1 to 6 months)", "September 15, 2016"]},
{"text": ["\"I suffer from anxiety attacks and I am 22mg diazepam now my doctor now wants me of them altogether and put me on antidepressants which I have said no to I do not think he liked\"", "(taken for 10 years or more)", "September 14, 2016"]},
{"text": ["\"It's early days for me taking Valium but I have noticed a general sense of well being. I think that if you REALLY need this drug then it's a blessing. I was suffering from post operative depression and long term anxiety issues. I don't feel like I'm zoned out or in some kind of vegetative state. I'm functionally normally but with a greater sense of calmness. Before taking Valium it was like I had a million things bouncing around in my head or like I was in a sweet shop with a mind racing around as to what lollies I wanted. I have heard negative things about Valium but I am convinced that if you genuinely need this drug then it's a wonderful thing. I give it the thumbs up.\"", "September 14, 2016"]},
{"text": ["\"I am not enforcing anybody to use this drug, that is not my intention, but I have to express how happy I am to my general practionair for prescribing me this wonderful pill. I have been extremely anxious for several days, so anxious I failed to attend my driving test. I have had chest pain and tightness for several days. Once I took 5mg Diazepam (Valium), within 1.5 hours it was all gone, the anxiety had subsided and I was able to sleep like a baby throughout the whole night. It is morning now, and I still don't feel anxious, neither am I experiencing any pains or tightness anymore. Definitely 10/10.\"", "(taken for less than 1 month)", "September 13, 2016"]},
{"text": ["\"Amazing drug for anxiety. I don't find it addictive. Just great!\"", "September 9, 2016"]},
{"text": ["\"I have been on diazepam since 2010..initially I started with 5mg a day but went it for 20mg a day and it was wonderful..was always anxious about everything..I decided to stop but the anxiety started to kick in all over again..I'm on it again and is working wonders for at the moment..the doctors keep saying is addictive but it is killing anyone?\"", "(taken for 2 to 5 years)", "September 6, 2016"]},
{"text": ["\"Got me off alcohol, been sober for 3 years. Mellows me & effective hunger tool.\"", "(taken for 2 to 5 years)", "September 1, 2016"]},
{"text": ["\"I've been on diazepam for years. At first I thought it was the wonder drug.\nIt worked quickly and the relief was amazing. I suffered from anxiety, panic attacks and generalized depression for years prior.\nBut then the wonder drug stopped working -  just like that , immediately - all the benefits I came to trust disappeared. I was left in the same state as before taking.\nI should mention that the med stopped working after only a very brief period, perhaps months. However my doctor continues to prescribe, why I don't know.  I rarely take it any more, but when I do, hoping for the same relief initially felt - nothing!!!\nOnly advise I can offer is; if it works for you, great BUT don't think it is the cure, at least not long term.\"", "(taken for 2 to 5 years)", "August 31, 2016"]},
{"text": ["\"I get bad anxiety and panic when I am alone at home and it gets dark. Feel REALLY claustrophobic and can freak out badly. I started to take high doses of  my amitriptyline to try and knock myself out in total desperation. I didn't care about the risks I just wanted the horrific feelings to go away. My GP prescribed 5-10mg of diazapam which I only take when things become unmanageable! It has amazing results. Am home alone now, it's dark and I feel quite comfortable. It really has saved my sanity and my life as I couldn't have gone on much longer like I was. Miracle drug \"", "August 29, 2016"]},
{"text": ["\"Even before I got fired valium kept me calm and stress free. You don't have to take to many for them to work. You can skip days and still feel the same affect.\"", "(taken for 1 to 6 months)", "August 28, 2016"]},
{"text": ["\"Doseage: 5mg, 6 times a day\r\n\r\nPRO: That's a lot of valium.  It helps some (6 of 10) with anxiety and cuts back my \"plugged into an electric socket feeling.  Helps get to sleep. It is a great muscle relaxer and helps a great deal with my muscle spasms.  Don't know what I'd do without it.\r\n\r\nCON:  Makes me sleepy.  I have to be careful to take the drug on schedule.  Otherwise I can wind up with too much in my system at once.  Dangerous when driving.  You cannot drink alcohol with diazepam.  You don't just get sleepy; You pass out without warning.  I mean pass out. Maybe OK at home in bed.  Really bad any where else.\"", "(taken for 10 years or more)", "August 26, 2016"]},
{"text": ["\"I've been on valium for about 6 months now and have severe social anxiety and separation anxiety. But it definitely helps. Allows me to not feel as claustrophobic and not to get as shaky or frozen in anxiety producing situations. If I have an anxiety attack or feel like I'm going to have one then I will take a valium and it helps me get through the day.\"", "August 14, 2016"]},
{"text": ["\"Hello! I am a nurse and I suffer from anxiety and depression from very early age. I used many antidepressants through the years, but nothing was as helpful such as diazepam. It's a miracle drug.Finaly, maby in first timemy life l am filling calm and so secure   Because I am a nurse I was very afraid to take this kind of drugs, because I listened many times that this kind of drugs, called benzodiazepines can create an addiction  in a very short time, but my psychotherapist told me: \"yes, that's kind of drugs can be addictive, but who cares if it make you to feel good? It not working such narcotic drugs- usually you don't need to take larger amounts of drug through the years in order to receive the same influence.\"\"", "August 3, 2016"]},
{"text": ["\"I was prescribed 5mg tablets and although the Valium makes me feel a bit drowsy it one hundred percent helps with my anxiety.\"", "July 27, 2016"]},
{"text": ["\"This medication is amazing for me. I have severe anxiety. It was affecting me at work, at home. I was having anxiety attacks and felt\nlike I couldn't breathe constantly. It was terrible plain and simple. I was lucky to find a psychiatrist who had an immediate opening and was accepting new patients. She started me off on 5mg of diazepam. I took it and with in 30 min I started to feel relief from the anxiety. I take it once in the morning, once in the afternoon and take 2 pills before bed and it's helped me so much. I love it. I don't abuse it and don't recommend anyone to abuse it. You can build a tolerance to it so your doctor might adjust your milligrams. This is a quick fix for anxiety but will not help in the long run.\"", "June 29, 2017"]},
{"text": ["\"Now 77 years old, I have Depression with mild anxiety.  I am white married male with Mild Cognitive Impairment.   First took Valium (diazapam) first pill 5 mg in grad school 40 years ago, for acute  anxiety and slept for 14 hours.   Have been taking on and off, mostly for a nights sleep.  \n\nIt has had a beneficial effect over all, when taken perhaps as little as once a week.  Now, going through difficult times, I'm up to 10-20 mg to get to sleep, as being awake worrying is more harmful.\n\nI'm approaching addiction, yet my choices is depression, and agitation that only makes things worse.  So, I'm a bit of a zombie, not good, but seems better than agitated depression (if there is such a condition)\"", "June 21, 2017"]},
{"text": ["\"I had nasal surgery (septoplasty/latera splints) (1st surgery scheduled & 2nd was emergency surgery in 8 day span).  During consultation I mentioned that I'm not a mouthbreather and was anxious about breathing issues (not being able to breath or stop/dying in my sleep).  He gave me Valium to assist with the anxiety.  This medication is wonderful...it's only short term for me as I'm recovering from post-op traumatic experience.  Took it twice daily during the first 11 days now I take it only at bed-I feel rested when I wake up and I'm not crying/shaking/emotional when asked about the surgeries (yes it was horrible bc thats how they found out I'm allergic to silicone).  I will be coming off this med in a month or 2\"", "(taken for less than 1 month)", "June 6, 2017"]},
{"text": ["\"I used to be on Klonopin for years and I think it helped but I'm not sure since I was also on Paxil. It came to a point where neither were working for me even at higher dosages so I started taking Ativan. This really helped my anxiety but it would come back every morning. Eventually I hit tolerance and had to increase it. Eventually I hit tolerance again and I found myself feeling more anxious than ever. I decided it was time to get off. The doctor put me on Valium because it's easier to taper off than any other benzo. He suggested I could take anywhere from 4mg to 10mg per day. I slowly tapered down to 1.5mg but I was miserable.  I reinstated and went back up to 6mg and have also tried 10mg and it has never worked for me. Stay away from it\"", "(taken for 1 to 6 months)", "June 1, 2017"]},
{"text": ["\"I take Valium 2mg PRN for panic attacks. I was nervous about using it. I also had this warped idea that I would be labeled a pill head for taking a drug like Valium. I can honestly say that Valium is a life saver. The first time I took it all I could think about was how I regretted not taking it sooner. I can actually live my life now. You have to be careful though. It is very easy to build a tolerance to it. Use the lowest amount you need, because You would be surprised how much of a difference 1 mg will make. I have been trying to use it as a tool rather than a crutch. I also have ADD and Valium helps me fall asleep at night when I feel restless\"", "May 20, 2017"]},
{"text": ["\"I have bipolar 2, generalized anxiety disorder and suffer panic attacks. I am given Valium 5mg to take 'when needed'. While I feel it works well on generalized (mild to moderate) anxiety, it's not the most effective medication to take to during acute episodes like in a panic attack. I feel the 5mg isn't enough. Also if you take it even every few days, it pretty quickly becomes less effective meaning you may have to increase the dose. I now take 10mg as needed. It's very helpful, and I find it to be very effective, but perhaps not strong enough during acute panic attacks, but in general this medication is a blessing.\"", "May 12, 2017"]},
{"text": ["\"Suffering 16 years ago from PTSD after being told in hospital that I only had 30 mins before I would die, I was a wreck when I came home and lived in fear and terror, shortness of breath, uncontrollable shaking, extreme nausea, body aching all over, doctor and specialist visits - had every test known to the medical world, all came back normal.  Finally a friend suggested I try Zoloft and after a week I felt myself starting to feel normal again and after six months I gave it up, but since then I periodically have PTSD symptoms and 5mg of Valium (don't buy generic diazepam) on those days has been my life saver.  God bless you Pfizer Pharmaceuticals!\"", "(taken for 5 to 10 years)", "April 24, 2017"]},
{"text": ["\"I have been suffering from anxiety for years, I was very afraid of benzos because the potential risk of addition. I was prescribed everything in the anti depressive medicine group, plus a lot of antipsychotic medicine ( I am not psychotic ) just to avoid benzos.\nNothing worked,-finally I gave Xanax and Valium a chance. \nIt has been a life change, it works and it give me the control back.\nIf you are in doubt because of fears of addiction, let me ask you\nHow nice is anxiety attacks, how nice is it to have no control.\nThere is medicine that can help you so why not take it?\nMe, I would have committed suicide if I did not start to take  benzodiazepines.\nThey saved me.\"", "April 15, 2017"]},
{"text": ["\"I only use it when I'm having a panic attack (5mg) and it's incredibly effective. Just knowing it's there can be enough to stave off panic. Should never be used for mild anxiety, or used regularly, because it's important to use your own resources to deal with that, and you can become tolerant - but for those occasions when you feel you're losing control, there's nothing more effective that Diazepam. Doctors hate prescribing it - they assume you don't know how to use it responsibly.\"", "March 30, 2017"]},
{"text": ["\"I try not to use them often, I usually just try to put up with my anxiety because I don't want to go on antidepressants as none of them have worked for my anxiety and made my mood worse. So I find Valium when I really need it fantastic, it is quick and no side effects for me. It's a pity the doctors don't like prescribing it, people who abuse it make it hard for someone like me who really needs it in times of severe anxiety.\"", "(taken for 1 to 6 months)", "March 29, 2017"]},
{"text": ["\"I take 5mg twice a week and I would take more but my tolerance goes up quickly.  This medication works great and I would take everyday if I could with out the tolerance increasing but I don't want to chase the effects by taking more. I want to manage the medication not the medication managing me. I do take Tramadol three time a week on the days I don't take diazepam. I take each according to what I need that day for pain or anxiety what ever is worse.  I will go off everything for a week or two when ever my tolerance gets to high which is about every three or four weeks.\"", "March 17, 2017"]},
{"text": ["\"Great for anxiety. 2mg is reasonably gentle, lasts for about 2 hours and seems to minimize the crazy adrenaline-induced chatty-worried 'on edge' mind, a general inability to enjoy things and the paranoia that comes with the IQ-drop/iffy concentration (I.e. assuming the worst). Along with some coping strategies, consistent sleep and 'get up and go' tackling of fears, I find it really useful. Frustratratingly, it can't be used as needed and there's no \"prozac weekly\" equivalent, for obvious reasons.\"", "(taken for 1 to 6 months)", "February 23, 2017"]},
{"text": ["\"Excellent for obsessive thinking\"", "(taken for 5 to 10 years)", "February 22, 2017"]},
{"text": ["\"I have had anxiety and depression for many years and tried almost every anti-depressant and sedative known to man. I even used to self medicate with pot and booze. Until my back went out and the doctor gave me Valium.\n\n10mgs at night kept me much more relaxed but able to work and drive, better still my anxiety dissipated and my performance at work, ESP during meetings was markedly improved.\n\nI still take 150mg Effexor (SNRI) but it's the Valium that really did the job. My psychologist could not believe what an improvement the Valium had made and since then I take 10mg at night.\n\nI have heard bad things regarding withdrawals but I have had periods of 2-3 weeks of no valium with very little if any withdrawals compared to \"THE XANAX HELL\"!!\"", "February 15, 2017"]},
{"text": ["\"I've suffered social anxiety for years and just battled on. Then someone smashed into my car from behind while in traffic and I started having awful panic attacks. I didn't really know what they were at first but I was struggling badly. Eventually things calmed down but a hugely stressful life situation caused the attacks to flair up again.\nI finally sought help and was prescribed 2mg diazepam, 1 - 2 Tabs for an attack. I will barely take a headache tablet I was extremely worried about using Valium. But it's absolutely amazing. Use it with caution, take as little as possible and stop and see what happens. I can take half a tablet (1mg) to completely stop panic episodes that have built up over time. Be careful and it will serve you well.\"", "(taken for 6 months to 1 year)", "February 3, 2017"]},
{"text": ["\"I was put on 10mg Diazepam up to three times a day (90 pills). I must say this is a very good medication for my anxiety and socializing problems. Was on Klonopin but it was not as strong as Diazepam. I only take when needed not all the time. Simply the best!\"", "February 3, 2017"]},
{"text": ["\"Since beginning my dose of 10 mg of Diazepam 2x daily, my sleep is nowhere near restful. I have wild dreams, they feel very realistic and usually start well, but end in panic right before i wake up. This of course contributes to the giant versace bags under my eyes because I feel as if instead of sleeping, I just went through something crazy! At night, I take 10 mg 30 minutes before bed. Before that, iIfeel anxious, tense, and upset. I usually have to cancel plans with friends or loved ones because I can not get myself to put the effort in. Nights feel SO long and I used to love sleep, but now I almost want to avoid sleeping. overall, I'm not seeing how Diazepam is better than Klonopin, if anything, it's worse.\"", "(taken for 1 to 6 months)", "January 21, 2017"]},
{"text": ["\"I was suicidal aged 25. Anxiety and Depression. Diazepam saved my life. I started on 5mg 3 Times a day for a week cut down to 2 for a week then one at night under doctors orders. Also one Prozac in the mornings 20 mg. I felt better straight away. Don't let anyone scare you from taking Diazepam, yes they are addictive BUT my quality of life since taking it has been as a (normal) person. I really can't praise it enough as I know I wouldn't be here and living a good life without it. If the tablets help then why not take them.  Thanks for reading.\"", "January 17, 2017"]},
{"text": ["\"I try and avoid taking valium and only use it as the last resort if physical techniques (progressive relaxation, breathing control etc...) don't work. At most I have I never taken more than two 5mg tablets in a day. I find on an empty stomach the effects are within 10-15 minutes and it certainly calms things down mostly.  In my anxiety state I get a dreadful felling in the pit of my stomach followed by chest tightness and also the inevitable irrational thoughts, even though I know they are irrational. The valium seems to smooth it our and there is that calmness which block crazy thoughts (claustrophobia is one of them, being trapped, worrying about inconsequential things, playng out what-if scenarios... completely irrational stuff)\"", "(taken for 10 years or more)", "January 14, 2017"]},
{"text": ["\"Just take epilum. Sodium valporate.\r\n\r\nIt increases gaba without addiction!\"", "January 12, 2017"]},
{"text": ["\"I'm new to anxiety,  having to recover from leg surgerys for long periods of time without getting out of my room much, I had my first anxiety /panic attack after 8 weeks in bed. After a trip to the hospital, I was then placed on valium, many times per day at the beginning but just a few months later  I use them as needed. Maybe 2 per day. I have another surgery coming up and will be down again for only 8 weeks total. But this time I have prepared for more visitors as well as I will be mobile soon after surgery. I'm keeping my valium for now and hoping to get away from them during my physical therapy.\"", "January 10, 2017"]},
{"text": ["\"Works fast and is best thing that I have tried for my panic attacks\"", "December 30, 2016"]},
{"text": ["\"The last time I took it, it worked very well. It took a lot longer to kick in than xanax, but also kept working longer. It also helped with some of my chronic pain, which was nice.\"", "(taken for 1 to 6 months)", "December 27, 2016"]},
{"text": ["\"To anyone scared of taking this infamous drug (which I was) - you won't lose your sobriety, it just slows down your brain. This means it's great for situations where you risk creating phobia instead of familiarity (new places, new people). I'm armed with all the tools I need for knowing what my body and brain need as things happen (self-reassurance, gratitude, understanding, catching my own cogs before they turn, time out, etc) but you can't always choose when sensory overload will happen. As a pre-emptive measure this will be a useful tool for me when I know things'll be too handle even with an arsenal of knowledge to tackle the triggers.\"", "December 15, 2016"]},
{"text": ["\"avoid this medication it has stolen my life. i wasn,t told the risks of addition and withdrawal. and believe me when your going through withdrawal your on your own as drs are in denial about the consequences of this drug which i can only describe as horrific.  run for the hills if your prescribed benzos\"", "(taken for 1 to 2 years)", "December 4, 2016"]},
{"text": ["\"I'd highly recommend Diazepam. My anxiety is so much lower. I've only been on it for less than a week and I already feel happier about my life. I feel like it's given me the breathing space to take on things.\"", "(taken for less than 1 month)", "September 10, 2012"]},
{"text": ["\"I am suffering from acute anxiety and severe depression. I was given a 2mg dose of diazepam to take 2-3 up to three times daily. I took one tab and couldn't believe how much it helped me instantly. So far I'm coping with that. On occasions the anxiety is so great it doesn't work. On days I cope on one 2mg tab, know the following day should I be really bad, I up my dose to 3 a day. Truly a life saver only been taking them for 3 weeks.\"", "(taken for less than 1 month)", "September 5, 2012"]},
{"text": ["\"When I returned from my second tour in Vietnam in 1971, I was a \"mess\" mentally.  My diagnosis was/is Generalized Anxiety Disorder.  After trying various medicines, my psychiatrist settled on 10MG Valium three times a day.  Although certain circumstances will still make me anxious, they are limited and my normal life is fine.  Has worked for 41 years! Thank you Valium!\"", "(taken for 10 years or more)", "August 17, 2012"]},
{"text": ["\"I've been on Xanax, Ativan and Klonopin, and Valium is the only one that lasts long enough to not make me feel the need to redose just a few hours after taking it. I can forget a dose and not be panicking all day. The slower onset / offset also makes it less addictive for many, so I HIGHLY recommend this.\"", "July 29, 2012"]},
{"text": ["\"Life Saviour when it comes to severe anxiety and panic attacks.\"", "(taken for 1 to 6 months)", "July 26, 2012"]},
{"text": ["\"This is the best anti-anxiety medicine there is.  It doesn't leave you with more anxiety if you don't take your next dose due to the long half life.  Xanax and Ativan for example have short half lives so you feel terrible in a few hours.  Stick to good old fashioned Valium for Anxiety.\"", "(taken for 10 years or more)", "July 6, 2012"]},
{"text": ["\"I find brand Valium has a significantly higher improvement success. But with the cost difference I have to get what I can afford sadly. When I had better insurance I could get brand. \"", "(taken for 5 to 10 years)", "May 15, 2012"]},
{"text": ["\"When I finally got a doctor to prescribe Valium it was a life changing start. I always had social anxiety and was very introverted. After being on Valium I quickly moved up in my company because I could interact and socialize with no fears or anxiety. After a few years I was in charge of up to 50 workers and always got good feedback from customers, and professionals related to our work and was able to focus and enjoy dealing with many different personalities. The only problem was getting very sleepy while driving. \"", "February 10, 2012"]},
{"text": ["\"Years ago they did not have Xanax. I had panic attacks and this medicine saved me from losing my job for fear of driving! IT was my salvation from the terrible panic attacks!\"", "January 13, 2012"]},
{"text": ["\"This was the only thing that gave me some pain relief from severe irritable bowel syndrome, triggered/made worse from anxiety. Thank God for Valium. Only lasted about 3 hrs, but was a low dose of 2mg. Only a small supply was given to me as a short term solution, but I'm so glad I'm finally getting the relief from the anxiety and pain.\"", "December 17, 2011"]},
{"text": ["\"Valium worked wonders for me when I realized that my anxiety had been making me a shut-in with a low quality of life. Aside from developing an insatiable appetite at first, it seemed like a miracle. Example: I took a Valium before flying and could not find my luggage in baggage claim. Previously, I would have been shaking, crying and sweating. Instead, I confidently walked over to customer service and learned that my bag will come when the next flight arrives. Self-inflicted meltdown averted.\n\nIt's long half-life, however, can be a blessing and bad. It lasts practically all day, but that also means it makes me a bit drowsy and lazy all day as well.\"", "December 11, 2011"]},
{"text": ["\"Valium is absolutely wonderful. It will help people with sleep and anxiety, it also has quite a pronounced physical relaxation that I don't quite notice with other benzodiazepines like Xanax, making it useful for muscle spasms and uncomfortable aches.\n\nIt's definitely the longest-lasting benzo that I've ever had, the sedation lasts well and truly into the next day, sometimes even longer (48 hours) but it fades by then.\"", "December 8, 2011"]},
{"text": ["\"Valium makes me Stutter about 80% less! Wonderful medicine if taken the right way. I can be normal like everybody else, don't know what I would do without it.\"", "November 25, 2011"]},
{"text": ["\"Diazepam has helped me a lot. It mostly helped me at night time to sleep, that's when I would take it. Now I am on a quarter and starting to take it every other night only when needed.\"", "October 19, 2011"]},
{"text": ["\"Use of this medicine is to very effective in treating the illnesses for which it is prescribed.  They will also admit that it is an extremely safe medicine to use. Valium when used by me, sporadically, as needed, effectively treats my anxiety episodes, which untreated would probably lead to ulcers.\"", "October 9, 2011"]},
{"text": ["\"It helps me get to sleep without thinking all night long.\"", "September 22, 2011"]},
{"text": ["\"I've been taking Valium for two years now and really found it a lifesaver. I left my parents house and had to keep my old doctor (50 miles away) as I'm afraid if I join a new surgery they will want to pressurize me to come off my it, as I also receive 20 mg of temazepam to help sleep as well. I find most doctors very unwilling to prescribe benzo's.\"", "September 16, 2011"]},
{"text": ["\"I am prescribed to take 10mg 3x a day, but find it only necessary to take a 5mg in the morning and a 10-15mg in the evening. That way, I can still function during the day and sleep well at night.\"", "September 7, 2011"]},
{"text": ["\"The best anxiety medicine I have taken and I have taken them all. Works very fast, about 20 minutes and keeps working. Also for me it is basically non-addictive. I can take it when I like and then stop for long periods if I want to. In fact I used Valium to get off Klonopin which was a nightmare to get off until Valium was substituted.\n\"", "September 2, 2011"]},
{"text": ["\"I was given a short course of valium 4x 2mg a day for 5 days. I needed a slight relaxant, as I was going through opiate withdrawals through no fault of my own. It seemed to work pretty okay, but I think for panic attacks and anxiety I would say you need a minimum of 5mg, as I don't think 2mg was enough to take the edge off it. A great medicine though.\"", "August 29, 2011"]},
{"text": ["\"I would get really nervous around people and loud noise. I take 2 x 10mg a day, one in the morning and one in the evening. It helps a lot. I wish I would have been taking it years ago.\"", "August 26, 2011"]},
{"text": ["\"I have had trouble sleeping for over 25 years and about 10 years ago started having panic or anxiety attacks in the morning. I tried Xanax, the side effects made me depressed and angry. Valium has always worked well with little or no side effects. I take 5mg in the morning and 10 mg at bedtime and this works great. I have been on the same dosage for about 9 years and have had no problems. I would highly recommend this as opposed to Xanax or other benzodiazepines.\"", "August 20, 2011"]},
{"text": ["\"I have generalized anxiety disorder and I only take Valium as needed. When I am going to do something that will make me particularly anxious (e.g. a date with a girl) I take 3mg. It helps me to be myself.\"", "August 18, 2011"]},
{"text": ["\"I have suffered with anxiety and panic for years, since about 14 y/o. I have tried several different benzodiazepines over the years but always go back to diazepam. I can use it for both preventing a panic attack before a specific situation, or use it to relieve one once it's started. You can even take it the night before a specific event for nervous insomnia. Diazepam calms me down without tiredness or feeling spaced out.\"", "August 16, 2011"]},
{"text": ["\"I have been taking three 5mg Valium per day for the last four years. It has worked wonders for me. I haven't changed the dosage and have had no reason to increase it. Before I started this course, I would literally worry when I would get nervous. I don't even feel it in any way when I take it, but don't get anxious and am able to make decisions that I can't when I'm so nervous. \"", "August 15, 2011"]}
]