[
{"text": ["\"Yes, it will stop panic attacks, but good luck coming off it. I was having severe anxiety after a bad spell of taking Lexapro, which made my anxiety worse and gave me constant panic attacks, so my doctor had me taking .5 mg three times a day. I was so grateful to have some relief that I didn't question the dose, but the more I read about dependence, the more nervous I became. I started tapering off it after only a month and I thought I was going to die. Hallucinating, insomnia where I didn't sleep for days, couldn't keep down solid food, crippling depression and agoraphobia...it was a nightmare and I was contemplating checking in to a hospital. I eventually transitioned to buspirone and eventually Pristiq. Such a nightmare. I can't recommend Ativan to anyone who may be sensitive to benzos.\"", "(taken for less than 1 month)", "November 13, 2018"]},
{"text": ["\"1st time sharing a story or  review but I just think this is so important to talk about and let others know. My mother is only 60 years old and has been suffering from depression and anxiety and also panic attacks for about 15 years.  3 months ago my dad pass away so my mom had a breakdown and ever since has been crying complaining about pain on her chest....palpitations...suicidal thoughts. The antidepressant she  is taking doesn't seem to help her at all. So we took her to the hospital because we  don't know how to help her. No medication helps for her, only ativan is the medication that makes all the above go away ..but doctor doesn't want to prescribe it to her.\"", "October 27, 2018"]},
{"text": ["\"I was hospitalized with Pneumonia and was having very severe anxiety issues. I was having horrible tremors that would not stop.  The first time I was put on a  antianxiety drug it was buspar. That was a bad mistake.  I went to the ER with such horrible tremors that I was put on  Lorazapam to control my tremors.   I was given a 2mg dosage which worked like a charm to control  them.  I have only been on them since the tenth of October.  when I saw my PCP recently he was worried about them not being affective enough . So he upped the Dosage to .05  I took my first dose today.  Within hrs of taking this  I was shaking so badly that it scared me.   I called the on call doctor at my clinic and was told to go back to the 2 mg dose.  I did just that.  I feel a little more under control  now.  But I will never use that high a dose again. On Monday I am going to give him a earful of what happened when he decided to do this.   I am not so sure that I want to stay on antianxiety  meds after this.\"", "(taken for less than 1 month)", "October 26, 2018"]},
{"text": ["\"Lorazepam saved me. At my worst it was the only thing that kept me being able to function. 2 months ago I had some form of a breakdown and began suffering severe panic/anxiety attacks. During that time I've managed to go to work, look after my kids, socialise etc. there is no doubt in my mind that if it wasn't for lorazepam I would have spent the past 2 months in bed. I take it as I need it - sometimes nothing, sometimes up to 2mgs a day. Only side effects have been headaches and (when I don't use it for a few days) very vivid dreams. Using other therapies to manage my situation  also.\"", "(taken for 1 to 6 months)", "October 20, 2018"]},
{"text": ["\"I am the 1% of people who take Ativan and suffer from extreme anxiety and paranoia. If you experience these symptoms you are NOT alone, but you should stop taking the medication (with help of a doctor) . Once I stopped taking it I felt so much better and was not paranoid or filled with anxiety.\"", "(taken for 1 to 6 months)", "October 9, 2018"]},
{"text": ["\"Ativan works for me. Diazepam does not.\"", "(taken for 1 to 6 months)", "October 9, 2018"]},
{"text": ["\"I have had anxiety and depression real bad for 7 months. Was prescribed venlafaxine and lorazepam. Venlafaxine was increased every two weeks till I was on the higher dosage,  but it did not work. Now on Sertraline 150mg, have been using 1 month no difference yet. Lorazepam I  was on 1mg once daily and it was great I felt normal, then it started to be less effective so was told take 2 a day. Now it is less effective again as I am tolerant to it, I know I am addicted to it but I need help to get through this. I am tired of the anxiety and crying all the time.\"", "(taken for 6 months to 1 year)", "September 22, 2018"]},
{"text": ["\"I was prescribed this to take prior to a MRI.  I had been taking Klonopin \n for my anxiety which is more slow acting so thought I would try this. It immediately calmed me down before the MRI and I felt good after.  I spoke with my PCP about trying this instead of Klonopin and she was ok with that at 1 mg twice a day as needed. The first week was fine and then during week two I was having a lot of panic attacks, chest tightness and insomnia. I suffer from MS so never sure what is MS related or anxiety caused problems. I have decided to go back to the Klonopin. It doesn't kick in as fast but lasts much longer and I feel much better on it.\"", "(taken for less than 1 month)", "September 16, 2018"]},
{"text": ["\"Started this almost a month ago. GAD, PTSD. I was on Xanax 9 years 1 mg daily worked amazing. Dr said had to get of so I did. Wasn’t bad getting off took lexapro and had no bad withdrawals. Dr then put me on this ativan 0.5 a day. Good for anxiety but I’m so tired all day long. I could sit and fall asleep. When it comes to night time I take half ambian to help me fall asleep because by then activan wears off.\"", "(taken for less than 1 month)", "September 9, 2018"]},
{"text": ["\"Great medication for anxiety! Helps me survive.\"", "August 29, 2018"]},
{"text": ["\"Usually only take it when work gets stressful as I get really bad insomnia due to that fact. I've been taking 0.5mg for roughly 4 years now as needed, never experience any super negative side effects from it thus far. \n\nI would definitely recommend this medication for those who only experience certain bouts of anxiety from time to time, but wouldn't rely on this medication to subside your anxiety on a long term basis.\"", "(taken for 2 to 5 years)", "August 26, 2018"]},
{"text": ["\"Terrible and dangerous. Muscle jerking, auditory hallucinations, jumpy all day. Even WORSE anxiety. If it is not life or death. Do not take!!!!\"", "(taken for less than 1 month)", "August 22, 2018"]},
{"text": ["\"I have been taking Ativan for almost three years now this second time around.  The first time around,  I tool it for two years.  I am taking 1mg three times daily.  It only last 3-4 hours at most.  When I wake up in the morning,  I have a severe headache from going 10-12 hours without Ativan,  I get severe headaches and deal with confusion.  I also get severe rebound anxiety often.  I am currently trying to wean off of this medication now and find a more suitable medication.  I wish I would have never started taking this medication.\"", "(taken for 2 to 5 years)", "August 20, 2018"]},
{"text": ["\"Has anyone been on this drug for 25 - 30 years? Once it was a miracle for me. Now, not so much. Doc never said it was addicting but had me take 1mg 3 x per day and ambien for sleep.  Lexapro, too. No one in medical field admits to this drug as affecting the heart, I mean so that you have to take it. So what should ya do? Try to taper? Tried a detox program/crash course 7 days. Trying melatonin for sleep, not benzos. Down to 1 mg each morning, would like to get off or have them work like they did in the beginning. Any comments?\"", "(taken for 10 years or more)", "August 19, 2018"]},
{"text": ["\"I have been taking 0.5mg of Lorazepam as needed for years. Helps calm me down at bedtime or after stressful day.  I sleep like a baby and wake up refreshed. Also 0.25mg has relaxed me during the daytime.  Personally I don’t find it habit forming nor do I have any negative side effects.  Love it!\"", "(taken for 5 to 10 years)", "August 14, 2018"]},
{"text": ["\"I HIGHLY recommend this drug. It’s a miracle worker! I started having anxiety after my boyfriend and I broke up, I would cry at night and have panic attacks. I only take this drug when I need severe relief and I’m so thankful it’s available. Try it just once if you are having bad anxiety, if it’s not for you then switch. I was nervous trying this because I didn’t want to feel high when going on a benzo drug. You definitely don’t feel high you just feel tired and oddly “okay”!\"", "(taken for 1 to 6 months)", "August 11, 2018"]},
{"text": ["\"I have extreme anxiety, Ativan is fast working. Usually can feel it within 15 minutes, I do find that it's more of a crutch, a way to forget your problems instead of dealing with them.   Don't drink alcohol with them. If I'm having an anxiety attack or a panic attack and it's been a week since I took one, they make me start to cry. I feel better afterwords, do these make anybody else cry?\"", "(taken for 1 to 6 months)", "August 9, 2018"]},
{"text": ["\"I am a 35 y.o. male, about 9 months ago, I began to have panic attacks which turned into chronic anxiety based on obsessive thinking. I have taken 0.5 mg of ativan only as-needed during this time.  It produces a mild calming effect after about 50-60 mins (though has taken longer to kick in at times) In my case, I really need it to calm my overthinking / agitation. There have been times when this pill made me feel a total turn-around from a bad day, other times it had the effect of returning me right back to normal. Sometimes, I feel I need to take just a little more than 0.5 mg. I have been incredibly hesitant to take this drug more often, part of me wants to try it on a more daily basis, but we'll see. I should mention I took zoloft for the better part of 6 months, but it did not help with my anxiety issues. Plus, I don't want to rely on antidepressants for this issue if I could avoid. I recommend ativan to help take the edge off, and like that I can take it on as-needed basis.\"", "(taken for 6 months to 1 year)", "August 8, 2018"]},
{"text": ["\"I used to take Ativan for appointments & other anxiety-provoking situations. It would relieve anxiety for the dental appointments & ENT appointments but that was it. It never reduced my anxiety for blood tests or other appointments, despite the fact that I did not have any other drug given to me for the Dental or ENT appointments.  It also worked for certain anxiety-provoking situations (such as public speaking) but only 50% of the time. However, I am epileptic & on anti-seizure medication. Despite the fact that I am on anti-seizure medication, I will always have a Simple-Partial Seizure 4 days after I last took it, even if it was only 0.5 mg (the highest dose I would have would be 2 mg). Because of this, I do not recommend this drug to anyone; I had taken it over a span of ten years (as needed & not even every month - I would go months without taking it) but after realizing that it was the cause of me having Simple-Partial Seizures 4 days after taking it, I won't ever take it again.\"", "August 7, 2018"]},
{"text": ["\"I've had horrible anxiety since I was about 7 years old probably caused by having a chronic illness so early In life and I also have the fear of vomiting so every time I feel sick I have an awful panic attack. I was prescribed 0.5 mg of this and have only been taking half a pill as needed and honestly it is exactly what I wanted so far. It's a medicine that literally does nothing but chills me out, it's calms my heart and makes me comfortable.\"", "(taken for less than 1 month)", "August 4, 2018"]},
{"text": ["\"I been facing generalized anxiety disorder for over 4 years, I don't know whats going on with me, I have been informed by doctors its the Colon issues, but when I came back to my country I visit psychotherapist and he told me what is going on literally  GAD. I started to take Zoloft 50 mg then increased to 100 mg, then 150 mg, but after using this medicine for 3 weeks I start feeling empty brain, very disorder thinking, visual problems, so the Dr advised to take lorazepam, I start to take .05 at morning, and .05 at night, seriously I felt so human, and all the rubbish is gone, then after a 10 days I stopped the morning dosage and I am on .05 mg at night, all going well, and my mood get back by 80% all the Anxiety rubbish gone, and I am so proud of my self\"", "(taken for 1 to 6 months)", "July 30, 2018"]},
{"text": ["\"0.5mg lorazepam saved me from \"bad\" thoughts couple of times. Worked like a charm. Good to have it around, though I am sure, doctor won't prescribe it if I ask.\"", "July 17, 2018"]},
{"text": ["\"Started taking Ativan when I was 18 years old due to a nervous breakdown. Doc prescribed it to me after experiencing a full-blown panic attack that didn't seem to subside. I felt immediate relief after months of experiencing depression and anxiety attacks. Over the years, I became dependent on it (I take 3-5 times a week)  I never take it for more than two days in a row because of a bad reaction that I had like 13 years ago. Doc says I'm SUPER sensitive to meds. \n\n Because I take it so sparingly, I have not developed tolerance , but I am dependent on this medication for my agoraphobia and panic attacks. This drug allowed me to go outside and socialize, make new friends, and hold down a job. This job allowed me to live!\n\nI don't want to become dependent on it, so I started tapering. I take .25 once or twice a week. My goal to go off this drug completely and use it only for emergencies.\"", "(taken for 10 years or more)", "July 13, 2018"]},
{"text": ["\"Was prescribed Ativan after some stressful/anxious times at work. Very effective. I take it as needed, usually 1mg every three days at night. Sleep like a baby and wake up the next morning energised and ready to start the day. Only worry is the possible addictive qualities. I also take small dose Cymbalta 30mg, each morning. Have been contemplating weaning off this and introducing Ativan every evening.\"", "(taken for 1 to 6 months)", "July 13, 2018"]},
{"text": ["\"I was having chest anxiety. My mind was completely clear. Not anxious, not stressed, not racing. But for the life’s of me I could not take a full breath. \n\nI went to multiple doctors and ran all the tests. EKG was normal, chest X-ray was clear, blood test was fine. \n\nMy doctor said that we’ll have a follow up session but he gave me a few lorazapam to take for emergencies. \n\nLast night I took half of a 0.5mg tablet. So only 0.25. I slept incredibly and my breathing problems were gone. This morning after I woke up my breathing has improved significantly. \n\nThe only negative side affect I’ve noticed is a very dry mouth and a little bit of a dry throat.\"", "(taken for less than 1 month)", "July 10, 2018"]},
{"text": ["\"I am a 35 year old female with Bipolar Disorder Type 1 and generalised anxiety.  I've been taking lorezapam off and on for about seven years, only during panic attacks or particularly bad spells when my anxiety can't be managed by the coping techniques I've learned over the years through CBT, mindfulness meditation, etc, and my daily mental health medications (quetiapine, venlafaxine, and topiramate).\n\nWhen I do need to use it lorezapam is a godsend.  It works more quickly than diazepam, which I'd previously tried, which is what you want when you're in the midst of a panic attack or suffering badly with anxiety.  It's very effective without being too much and I haven't had any side effects, just slight sedation.\"", "(taken for 5 to 10 years)", "August 30, 2017"]},
{"text": ["\"So with my Schizoaffective disorder, in the mornings I get moody and grumpy and little stressed, so I take 1 mg before going to work and in 30 minutes exactly magic happens and I feel relaxed and calm which leads to better communication at work since I'm a peer support worker.\nworks great 10/10\"", "August 25, 2017"]},
{"text": ["\"Taking 1-2mg as needed for panic disorder. I try to limit taking it 2, 3 times a week and only when my anxiety is so bad I can not cope with it on my own. I do not want to be on antidepressants because of the side effects so this is a great option for me.\"", "(taken for 6 months to 1 year)", "August 13, 2017"]},
{"text": ["\"My husband was 38 years old and committed suicide while taking Ativan. This medication was administered to him from two different psychiatrists. Ativan was prescribed for his anxiety. He took it in combination with Welbutrin for his depression. He was on Ativan for approximately three months. The medication made his heart race because of the lethal combination mixing with Welbutrin for his depression. He became manic, paranoid, and had extreme body tremors, insomnia, and many many trips to Emergency Room from side effects.  This company  knows it can cause suicide and writes it on the label. Do not take it.\"", "(taken for 1 to 6 months)", "August 8, 2017"]},
{"text": ["\"I have had severe anxiety for a couple of years. My attacks get so bad, I feel I need to run as far away as I can. Taking Lorazepam 3mg a day has been a tremendous help. I have read comments about going off the medicine and the difficult withdrawls, but if something works in your personal lifestyle where nothing else has, why shouldn't you be able to stay on this medication as long as you need it? It's like high blood pressure. If you have it and can't get it under control, medications are key. No one starts telling you that you should stop the medication.\nFor some, Lorazepam is a lifesaver. Maybe not for everyone, but for me, in my situation it is.\"", "(taken for 2 to 5 years)", "August 5, 2017"]},
{"text": ["\"I forgot how well this stuff works. I've been using Ativan every so often for six years. I hadn't taken it in ages but had a panic attack tonight and I feel really good now after taking it. I know when my anxiety was a lot worse, it didn't bring me down to 0 anxiety but took the edge off. At one point in the past I was taking it pretty much daily but never became dependent on it (I only take the 0.5mg dose). I do feel kind of sleepy, but pleasantly so. In my experience the sublingual (under the tongue) type works a lot better than the normal swallowed pills.\"", "(taken for 5 to 10 years)", "August 1, 2017"]},
{"text": ["\"If I take 3mg's this works very well for anxiety and it works quickly, the only thing is it usually also makes me sleepy so I try to only take it when I know I can go take a nap if need be, other than that no complaints.\"", "(taken for 1 to 6 months)", "July 29, 2017"]},
{"text": ["\"OK OK Ativan does work, especially when you're having a full on attack in the psychiatrict unit. But just like everything else it does become addicting. Beware\"", "February 21, 2018"]},
{"text": ["\"I have had a history of panic attacks for years.  Been to the  emergency room feeling like I was dying.  Felt almost as if I was having seizures.  Couldn't get deep breaths and would get dizzy and feelings of dread, nerves under eyes would literally ripple.  Went to ER about three years ago and thought I was having a heart attack,  and it was a panic attack.  Dr.  told me to get to a psychiatrist.  He started me on a low dose .5 mg three times a day.  Within about 6 months I was taking 5 mg a day.  I was getting 75 2mg tablets per month (so 2 1/2 pills a day).  I know it is a lot but does keep my anxiety at bay.  Problem is if I don't take a dose at night thinking I don't need it,  I wake up feeling terrible.  This is not a medicine that will be easy to ever come off of I know.  At least my life is tolerable again though. It makes me a little drowsy sometimes but not too bad.\"", "February 21, 2018"]},
{"text": ["\"After years of crippling anxiety, Lorazepam gave me the most wonderful feeling of calm I have ever experienced. Unfortunately, as with other benzos, it doesn't last forever and you have to take more to get the same effect. If they could make a drug that continues to make you feel that calm, it would be a wonderful thing!\"", "February 14, 2018"]},
{"text": ["\"Be careful with this sneaky drug at first it works great but very quickly I mean  within days it is highly addictive before you know it you’ll be using it daily and withdrawal syndrome associated with benzo’s is horrible. Use with caution\"", "February 13, 2018"]},
{"text": ["\"Helps for my insomnia better then it does for my anxiety. But I have Klonopin and Xanax for my many panic and forms of anxiety.\"", "(taken for 10 years or more)", "February 2, 2018"]},
{"text": ["\"I have tried multiple medications for anxiety and found this one to be the least effective. For my panic attacks it does not work as well as klonopin which I found to be the best. Maybe I'm on too low of a dose (.5mg) but I need to go back to my doctor and ask to try something different.\"", "(taken for 1 to 6 months)", "January 26, 2018"]},
{"text": ["\"I was prescribed Ativan for panic attacks due to anxiety, and it has worked wonderfully well. After trying many different antidepressants and seeing no results, my doctor prescribed me 1mg Ativan for use as needed. As soon as I feel a panic attack coming on, I take a tablet - within 10 minutes, I start to feel calm, safe and relaxed. It’s a tremendously useful “emergency stop” button for panic attacks. The idea of having a medication that can stop a panic attach should one come on allows me to feel safe and relaxed throughout the day.\"", "January 12, 2018"]},
{"text": ["\"I took lorazepam initially for anxiety during dental procedures. Then for social situations, meetings at work, then for help relaxing and sleeping.  At no time did I know how much it would negatively affect my life.  I took it for years!  I have been lorazepam free now for 3 months. I used a chart I found online to withdraw safely over 16 weeks.  My short term memory is now so much better. That is significant because I am elderly.  I no longer for bouts of rage for no reason.  I am now sleeping at night without medication.  I do not feel this medication should be given to any patient.  Just so glad I am free.\"", "(taken for 5 to 10 years)", "January 3, 2018"]},
{"text": ["\"It’s much better than any other benzodiazepine, it causes I think less dependence and it’s so effective for anxiety, panic disorder. For insomnia perhaps it’s good with another coming along with.\nI really recommend it. I have tried other ones before and with diazepam and this one it’s the best.\"", "(taken for 1 to 6 months)", "December 22, 2017"]},
{"text": ["\"Started taking Ativan a few weeks ago and have noticed a decrease in my anxiety. I can also sleep a bit better\"", "December 8, 2017"]},
{"text": ["\"I have  taken lorazepam off and on for about 17 years.  Sometime high anxiety events come up, like losing your job, or finding out someone spend all your money, or the loss of a love one in your family.  I don't abuse this drug. It has the potential to be very addictive.  Getting off it can be very rough.  In the last 10 years, I take it, very sparingly.  Only 1  .5MG, and I try not to take it more than 2 days in a row.  I tried to learn to reduce the anxiety or pressure by other methods like running, reading music etc.  I tried to space it out usage at least 2 to 3 weeks even if I am going through a most difficult time like now, with the loss of my son.  It's not a cure, since u body requires more the more you use.\"", "(taken for 10 years or more)", "December 7, 2017"]},
{"text": ["\"Doctor prescribed ativan super willy-nilly because I've been dealing with panic attacks, and told me to take a 1mg tablet when I need to. Tried a 1mg tablet while panicking, and the effect is just unpleasant. I definitely feel that there are less 'voices' in my head; everything is much more quiet. But I'm also extremely drowsy.. so much so that I doubt I'd be able to take ativan at work (where my anxiety actually occurs). I'm also having strange muscle pains.. just feels like a really lame weed high. I won't try it again.\"", "November 22, 2017"]},
{"text": ["\"About 4 years ago I started having early-morning awakening/insomnia/anxiety after excessive alcohol consumption the night before. Discovered that I could prevent this by taking diazepam my wife had lying around. When this ran out my GP prescribed lorazepam 0.5 mg. Gradually this lost effectiveness (tolerance) so I quit, also cut down on alcohol. A year ago I had a stressful situation and started 0.5 mg daily for a month, but was able to stop again with no side effects. However, my early-morning awakening/insomnia/anxiety had become chronic and independent of alcohol. A month ago I started 0.5 mg daily for 10 days, had a severe withdrawal, had to taper off. So, yes, like others wrote here: it works great, but not for chronic use.\"", "(taken for 2 to 5 years)", "November 21, 2017"]},
{"text": ["\"During several years of dealing with a psychotic family member in the home, I was on any number of psych meds. Ativan is the only one that works reliably when dealing with a screaming nutcase on a continuing basis. It's smoothing out the rough patches of the divorce now too.\n\nWhen I am under constant stress, I take 0.5mg 3 times a day.\n\nDO NOT discontinue suddenly. Taper off 0.5mg per day or every other day - You want to taper off over at least 5 days.\"", "(taken for 2 to 5 years)", "November 17, 2017"]},
{"text": ["\"I started having anxiety attacks 6 years ago while visiting my baby in the NICU center she was born at 25weeks weighing 1 lb 15oz.....at that visit I started feeling chest pains and I instantly thought I was dying from a heart attack only to be told it was anxiety. Dr tried me on med from Lexapro to Paxil to visitaril TO BUSPAR TO XANAX,Zoloft. The Xanax works really well for me, but I was seen in ER yesterday for heart palpitations, chest pain, muscle and body weakness, blood pressure elevated heart rate elevated I thought it was the end of my life,  The dr then said he would give me an injection of Ativan sent me home with some as well.....Last night was the first night I was able to sleep peacefully thanks to Ativan,,\"", "July 27, 2017"]},
{"text": ["\"Female, 21. Developed a panic disorder and hypochondria at 16. I did CBT therapy for a long time which helped immensely. I would go to the ER and Dr constantly. I would have a hard time falling asleep because I would panic I would die. I have been on this for 6 years, 0.5mg-1mg as needed. I only took it when in the throws of panic during a time when I did not know how to cope. It has done absolute wonders for me. I take 0.5mg only a few times a year now just when my GAD gets to be too much or anxiety disrupts my sleep for more than a few days. It's wonderful in small doses, as needed, and combined with CBT. I have had no side effects or withdrawal except if you take it when you aren't panicking and on occasion it can make you quite sleepy.\"", "July 24, 2017"]},
{"text": ["\"I'd been having problems with insomnia and anxiety, both conditions feeding off each other and making the other worse and creating mild depression. My GP prescribed 0.5mg to be taken at bed time as needed, to be increased to 1mg if needed (only gave me 14 tablets as they are habit forming). Amazing results! I slept through the night and woke feeling calm and NORMAL for the whole next day AND the day after! I've taken 3 doses in the last 11 days, and took 1mg after a particularly stressful day with the same good results. No side effects of note except for a very mild headache 24 hours after the first dose. \n\nI'm expecting to have a decreased need for these after starting a new job in the next week but so happy to have them to get me through.\"", "(taken for less than 1 month)", "July 21, 2017"]},
{"text": ["\"I was given a double dose of Ativan IV in the hospital and 1mg dose pills for home!\nOnly took .25 on occasion and now I'm having withdrawal symptoms!Can anyone answer my question about Ativan being addictive with only .25 mg occasionally?\"", "July 15, 2017"]},
{"text": ["\"They work very well\"", "(taken for 1 to 2 years)", "July 10, 2017"]},
{"text": ["\"You would have to be crazy to take Ativan.  I took 1-2 mg 2x a day for 6 months and had withdrawal symptoms for almost 4 years after stopping over a 2 week period per my doctor. If you think your life is bad before taking Ativan just wait until you experience the withdrawal and after effects of this poison.  After 2 years still had vibrating hyper sensitive vision and hearing .  Burning in your nerves especially in your feet.  Forget sleep all you do is lie in bed awake for me almost 2 years dreaming while awake.  That part was the most torturous part of the med.  The FDA needs to remove Ativan from FDA approval immediately.\"", "July 5, 2017"]},
{"text": ["\"Used at a funeral, supposed to take 0.5mgs, did not work at all.  Took another, and another, and another.  Maybe my doctor sucks, or maybe Ativan sucks.  Do yourself a favor and get some Xanax if needed for occasional anxiety.\"", "(taken for less than 1 month)", "July 1, 2017"]},
{"text": ["\"I have been dx with bipolar, anxiety and depression. Although I rarely am depressed. My anxiety has caused me several trips to the ER. Shortness of breath, hyperventilating, nausea and chest pain. My lungs are already in the second stage of hereditary emphysema (aka) Alpha 1 Antitrypsin Deficiency. When my lungs are having difficulty moving and exchanging gases my anxiety is already on edge ... However when the anxiety gets worse my shortness of breath gets worse.. Furthermore has landed me in ICU. Recently after trial and errors I was prescribed barbiturates. An ER doctor prescribed me Ativan. I have saw a tremendous difference in my anxiety. My family practitioner has added paxil to take with it. It has been a week so far, I am feeling so much healthier\"", "(taken for less than 1 month)", "June 21, 2017"]},
{"text": ["\"I rate this 9/10 because I haven't used it enough.  I have agoraphobia and anxiety/panic disorder.  Lately, it has been hard for me to leave my house and so I would get anxious inside the car and then at the destination.  Moment I woke, I took 0.5mg on an empty stomach to let it kick in while I brush, change clothes, and later eat.  By time I leave the house, I noticed I didn't feel any hesitation to step out.  The car ride was calm.  I didn't sweat, no feelings of wanting to panic.  I was able to browse clothes and shoes without having to do my usual breathing exercises to keep myself relaxed.  It enabled me to shop without worry, panic, and rushing.  I have only taken it twice, a month apart.  No drowsiness or sleepiness for me.\"", "June 18, 2017"]},
{"text": ["\"Fast acting.  I take .25mg once or twice daily. Some days none.  I have a slight dependence on it even at the low dose. \nI can skip it but notice when I do. Not nearly as effective as it used to be but still works.  I prefer to keep the dose low and use it with Buspar 7.5 twice daily and 75mg Effexor XR for my OCD and depression.  The Effexor seems to help my OCD and the Buspar/Ativan takes the edge off the Effexor.  I also use Ambien CR 12.5mg.\"", "June 17, 2017"]},
{"text": ["\"I've been using ativan for anxiety and insomnia for the last 5 or so years.  Lately I have been having side effects after taking only 1-2 pills at night for sleep.  It does help me fall asleep but the next day I wake up nauseous.  And I'm nauseous all day.  Another weird side effect that it seems no one else has experienced is that my skin feels weird, like my fingers feel like there is a coating on them...It's hard to describe but it happens every time I take ativans.\nI get no side effects like this from valium or xanax.  I hope my doctor will switch for me.\"", "June 14, 2017"]},
{"text": ["\"At the age of 29, I've developed anxiety and it's gotten progressively worse, with me ending up in the ER for what I thought was a panic attack. After evaluating me, the doctor confirmed I'd had a panic attack and had the nurse give me an Ativan. I came to to the ER in tears, unable to control my breathing, feeling suffocated, body tingling, nauseous, face numb, the whole 9 yards. After taking the Ativan, I was feeling completely back to normal within 15 minutes, I could not believe it! They gave me a short prescription for it until I can follow up with my health care provider and it really is such a miracle drug that really calms the anxiety, allows you to think clearly, and feel relaxed.\"", "(taken for less than 1 month)", "June 10, 2017"]},
{"text": ["\"I took too much Ativan which gave me delusions and super depressive  thoughts.  Stay away from pharmaceutical drugs.\"", "(taken for 6 months to 1 year)", "June 8, 2017"]},
{"text": ["\"I dealt with troubled sons. One did 12 years of Angola La State Pen. He came to  worked for me for some years. Was extremely stressful to deal with an ex-convict in weather in construction bricklaying business. A bit later my youngest Son moved out. He got with awful drug addicts. Did Meth, Coke, Vodka. Tore up apartments, his own house fora sum of $32,000 coming off meth. He did $10,000 damage on a 1999 super Dodge Dakota.  Lorazepam saved my life. I'm a 225 lb man, 76 years old. I started 20 years ago. Worked for me in 30 minutes, I felt calm and hope come over me. I take 2mg morning and night.  Why would I care if this addiction makes me feel good. You shouldn't care either if this addition helps you cope. It's a miracle drug. Thank God!\"", "May 5, 2017"]},
{"text": ["\"I was prescribed this a few months ago getting anxiety while driving. The prescription is '0.5 mg once a day as needed.\" I have taken it about 3-5 times a week, a few times I have taken it twice a day. I have been having family issues recently, and I first thought that was the reason my occasional anxiety has progressed to debilitating (flying off the handle, depressive dying thoughts, chest pains) but  after research I've concluded that I'm actually going through withdrawal when I don't take it everyday. Now it's 2:36 AM, I'm scared, mind won't shut off,  don't know how to wean off of this properly. I'm  tired, will be calling into work in the morning for lack of sleep. Please do not take this and just get counselling for your anxiety first\"", "May 4, 2017"]},
{"text": ["\"15 years of trying different medications to help me cope with my anxiety disorders. Unfortunately for me as the drug addict I once was, has made it almost impossible to get prescribed lorazepam. Even though lorazepam is not a drug I've ever abused, it still is extremely difficult to obtain a prescription. I tell you that nothing is impossible. This medication alone, has saved my life. It's effects are strangely different than that of other benzodiazepines. My opinion, Just take RX exactly as prescribed by your Dr. and utilize coping skills such as DBT, to further your success in managing/coping with a crippling disorder such as anxiety. Lorazepam is highly effective, instant reduction in anxious thoughts/feelings/emotions, and is proven.\"", "(taken for 5 to 10 years)", "April 25, 2017"]},
{"text": ["\"I am a nervous flyer and my anxiety has been getting particularly bad, so I decided to go to my family doc and get a prescription. My doc gave me ativan and said to take 1 mg 1 hour before the flight. I took 1 mg exactly as she told me and then another 0.5 mg midway through the flight.During the flight, I felt completely calm and at peace, which has never happened before. Highly recommend for infrequent fliers with anxiety\"", "April 21, 2017"]},
{"text": ["\"Have been taking this for situational anxiety for many years. It worked to some degree but I would always feel depressed afterwards which was awful. Last year I used it daily up to 1.5mg while I was changing my anti-depressant. This was a huge mistake. I soon reached the tolerance and began to get rebound anxiety which started up every morning. I've been off of it for 10 weeks now and still suffering. This is really hard to come off of. My advise is don't take this more than once a week and that may be too much. My anxiety is so much worse because of lorazepam.\"", "April 20, 2017"]},
{"text": ["\"I have had various SSRI's and etc - nothing worked. Just gone on 2.5mg ativan and feel it has saved my life. Seems I had crippling anxiety without being aware of it, as no panic attacks etc. So there are some people with bad experiences,  but do not generalise.\"", "(taken for less than 1 month)", "November 17, 2017"]},
{"text": ["\"I had a nervous breakdown last year. Thought death was imminent and I would go to hell. My psychiatric CNP would not prescribe benzos. I was completely terrified, like a 2 month long panic attack. Went to the ER twice. They gave me ativan and I felt blissful relief.  Right back to the terror the next day.  I have a prescribing psychologist now who would give it to me if I needed it. But finally got prescribed clonazepam. It was okay but not nearly as good as the ativan. I used it for a while until the morbid dread subsided, had no rebound problems. Maybe if I took it for months on end I would. But nothing but benzos worked for me.\"", "(taken for 1 to 6 months)", "November 16, 2017"]},
{"text": ["\"Just wanted to share my experience with SSRI's not good ,so I was put on Remeron ,still never took the edge off still had a lot of anxiety and other problems associated with anxiety. I have taken Ativan off an on for about 10 years with no side effects when going off for periods of time.So I consider it one of the better medications to take to get relief from anxiety.So give it a try. Thank you\"", "November 13, 2017"]},
{"text": ["\"Miracle drug for short term use. You get withdrawal problems after u grow a dependence to it.  It will be dangerous like alcohol  if you stop cold turkey. You have got to tapper off but works really good if u use when u get anxiety\"", "November 4, 2017"]},
{"text": ["\"Makes me more anxious. Higher doses are worse.\"", "(taken for 10 years or more)", "October 26, 2017"]},
{"text": ["\"I started out being prescribed lorazapam for anxiety. Which works wonders for me. I also have chronic nausea with unknown cause and I noticed that when I feel really nauseated whether its from anxiety or some other reason it completly takes it away! It is truly a miracle medicine for me. Only down fall is it can be addictive and if I  take it daily on a consistent basis. I did notice when I don't take it I get shaky all through my body which is not a nice feeling at all and my head gets dizzy and just a weird feeling. I would definitely recommend lorazapam to anyone who suffers from anxiety, nervousness or nausea. It is wonderful!\"", "(taken for 2 to 5 years)", "October 10, 2017"]},
{"text": ["\"I have been taking Lorazepam 1mg as needed for about 6 months for Panic Disorder. It is the only thing I have found that helps me with minimal side effects. It is just frustrating dealing with doctors and psychiatrists who do not like the drug and want to keep experimenting on me with different drugs. I feel like my anxiety would calm down significantly if I was allowed to take this at a small dose every day, rather than only when I have panic attacks but for now I am following doctor's orders.\"", "(taken for 6 months to 1 year)", "September 30, 2017"]},
{"text": ["\"I been taking this medicine  0.5 Milligram it works perfectly fine no side effects it helps me calm down helps me to sleep  I was dying everyday before I started this medicine. I used to feel so stressed out this  lorazepam has given my life back.  As long as you don't take it stupidly. I'd rather take this medicine  and not feel like rubbish everyday. I don't care what other people say about this medicine this medicine has been great for me - that's it\"", "September 27, 2017"]},
{"text": ["\"Been on this medication for about a year now and I'm positive it works for me. I was diagnosed with MS and had a lot of anxiety and depression.  This drug helps me calm down and take a different approach to things.\"", "September 21, 2017"]},
{"text": ["\"That medication saved my life. I was having panic and anxiety. Ativan helps me to function normally. It a magic medication. All anxiety and panic disappear on it. I'm very thankful for that medication.\"", "(taken for 10 years or more)", "September 5, 2017"]},
{"text": ["\"For immediate relief this drug is great. I take 0.5mg when I absolutely need it (2-3x every couple months.) but only reason I wouldn't give it a 9 or 10 because I did have a bad experience with this drug. I took it for 7 days straight 3x .5mg per day as prescribed by my doctor for generalized anxiety disorder. I abruptly stopped taking it because I didn't want to have to take it everyday and I ended up going thru a withdraw. I then got vertigo for a couple months, which was absolutely terrible. BUT I think it you use this drug responsibly and do NOT take it multiple days in a row it can definitely come in handy. I also have high blood pressure caused by anxiety, and usually get effective relief after about 30 minutes. Hang in there!\"", "September 1, 2017"]},
{"text": ["\"It helps me to not only become calm but to stay that way and if I take it at night it helps me sleep better along with my Ambien.\"", "January 2, 2017"]},
{"text": ["\"I have bipolar, anxiety PTSD.\nI'm currently on and off new meds because of trial and error.\nLithium didn't work, valium didn't work, the only thing that's been working to keep the extreme anxiety down is the lorazapam. \nI only take it just hefore I go into work and its wonderful I can calmly power through my 10 hour shifts with ease\"", "(taken for 1 to 6 months)", "December 28, 2016"]},
{"text": ["\"I've been taking Cipralex 20mg in the morning and 15mg Remeron at night and would take from 0.5mg to 1mg of lorazapam in the morning as this is when my anxiety is worst. Since my anxiety was not improving, I decided to get off the Remeron to reduce the Seratonin. Remeron was great for helping me sleep but the withdrawal was awful. I decided to use lorazapam to help me sleep which worked well for a while. Without the Remeron my morning anxiety became better and I started to have better days. This only lasted about a week. Pretty soon I was having sleeping problems and the lorazapam didn't help my daily anxiety either and in fact at times I felt worse. This is the downfall of lorazapam. You build up a tolerance and have to increase the dose.\"", "December 28, 2016"]},
{"text": ["\"Elevated heart rate, sweating, chills, tingles/numbness and shortness of breath, blurred vision, chest pain, can't breathe... You name it I've felt it lol. I nearly overdosed on alcohol and cocaine when I was in high school. Made me realize I wasn't invincible and I have been an anxiety and panic sufferer ever since. Its only been about 13 years with the attacks but about 4 years ago I thought I was having a heart attack for the millionth time (hooked up to a machine and blood was all clear as always lol) and after the doctor prescribed Lorazepam and it has saved me many times. Including today lol. ONLY TAKE WHEN NEEDED. I HAVE AN ADDICTIVE PERSONALITY AND IT WOULD BE EASY TO USE THESE AS A CRUTCH. I only take one every couple days now.\"", "(taken for 2 to 5 years)", "December 25, 2016"]},
{"text": ["\"I have been dealing with anxiety now for bout 2 months. I'm worried that it will never go away. When I take the medication I feel so much better, however I'm am worried about being depended on the drug and withdrawal.\"", "December 9, 2016"]},
{"text": ["\"From (way) past experiences, lorazepam works better than diazepam (Valium) or alprazolam (Xanax) when comparing correctly converted dosages, administered for the same purposes of anxiolysis for clinically significant anxiety related to adjustment disorders, and potentization of concurrently administered fentanyl or other narcotic for outpatient procedures, whether of a  surgical nature, or diagnostic and imaging procedures for an individual who may have difficulty remaining still for extended periods of time, as in an MRI.  While midazolam (Versed) is the traditional benzo- favorite to be combined with fentanyl via IV, especially for the better retro- and anteriograde amnesia it usually provides, midazolam is difficult to obtain by pill.\"", "(taken for less than 1 month)", "December 5, 2016"]},
{"text": ["\"I have been experiencing periodic anxiety attacks ever since my house caught on fire, five years ago. Doc initially prescribed two Ativan a day, one in the morning and one at night. It worked great, but I didn't like the drowsy side effect in the morning. But, I will tell you, it is a life saver to quell off an attack that's in full gear or one that you feel coming on. As I write this, I just woke up in the middle of an attack and took 1 mg and am starting to come down after an hour. I only take them as needed now, so I don't build up a tolerance to the medication.\r\n\r\nI hope this was helpful to a few of you that suffer out there too.\"", "(taken for 5 to 10 years)", "November 28, 2016"]},
{"text": ["\"An excellent medication, out of all meds I tried none were as effective for managing my PTSD symptoms. Completely prevented flashbacks and nightmares and anxiety at night and allowed me to fall asleep very calmly. However I can't give it a 10 because I gained tolerance to the doses incredibly quickly, meaning I had to keep raising the dose to get the same effect, which is dangerous because it is a drug you can become physically addicted to. I would highly recommend this med to those seeking a short term fix while they are becoming stable on another long term med, but would not recommend it as a long term fix due to tolerance and addiction possibilities.\"", "(taken for 6 months to 1 year)", "November 28, 2016"]},
{"text": ["\"I took 2mg one night at the ER because I was having a panic attack and it worked quickly. But tonight I took 1mg before going to the mall on black friday because I knew it would be crowded and I'd get overwhelmed, so I took 1mg in advance before I went and it did nothing for me whatsoever. I left overwhelmed and very irritated after 15 minutes. I'm home now and feeling very irritated by the whole experience.\"", "(taken for less than 1 month)", "November 25, 2016"]},
{"text": ["\"So I've been dealing with anxiety for a while but never took anything for it until now. I've noticed that it has made me very tired, very drowsy, and dizzy. I like that I am not having anxiety attack but the side effects do concern me.\"", "November 9, 2016"]},
{"text": ["\"I am on lexapro since I was 16, so for the past basically five years I've struggled with anxiety. My doctor decided about three weeks ago to give me ativan as a \"break the glass kind of emergency\" immediate anxiety relief. I've only used it twice since then and I don't know how to describe this medicine other than quiet. It makes everything so quiet. and for someone with anxiety, its a miracle. I've learned what the on-set of an attack looks like, and by taking this medicine within thirty minutes I am calm, collected and have completely avoided what might have been a mental breakdown. Honestly, this drug is such a life saver. It does make you a little sleepy but nothing at all unbearable. I can take it any time of the day. its amazing.\"", "November 2, 2016"]},
{"text": ["\"Ativan is very good for anxiety. The trick is not to take it too often. I've found that I get used to dosages fast. I've also found that on the day following when I take it, I'm more tired, listless, and depressed. It's something to watch out for.\"", "(taken for 10 years or more)", "October 30, 2016"]},
{"text": ["\"I was honestly writing for the last 30 mins while having an attack and I had taken one of my pills and I'm now sitting here \"fine\" ... also the page got closed and deleted all that I had been writing but it was probably for the better because I was honestly crying my heart out ..\"", "October 17, 2016"]},
{"text": ["\"Was given ativan at first of several ER visits for panic attacks and later on shooting pains in my legs. I had recent surgery, felt something wasn't right. Told my doctors, tests showed nothing so ignored like most women and put on antidepressants. Soon after, panic attacks started. Ativan helped but did not address the cause. 2 months later finally diagnosed with B12 deficiency caused by pernicious anemia. By then had severe nerve damage. To this day I cannot walk and am extremely intolerant to heat and cold. At times my nerves act up and I take 0.5 mg ativan or less to get me through it or help me sleep. Doctor won't prescribe much so judicious when I take it. Gabapentin eases pain but Ativan is ONLY med that calms my nerves.\"", "January 9, 2016"]},
{"text": ["\"Was prescribed lorazapam for anxiety, terrible head pressure, jaw pressure, throat pressure.  Nothing had worked previously  I had tried everything  magnesium, warm compress on area, breathing exercises, Advil, ibuprofen.  The lorazepam was the best\"", "January 8, 2016"]},
{"text": ["\"I've been taking low dose Ativan for years.  It worked well for my anxiety.  Although it seems to wear off extremely fast.  I actually split the pill in two, take a half before bed, and take the other half when I wake up at night.  The only problem is after my old doctor retired, I found nobody would prescribe it.  All the newer doctors would rather give out anti-depressant.  I had to quit taking it cold turkey last month.  Now I'm on an anti-depressant and some strong sleeping pills in order to get enough sleep.  The results are inconsistent.  Some nights I get only 3 or 4 hours, some nights I sleep 10 hours and still feel tired.  I'm not sure if it's worth the trouble.  Ativan was so cheap that it didn't matter I don't have insurance.\"", "(taken for 2 to 5 years)", "January 7, 2016"]},
{"text": ["\"I was prescribed Ativan .5 mg and ended up having a horrible adverse reaction that landed me in the ER. I experienced 20  side effects from this medication.\"", "(taken for less than 1 month)", "January 3, 2016"]},
{"text": ["\"WITHDRAWAL HELL!\nI was prescribed this medication after extreme anxiety that was not getting better with citalopram.  I was only given 2 by GP (I AM IN THE UK) and then it worked so well on my anxiety I went back for more. They shouldn't have prescribed me 2 months worth because when I was told I wasn't allowed anymore my body went into meltdown. Over three weeks later I'm still suffering from the withdrawal symptoms. Severe anxiety, Insomnia, spaced out feeling, double vision, tremors, sweating, Auditory Hallucinations! Awful awful awful. It may seem great when it's helping you but when you stop be prepared to give up your life... This has been the worst time of my life hands down and I'm three weeks on and only marginally better.\"", "(taken for 1 to 6 months)", "January 2, 2016"]},
{"text": ["\"Hi, I have been experiencing  Anxiety,  and some depression  for 11 months now. My sister passed away last February,  and I have not been 100% since. I was actually  a lot worse but  I am now able to control it, somewhat..... But, the Over thinking, and the fear of Loosing it (going crazy is horrible!)\nMy Dr. Prescribed  Ataivan, about 6 months ago. I never took any. I'm terrified! I wanted to ask. Will it freak me out? Zone me out? I want all the details. .. I made a promise to myself that this year would be a New Year, A better one! That I would definitely  try my meds, even if it's only once..... Any info is appreciated.  Thanx!:)\"", "January 2, 2016"]},
{"text": ["\"I took lorazepam for 19 days at .5mg 1 as need I was taking them in the afternoon around 4:30. The doctor only gave me 20 pills for anxiety and sent me home. While taking them I was feeling even worse I couldn't sleep, I would wake up shaking and scared couldn't eat until I took the pill. I decided to stop taking them because I was getting more anxiety and wired thoughts, and was shaking all day. So I quit cold turkey - I didn't know I was to taper off .  On the second day of not taking it and I couldn't sleep, couldn't eat walking around feeling like I m going crazy a lot of anxiety attack and panic attacks. I don't feel joy or happiness. The only thing I could think of is I'm having withdrawals. I stop taking it on December 9, 2015 it is now December 29, 2015\"", "(taken for less than 1 month)", "December 29, 2015"]},
{"text": ["\"I have been on ativan for 15 years%u2026 started at 1mg and was gradually increased to 4mg. The medication only numbs things the anxiety never went away, and after I started taking I started getting other symptoms like OCD, social anxiety, depression and others \n\nI should never have trusted the Dr and should have researched the drug before taking. I will never again just take anything without researching it. I am slowly tapering it off, the withdrawals are a nightmare but staying on this medication which should be banned is not an option. This medication was never intended to be prescribed longer then a few weeks. Drs and drugstores are completely to blame right beside the drug companies. They all know it%u2019s poison.\"", "December 29, 2015"]},
{"text": ["\"Not really any thing happening just \nGiving me a headache\"", "December 23, 2015"]},
{"text": ["\"Calmed me down enough to talk to the Psychiatrist and Social Worker when I had been detained under section 136 but didn't feel it very much and wore off quite quickly. Not as good as Diazepam\"", "December 19, 2015"]},
{"text": ["\"This drug is highly addictive and due to it being short-acting, it is nearly impossible to wean off of this drug in a conventional manner. It is very effective in relieving anxiety, but should not be taken for any extended period of time or you will be hooked into an agonizing withdrawal. To get off of this short-acting drug without the painful withdrawal, switch to a long acting benzo like diazepam that is available in multiple and larger doses and can be cut into smaller amounts to wean off gradually.\"", "December 18, 2015"]},
{"text": ["\"My husband was hospitalized for 10 weeks before passing away. I could not sleep - my thoughts were spiraling and racing. I had an anxiety attack in the intensive care unit and thought I was having a heart attack. I hadn't slept in 5 days. My doctor prescribed 1 mg Ativan taken 30 mins before bedtime. What a godsend. I sleep straight for 6 hours every night. I've tried sleeping without it and I'm awake all night. I worry about tolerance. So I go without it on weekends and lay awake for two nights.  I can't wait til Sunday night so I can take the Ativan and get some sleep.   I've been on it for 6 months now.\"", "(taken for 6 months to 1 year)", "December 10, 2015"]},
{"text": ["\"Started taking 0.5 mg . My father passed away and I was having a tremendous trouble going about my daily life . Getting up, showering, cooking, cleaning, Constantly crying . This drug has helped me get my life back 100% calmed me down . I now feel relaxed and can go about my daily life .\"", "December 7, 2015"]},
{"text": ["\"About a week ago I experienced a somewhat traumatic event that kept me awake at night. I felt as soon as the sun went down my anxiety started to gradually rise until I had pain in my chest and was hypventilating. Nothing could calm me down or get me to sleep. I finally went to see my doctor and he gave me 10 days of Ativan. Last night was the first time I took one, or any benzo for that matter, and it was like a miracle worker. Within 10 minutes of taking one 0.5g sublingual tab it's like all the anxiety in me went out the window. I felt I still needed to control my thoughts to steer away from provoking an attack but it sincerely helped calm me down to a point where I felt safe and was able to sleep. Definitely recommend.\"", "October 14, 2016"]},
{"text": ["\"Lorazepam is a good medication in low doses for anxiety. Personally, if I took more than 1mg, I experienced dizziness, double vision, the exact side effects I have with Ambien, which I use for a completely different reason. However, it does calm you down. If I had to be specific, it slows down your thoughts. It doesn't get rid of them and put you in some euphoric state, but it helps significantly. Unfortunately this calmness for me came with side effects I'd expect from a sedative, even at low doses.\"", "(taken for 1 to 6 months)", "October 13, 2016"]},
{"text": ["\"I'm speaking from nearly 10 years suffering from severe generalized anxiety disorder and panic disorder. On a 1-10 scale, I'd say my anxiety is at a 12 on most days. My first panic attack brought me to the ER where I was introduced to the world of psychiatric meds, specifically, Ativan. What I will say to all of those who consider taking any benzodiazepines for their anxiety or panic attacks is that there is no benzo I would rather choose than Ativan. It provides not only relief from anxiety and panic attacks, but generally quells anxiety prone symptoms such as nausea, irritability etc., most effectively. I have never experienced much of a withdrawal effect, if at all, and the smaller half-life means less accumulation in your system.\"", "(taken for 5 to 10 years)", "October 4, 2016"]},
{"text": ["\"I have used this medicine for inner ear problems, dizziness, that causes anxiety  for 15 years 1.5 mg per day along with 100mg of Zoloft  with very little side efects. It has helped me live with stress and anxiety that I had with my ear problem. Yes the Doctors don't know why this helps with inner ear problem, but that is O.K. it works. I know that Doctors are concerned about abuse and that sure can happen to a addictive person. I have never used more than what has been prescribed to me.  This may some day come back to hurt me, but I am 72 now and it has significantly improved my quality of life. Any questions you want ask me. At rutoft64@gmail.com\"", "(taken for 10 years or more)", "September 28, 2016"]},
{"text": ["\"this medicine saves my life when I'm having a panic attack. wish I could take this every day but it's addictive and I'm told to only take as needed. I also have IBS and this makes everything go away. when I take this I never have IBS I can eat whatever I want no worries and sleep amazing!! I'm starting Paxil as my every day and this just as needed so we will see how that goes. lorazepam saved my life though\"", "September 27, 2016"]},
{"text": ["\"I had major issues with anxiety for last 5 years--My doctor put me on Lorazepam-1MG x 2 a day.\nI was having major fatigue, could not handle any stress, and was withdrawing in my career. I am\na nashville recording artist and for years on stage in concerts without any issues.  Anyway I am\nso much better now --pills give me peace of mind, sleep so much better, and back in action.---\nI highly recommend Lorazepam to anyone who is trying to deal day to day with anxiety and panic\nattacks. Life is tough and much more complicated than in the days past. My best to you\"", "September 16, 2016"]},
{"text": ["\"I have had a prescription for Ativan for about 6 years. This was given to me after a diagnosis of GAD that was taking over my life. I have tried many SSRIs, SNRIs, and several off label drugs, but none helped. Most actually seemed to make my condition worse. I would take 0.5 - 1mg of Ativan on occasions when I felt out of control, and it would bring me relief. I have taken 0.5 - 1 mg in a day only as perscribed. Sometimes I have taken it daily for three months at this dosage. I was always terrified about the withdrawals you read so much about if you stop taking this, but I am perhaps one of the lucky ones who, at this dosage, can simply stop with no bad effects. I regularly stop for months at a time.\"", "(taken for 5 to 10 years)", "September 11, 2016"]},
{"text": ["\"Please, as a human being to others, DO NOT ABRUPTLY STOP TAKING THIS MEDICATION! Only after one month on this medication, I quit it and went through living HELL on earth! This is a very serious medication. God Bless.\"", "(taken for 1 to 6 months)", "September 10, 2016"]},
{"text": ["\"I've got severe anxiety and panic attacks. I've been using lorazepam/avitan for a couple years now to help stop my panic attacks. I can always count on it to work. Last night my anxiety was through the roof. My mind wouldn't stop racing, my chest hurt, and it felt like I was being stabbed in the gut repeatedly. I want to cry but I knew if I did I would for sure have an attack and wasn't sure if I could cope right since I was home alone. I keep a vial of my prescription on my keys and took one tablet. In about half an hour I no longer felt like I was dying and was able to get some rest a little after that. I think if I didn't have this med I would have ended up at the hospital last night.\"", "August 23, 2016"]},
{"text": ["\"I was super against taking medication. I've started dealing with anxiety (some depression) for awhile now. I got prescribed Ativan months ago, and never took it. I thought I could handle myself again but then my relationship started to fail because of my over thinking. I went back to the doctor, and decided to try it. She prescribed me .50 3 times a day. I took a full one at night after a bad panic attack, and within 30 minutes I was calm and slept through the entire night. I have only been taking a half morning and mid afternoon and full at night because it does make you feel tired. My brain is in a slight fog, but nothing crazy, I still know whats going on though :) Give it a try if you are suffering. You will know after 1.\"", "August 16, 2016"]},
{"text": ["\"Before I explain, let me start off by saying; I do not take meds, not even for a headache.. this is a very rare circumstance. My Dr knows this and will ask me if I'm going to fill the prescription as to not waste either of our time. I usually say no and we discuss non medicinal ways to cope. \r\nThis time I said yes and got .5mg lorazepam and in the 3 days I've taken them I'm more anxious!\"", "(taken for less than 1 month)", "August 15, 2016"]},
{"text": ["\"The withdrawal of this medicine was very close to my image of hell. It was awful and lasted one whole month. \r\n\r\nAwful. Sweats. Insomnia. Shakes. Hallucinations. Panic. Spaced out. Pain. Depression\r\n\r\nNot worth it at all. So sad humans have to experience such pain\"", "(taken for 1 to 6 months)", "August 11, 2016"]},
{"text": ["\"I’ve been taking .05 Ativan for 15 years . It’s a miracle drug for me . It keeps my mind more stable and calm . Keeps my anxiety under control as well . I sleep like a baby with this drug. I wake up refreshed every morning . I usually take one 0.5 after dinner every night . There are days I do fine without it, but I love knowing it’s in hands reach at all times . I highly recommend Ativan . Keep it a small dose and you will be fine .\"", "July 10, 2018"]},
{"text": ["\"Name brand and generic Mylan\nwork identically and are interchangeable for me. Some of the other generics do not seem to have full potency and is likely due to the fillers.  This is a problem with a lot of generics.\"", "(taken for 10 years or more)", "July 5, 2018"]},
{"text": ["\"I used this after my anxiety got so bad that I constant horrible, racing thoughts. Many involving suicide and death. The first time I took it I felt like I grew wings, so relaxing. I started taking it every day because the calming effect was so comforting. I then started taking it at night - big mistake for me personally. I became addicted. If I didn’t take it for one night, I was awake for the entire night and became extremely paranoid. Had to see a Dr and admit to addiction, then was given very slow tapering off plan. Also made my hair fall out. Use with caution. Easily addictive.\"", "June 25, 2018"]},
{"text": ["\"Lorazepam has helped me a lot compared to other meds with my anxiety, only reaction I’ve had to it was a very very dry mouth and slight drowsiness.\"", "(taken for less than 1 month)", "June 20, 2018"]},
{"text": ["\"I took half of  a ativan because I was nervous about taking it (I don't like taking pills, even advil). My boyfriend is in the hospital so I've had constant anxiety for 4 days. It felt like my heart was gonna come out my chest. I'm sure it'll continue till he's home. I felt my heart rate calm down within like 20 minutes. I feel a little better, still have sweaty hands and stuff but hey it's a start, can't expect to be cured on half a pill. \"", "(taken for less than 1 month)", "June 7, 2018"]},
{"text": ["\"I’ve been on 0.50mg Ativan for anxiety and insomnia for 10 plus years . It really calms me down and takes the edge off. I sleep through the night and wake up refreshed.  I can’t imagine not having it on hand. There are weeks I go without it , but it’s nice to have it at hands reach .  I recommend Ativan.\"", "May 31, 2018"]},
{"text": ["\"I take lorazepam for anxiety and insomnia/disrupted sleep. When I take it for panic attacks, I feel like they are far more manageable, although sometimes not all of my anxiety symptoms remit after taking it. Lorazepam is also very helpful for sleep.  Usually I have trouble falling asleep and wake up often, and I often have vivid nightmares. When I take ativan, I fall asleep much more quickly and I tend to stay asleep. dditionally, it is usually pretty much dreamless.\"", "(taken for 1 to 6 months)", "May 30, 2018"]},
{"text": ["\"Have had depression and anxiety for most of my 65 years.  I have been treated for depression and am now on bupropion 300mg/daily.  It does not help with my anxiety which includes muscle stiffness and all over pain.  After my husband died and left a bottle of Ativan, a script he had been on for years, I started taking 1mg in the morning and at night.  I was amazed at the relief I received.  I've used Ativan many times in the past but no doctor will give it to me on a long term basis sighting addiction.  My husband took it daily for years.  Why am I not able to get a long term prescription? Ativan is a lifesaver for me, eliminates the muscle stiffness and pain and gives me energy. Doctors need to understand that patients know what helps their issues and allow them the medication needed in order to have quality of life, which I don't have right now.\"", "(taken for less than 1 month)", "May 28, 2018"]},
{"text": ["\"I have been on and off lorazepam for 7 years now.  I will not take any other benzo.  I have GAD, and need help now and again.  Years ago I took it every day.  I was off for the last 2 years and controlling my GAD with diet, exercise, and meditation.  A car accident a few weeks ago brought the anxiety beast back with a vengeance. I got a low dose, 0.5.  \nNow I remember why I choose this medication over all other.  I do not feel sleepy, drugged, out if control, nausea or dizzy.  For me it a magic little pill of calm and clear thinking.  \nAll the other benzos make me sleepy, sick, or I feel hung over afterwards.  Not with lorazepam, this is just calm and steady.  I can completely function once the panic monster has been appeased.  \nI hope to not need them long term, as I would like to be controlled on my own once again, but until then, I will take it to help with the rough edges.\"", "May 23, 2018"]},
{"text": ["\"Have suffered with GAD for years with physical Anxiety.  Tried everything  the Dr got me to try  2.5 mg as and when required. Job done now I'm  back in the land of the living. \n\n\n\n\"", "(taken for less than 1 month)", "May 8, 2018"]},
{"text": ["\"Helps with calming for panic attacks. Very fast and effective. Only side effect for me was drowsiness.\"", "(taken for less than 1 month)", "May 7, 2018"]},
{"text": ["\"I took a 0.5 Ativan for anxiety last night. It increased my anxiety and I couldn't sleep.\"", "(taken for less than 1 month)", "April 30, 2018"]},
{"text": ["\"Highly addictive medicine. Very angry I was put on this. I have worse anxiety and hand, feet, and head tremors. Docs give out benzos too easily. Then they do not want to help you get off them. It is awful. They treat you like a pill seeker instead of slowly weaning you off. More doctors need to use the Ashton Method of withdrawal. Taking someone off benzos too quickly can induce anger, crying spells, depression, and even seizures. Too many doctors do not want to help patients get off these pills and it is wrong.\"", "December 5, 2015"]},
{"text": ["\"This drug is great, it saved me from my job and help me become more successful. There was a point It was so bad I could not even be in a work meeting with out having serious anxiety. I also had problems going anywhere. It was really affecting my work and my behavior with my family. Once I started talking it, I felt no stress, and I was able to be normal again and function. Now that I have been on it for 2 years, I only need it 1-2 times a week. When I was having anxiety really bad I had to take it 4-5 times a week. So the longer I have been on it the more I was able to tapper off and feel normal again. I highly recommend it if you have serious anxiety and feel stress all the time.\"", "December 1, 2015"]},
{"text": ["\"This stuff is amazing and has been a godsend for my anxiety and panic. Don't pass this one and give it try it's great.\"", "November 30, 2015"]},
{"text": ["\"This medication is amazing if used as designed. For years I have suffered with gripping panic attacks that turned into seizures if they were real bad.  I got to the point that I couldn't ride in a car with someone. It was bleak. I'm a young guy and avoided going out with people even girls. Lorazepam paired with (more importantly) CBT. Has turned me about 80% back to \"normal\" use it as needed. Do not rely on it. Was going though 30 a month, now it's 30 a year. Be responsible and talk to someone. Medication is a way out, not a crutch to use forever. Cognitive behavioral therapy is where you make real strides!! Sorry to get preachy but I dislike drug \"abuse\"\"", "(taken for 1 to 2 years)", "November 21, 2015"]},
{"text": ["\"I had a positive  experience , was effective\"", "(taken for less than 1 month)", "November 20, 2015"]},
{"text": ["\"Highly addictive, caused Severe panic attacks, when tried to go off. Got this reaction after only 2 days, of 1-2, for sleep.\r\n     Very dangerous drug. Helps you sleep, but  nearly impossible to stop! Most need rehab., was one of the meds., Heath Ledger had, in his system. Tammy Faye took up to 25-30 a day! \r\n     Stay away from this drug!!?\"", "November 6, 2015"]},
{"text": ["\"I took .5mg ativan 2 times a day for 14 days.  I noticed I wasn't getting the same anti anxiety effect so I decided to stop taking it.  I figured it had only been 2 weeks so stopping should not have been a problem.  I then proceeded into 11 days of HELL.  The first 2 days were not to bad  but every day progressively got worse.  The Insomnia was the worst.  I got to the point where I would dread the night.  And then the night mares started.  They were horribly dark. I thought I was going to die.  I finally would take .5mg every other or every third night just to get some sleep.  It took me months to find a doctor who understood how to get off the Ativan.  I'm now on a 2 1/2% taper (40 weeks) I'm on week 9, Not fun.  DO NOT TAKE IT\"", "(taken for less than 1 month)", "November 4, 2015"]},
{"text": ["\"I am 36 and have suffered from occasional anxiety attacks since my early 20s. I get severe hot/cold sweats, tingling limbs, severe nausea/vomiting, feeling like I might crap myself, heart palpitations.  The symptoms come in increasingly bigger waves often for 6-8hrs. \r\nSomeone finally told me about lorazepam.  I was a bit afraid to take a chemical but this time, when I was sure an attack was coming I decided to take it right away. Because of the lorazepam the attack didn't get worse.  It slowly faded till I was able to sleep it off. This is a huge difference from the hours of horrible physical symptoms I experienced in the past.  I hope that me sharing this helps you.\"", "November 2, 2015"]},
{"text": ["\"I started taking Lorazepam in November of last year when my dad was ill and dying.  It took the edge of the stress and allowed me to care for him and remain calm. I was taking 2  a day for about a month. Dad passed away in December. I have had anxiety issues most of my life, so I probably should have started this drug a long time ago. I now take 1 or 2 a week after a stressful day at work.\"", "(taken for 6 months to 1 year)", "October 17, 2015"]},
{"text": ["\"Works great for anxiety. Never had any problems with it %u263A\"", "(taken for 1 to 2 years)", "October 14, 2015"]},
{"text": ["\"I am 25 years old and for the first time in my life I had a severe panic attack so bad that I lost all feelings in my limbs, my breathing was so fast that my lips curled over my teeth and my hands were temporarily and uncontrollably clenched. My husband rushed me to the ER thinking I was having a heart attack and there my pulse was 180 and my BP 170/100. I have never experienced anything so fearful and horrific physically. There they gave me ativan which completely calmed me down. Ever since I am prescribed Lorazepam .5 mg as a PRN and when I feel anxious or agitated and it really amping up I will not even hesitate to take one. I truly believe this drug has helped me get through my days and has 100% worked as a preventative for attacks.\"", "October 12, 2015"]},
{"text": ["\"I love them. .5 mg when I'm shaking (getting over a fear of heights) that I got due to a sickness. Tried all others none worked  & they had bad side affects. Take it at work and drive fine, work fine. Makes me not care about heights, bills, stresses in life, just a very good pill. Just watch out have been caught twice looking at a wall for hours smiling not knowing it was that long just content and happy...\"", "October 9, 2015"]},
{"text": ["\"This pill has been my safety net for my severe  anxiety attacks, panic attacks and ADHD. I have been taking this pill off and on for 6 years and have never been addicted to it. I take 0.5 during the day and it actually makes me feel like myself and sometimes even gives me more energy this pill has been a true life saver\"", "(taken for 5 to 10 years)", "April 21, 2018"]},
{"text": ["\"This med was prescribed to me last year after my anxiety (& BPD) got really bad after steroid knee injections. At that time, I'd only needed 4-5 doses but was prescribed enough for 30, so I saved the rest for \"emergency\" situations (times like now). It seems to be helpful for the chronic anxiety & chronic insomnia I've been experiencing related to my various chronic pain conditions. Some negative things I've noticed with it are it makes my brain/pain fog worse, it increases/worsens some BPD symptoms & it makes my fibromyalgia & osteoarthritis knee pain worse. Otherwise, it's a pretty good medication.\"", "(taken for less than 1 month)", "April 14, 2018"]},
{"text": ["\"I take it Lorazepam one hour before flying or if I'm scheduled for a long dental appointment. \n\nI break the pill into small pieces - so a little works very well to relax me. \n\nBefore this, I had horrible situational anxiety (panic attacks) on planes and at the dentist.\"", "(taken for 5 to 10 years)", "April 14, 2018"]},
{"text": ["\"I recently developed panic attacks and anxiety , just thinking about anxiety makes you anxious.. at least for me. I was just prescribed 0.5 Ativan and 10 mg Lexapro for anxiety. I hope it works..I used to be on celexa but never really did much for me tbh. I'm hoping the withdrawals aren't bad.\"", "April 11, 2018"]},
{"text": ["\"Works well in reducing severe chronic anxiety. When you start treatment, request a system where you can skip the med at least 1-2 days a week. Intermittent dosing allows you to keep track of the underlying anxiety condition,  and improves long-term efficacy. If you take the med without a break for years you can forget how unbearable chronic anxiety actually is, with intermittent dosing the benefits and drawbacks of being medicated vs unmedicated are very clear.\"", "(taken for 2 to 5 years)", "March 31, 2018"]},
{"text": ["\"I've been suffering from anxiety and panic attacks since escaping from an abusive marriage.. That created trauma, always being anxious.  Also the loss of loved ones in one year and the news I can't bare children. I had a breakdown. After treatment I started working again but my anxiety was constant. I was prescribed lorazepam and only take it when I have a very hectic day with my work. When I don't take it my anxiety gets so bad my entire body goes into a spasm.  I do long walks and creative crafts and gardening. Then I'm fine but in stressful situations I struggle so much. So it's helped me loads and enhanced the quality of my life.  I am taking heed of all precautions. Thank you\"", "March 25, 2018"]},
{"text": ["\"This particular med has helped me greatly through the death of my mom and other losses that came after. I took it at 0.5mg daily and now down to a quarter of that, as I break the pill in fours. The only con is slight blurred vision as well as slight memory loss, but that is a small price to pay for relieving what could have been. Bad anxiety. I am looking to be back to the \"as needed\" basis which hopefully will be rare.\"", "(taken for 6 months to 1 year)", "March 22, 2018"]},
{"text": ["\"I was in a traumatic car accident. I ended up with severe anxiety. I ended getting panic attacks also. Thought I was going to die. Never took any anxiety pills before this accident. Now I'm taking Lorazepam - Ativan this works great for me. Oh my goodness! I'm reading the reviews. Everyone is different. Some works for some and some won't. It's a 50/50 chance like any drug. It depends on the severity of your diagnosis and how well your body can adapt to it. All depends. I can tell you this. It works for me. For now. My mom took it for 15 yrs. She's 64yrs old. It works great for her. Anyone taking this should walk, exercise or so a hobby you like. Sauna always helps. Anything relaxing helps. It decreases your anxiety and remember counselling or going to a support group helps. \"", "(taken for less than 1 month)", "March 18, 2018"]},
{"text": ["\"I would not survive without being able to take this drug.\"", "(taken for 6 months to 1 year)", "March 17, 2018"]},
{"text": ["\"I've been taking lorazepam off and on for about 10 years.  My former PCP prescribed it because I have panic attacks when I fly, and I was going to be flying from the US to Australia.  It worked wonders.  As I was subsequently diagnosed with an anxiety disorder, I've been consistently re-prescribed this medication.  Fortunately for me, I don't have the anxiety attacks I once did, so I don't take this nearly as often as I used to (once a week, maybe?), and I never took it often enough to get addicted, but I can certainly see how easy it would be to get hooked.  Still, it's truly helped me when I needed it most, and still does when the nerves, nausea, and lightheadedness creep in.  \n\nI've tried Xanax, and it didn't work nearly as well.  Correction: I tried Xanax, and it only worked for about half an hour.  Also, it did nothing to ease the nausea my anxiety brings about, but it works for my two closest friends, where Ativan doesn't.  Guess it all depends on your chemical makeup.\"", "March 9, 2018"]},
{"text": ["\"Prescribed by G.P. for anxiety 4mg. A day approximately 10 years ago, along with Zopiclone for 15 mg. for insomnia.  I started to abuse both about 2 years ago.  Sitting in a Treatment Centre for Drug Addicts, while I type this.  Do not take Ativan or Zopiclone, easy to become addicted to both.  Went through Hell detoxing and it took 19 days to get off the Ativan.  There are better medications out there for you.\"", "(taken for 5 to 10 years)", "March 9, 2018"]},
{"text": ["\"Have taken ativan on and off ..more on than off for 24 years.  I have quit it for life and having terrible withdrawal symptoms.  Hot, cold, blurred vision memory loss. Please do take this medication.\"", "(taken for 10 years or more)", "February 27, 2018"]},
{"text": ["\"I was prescribed ativan I mg every 4 to 6 hours approximately 6 years ago. This was given to me by my primary care physician as I was randomly shaking and feeling sick without provocation. I am so confused by this drug. You see the withdrawals are the same as the symptoms it was prescribed for. I fear I am addicted to it. I work everyday and am a functional person, could I be addicted to this med? I try to wean off but it doesn't work. I feel dizzy sick and shaky every time I try. This is an awful feeling. I wish I never needed it.\"", "(taken for 5 to 10 years)", "February 24, 2018"]},
{"text": ["\"Excellent medicine, I take it only as needed but beware, for me at least, massive and rapid weight gain has occurred on it, I was a consistent 130 pounds for the last 3 years, within a month of starting it I've gained 25 pounds. Which for me is great, I needed the weight gain, for others though, take caution in this. For me this drug has been phenomenal and I can take it once and feel good for days.\"", "(taken for less than 1 month)", "April 18, 2017"]},
{"text": ["\"I am told I am a reasonably intelligent 64 yo. In all honesty my Mother is probably a little biased.  \nI have suffered and I do mean suffered severe bouts of anxiety and debilitating depression for over 50 years. As you might Imagine I have seen everybody, tried every remedy under God's sun. \n\nDrug companies in this and most other countries are motivated by one thing ONLY. Greed/MONEY and getting more. If someone can be helped as a side effect along the way, it makes great press but it sure isn't essential. \n\nI found a Loooooong time ago that I had to do the research into my own personal condition, that I had to in essence, become my own Doctor.\"", "April 15, 2017"]},
{"text": ["\"This does work for anxiety and seems generally safe and with little side effects. I personally do not like the long term effects of the drug and wish it was more of a 30 min to 3 hour effect. But this is great. My first choice would be Xanax, this a great second.\n\nThere is some short term memory blanks, and more difficultly in concentration at times, also a slight sleepy feeling.\n\nI do not feel any addiction aspects to this drug. I can take it, or leave it. I noticed when I do have anxiety, and take it, this helps the episode resolve sooner.\n\nIf I have anxiety and don't take it, I get through it longer, and may have other problems associated with the stress on my body.\n\nI see no need to take this for recreational reasons, it is not fun?\"", "(taken for less than 1 month)", "April 9, 2017"]},
{"text": ["\"I've been taking Lorazapam for many years but usually not more than once a week for really bad anxiety. The problem is it's addictive and you want and need to take more to get the relief you were getting before. So the more you take, the higher the tolerance and you need to keep going up and taking it more often. Another problem is the half life for Lorazapam is between 4 and 8 hours. This means you should really take it 3 times per day. If you don't you start getting reflex anxiety. After the dosage wears out your anxiety goes up. This was what I experienced and I went through the worst time in my 17 years. 8 weeks ago I stopped taking Lorazapam and switched to Diazapam to taper off. I suggest staying off this drug.\"", "April 4, 2017"]},
{"text": ["\"This drug is the devil. The first few doses work like magic. After 1 week a hellish withdrawal starts kicking in about 2 hours after taking each dose. Impossible to ween off of without a doctor who's familiar with this highly addictive drug.\"", "(taken for 1 to 6 months)", "March 24, 2017"]},
{"text": ["\"This medication works at reducing anxiety, and the only negative effect is slight drowsiness. I just take 0.25 mg at a time so I'm not too drowsy. I'm getting a little annoyed at how hard it can be to get it from doctors seeing as it works for me.\"", "March 21, 2017"]},
{"text": ["\"Sitting here shaking in my boots this stuff is weak 1mg 3 times a day\"", "March 18, 2017"]},
{"text": ["\"I take lorazepam for social anxiety. It seems to help. I feel more relaxed and talkative when I take it.  It also helps me with severe depression.\"", "(taken for 1 to 2 years)", "March 14, 2017"]},
{"text": ["\"I have taken many anxiety and anti-depressants medications in the last 25 years. I have taken Lorazepam for last 13 years when needed , but for the last 2 years my dosage was increased from 1mg a day to 3mg  a day every 8 hours , due to 7 close family members and 4 friends passing away. This is when the trouble started it did not work anymore , Doctor suggested I try clonazepam this lasted about three days , thought I was dying. His next step was to wean me off Lorazepam with Diazepam , I told him that I would not use a benzo to come off a benzo , then tells me too take 1mg a day for 30 days , realized he did not know what he was talking about or what to do. Then I went to my Pharmacy and asked her how do I taper off safely . Thanks to her we now have a plan\"", "(taken for 10 years or more)", "March 6, 2017"]},
{"text": ["\"IF you use this drug JUDICIOUSLY, it can a God send.  I take 1 mg 3 to 4 times a week, never passing 5 (and rarely hitting 5).  99% of the time I take it right at bedtime to get a bomb sleep.  The next day, the world is beautiful.  I am lucky; I can feel the drug working for 13 hours every time.  And when it wears off, I still feel superb.  I am a better person with this inexpensive medication in my life!\n\nI have been taking ativan for 10 years.  The routine above has been consistently done for 3 years.  Consider a low dose SSRI; I have been taking 10 mg of Cipralex/Lexapro for 18 months.  I wish I had this figured out years ago!  Good Luck.\"", "March 5, 2017"]},
{"text": ["\"Very effective but coming off is not fun. I wouldn't take it unless you have to I have severe anxiety and mild OCD and I'm choosing just not to take it. Side effects are real with this medicine. You'll be calm but at a price.\"", "March 1, 2017"]},
{"text": ["\"I know that many, including myself are not in favour of the pharmaceutical industry yet, when this drug literally saves your life, i.e. prevents suicidal ideation, can you really hate the industry, then? Think about that.\"", "February 27, 2017"]},
{"text": ["\"So I have anxiety all of the time. But it's not the textbook rocking and shaking anxiety...it's the negative and obsessive thoughts-that something horrible will come if every situation.  \nI have an as needed Rx for lorazepam and honestly I don't know if I like it. I feel like it makes me groggy enough but never takes the anxiety away. It almost feels like I hover over it but it's still underlying.\"", "February 26, 2017"]},
{"text": ["\"I have anxiety and sleeping problems. I like Xanax a little better I think.  But Ativan still helps. Not from me because I haven't tried it yet but I heard if you like Xanax you have to double up on the Ativan from Xanax from 1mg to 2 and it would feel the same. That Ativan is weaker but has a longer shelf life. Regardless I would recommend this med out if you have sleeping problems or anxiety. There's usually a hard time for me to find a medium for me. I'm either too happy or to sad. Ativan n other benzo's give me that.\"", "February 25, 2017"]},
{"text": ["\"This drug does help with anxiety. But this drugs attack on your mind and your soul when you suddenly quit this med is hell!!! I advise everyone to stay away from benzos. They will rob you of your life and your sanity. I have recently stumble across a amino acid that works better than a .5mg of lorazepam. It has no side effects and is actually good for you!!! Its called L theanine. This is a amazing natural supplement for anxiety and phobias. Its 100% safe and it works better for me than lorazepam. I take 400 mg a day. 200mg in the morning and 200mg with a 3mg melatonin at night for restful sleep. I stopped benzos after being on them for 2 years for horrible panic and anxiety 5 days ago. I started this regimen 2 days ago and it killed the withdrawals.\"", "February 25, 2017"]},
{"text": ["\"Hands down, the best immediate solution for anxiety or panic attacks. I prefer Ativan to other benzos and it usually lifts my depression too, even suicidal thoughts ( well for the few hours that it works). Just be very careful not to become addicted but this is extremely helpful as an occasional tool in stressful situations. DO not take every day for many days unless instructed so, but even then do your research.\"", "(taken for 5 to 10 years)", "February 19, 2017"]},
{"text": ["\"I've been struggling with depression but mostly anxiety for 16 years. I take an antidepressant and last year I tried to change it three times.  During this time I began to use Lorazapam daily and began to increase it when it wasn't working for me. Needless to say this was the worst year ever.  My anxiety symptoms were hell. After reading about Lorazapam and the problems with tolerance, rebound anxiety, looping and withdrawal, I realized my problem was not the antidepressants but Lorazapam. If you take it once a month or several times per year it could help and shouldn't hurt you, but if you take it every day, you are asking for trouble. my recommendation is avoid Lorazapam at all costs.\"", "(taken for 1 to 6 months)", "February 14, 2017"]},
{"text": ["\"hi this is very good medicines for anxiety treatment , you can use it for when your suffer depression and anxiety. I have also take this for last 2 months before.\"", "February 7, 2017"]},
{"text": ["\"I have had anxiety all my life,  only after loosing my mom  I realize she had it before it was named. I have used anti depressant then learned meditation and exercise techniques and become med free. Now at 65 the monster is back, 0.5 Lorazepam twice a week is great. But if I go back to work more a week might be needed. We will see.\"", "(taken for 1 to 6 months)", "February 7, 2017"]},
{"text": ["\"I've had extremely bad anxiety, panic attacks, and mood swings. This medicine is wonderful. It's not very strong but it takes the edge off. I'd recommended to anyone with anxiety.\"", "January 20, 2017"]},
{"text": ["\"Hi All\n\nIm a young man 24 years old, I have several issues with my brain since many years ago.... I have a Major Depression, GAD, SAD, OCD, and Panic Disorder.\n\nI've been tried many option, i tried Hypnotherapy, Emotional Therapy, CBT , also I been to some psychiatrist in Indonesia and Singapore.\n\nFinally I met the best psychiatrist in my country, and with him I found best med and finally cure my problem. You all have to try this too and talk to your psychiatrist to ask for prescription.\n\nEvery Morning I take 1mg Ativan\nand\nEvery Night I take 5mg Zyprexa and 150mg Zoloft\n\nPlease try this, please.. Enjoy your life..\nAlso CBT is good as well...\"", "(taken for 1 to 6 months)", "January 18, 2017"]},
{"text": ["\"I have a \"emergencies only\" prescription for 1mg of lorazapam, so I don't take it every day. I average about two doses a month. But even at that low level of usage, lorazapam has changed my life! I no longer have to suffer through lengthy bouts of my heart pounding and being nearly frozen from anxiety. I keep some with me wherever I go, and even if I don't need to take it, it's very comforting to know it's there if I do. It may have even saved my life on a number of occasions. I am so grateful that a doctor suggested trying lorazapam.\"", "January 18, 2017"]},
{"text": ["\"This is my first time taking Ativan. I just started having panic attacks about 2 weeks ago. The Dr. prescribed 1mg. The directions says to take one twice a day, but I'm on gonna take it as needed. The reason being is because lots of reviews from others said it could become addictive. So far it has worked very fine. I only have the attacks at night. When my boyfriend is away for work out of town I tend to worry a lot about taking care of the kids n staying home alone with them by myself. When he's around I feel safe and I sleep like a charm. I hope this will only be temporary. Ativan works fast!!! Definitely a life saver.\"", "January 18, 2017"]},
{"text": ["\"I've  been on/off benzodiazapines for about 20 years.  I am now back on ativan 1mg 3 times a day for anxiety/panic attacks and insomnia.  I know I need an increase in dose soon, as it no longer relaxes me as much as it used to.  I find ativan to be the best benzo.  I've tried xanax, (which made me sleepwalk), valium, (which doesn't affect me really).  I think I will stick to ativan and after 20 minutes, I feel a lot better.  relaxed.\"", "January 4, 2017"]},
{"text": ["\"I take Lorazepam 1mg for anxiety. It really helps. My symptoms are heart racing, rescuing thoughts, sharing, hard to breathe, and the worst is heat flashes because I turn red and it makes me more embarrassed.. The only concern I have is when I take it consistently is good. But, I ran out a couple times. It's usually 2 or 3 days before I fill it. I noticed during those days I have more anxiety than I did before I ever started taking it. I would only get heat flashes one a week or so before I started this medication. The days I missed it I had an average 2-3 a day. I don't want this medication to make me worse.. Also, I feel like my memory and focus have decreased. I'm thinking of switching. Just sucks because I really like it otherwise.\"", "(taken for 1 to 2 years)", "January 3, 2017"]},
{"text": ["\"I started off at .50 mg then to 1mg before bed.  I had many issues going on in life and I was having trouble falling asleep.  This helped in the beginning, but my dose is going up and up. I admit, I take this more than I should, so I understand there's an addictive nature to this.  Just be careful, and talk to your doctor if you notice that.  The best part of this drug; I get a good night sleep and I'm not waking up 3x a night.\"", "August 1, 2016"]},
{"text": ["\"When I took it for the first two weeks it was a miracle worker. I would feel better within 45 minutes but I seem to grow use to it because although it still clams me down it doesn't completely relax me. I take one milligram as needed. I definitely keep it on me at all times.\"", "(taken for less than 1 month)", "July 17, 2016"]},
{"text": ["\"If you're using this drug for anxiety make sure you read up on it before you use it for more then an occasional anxiety-fix.  Even at the minimal dosage, using this stuff daily for even a week will cause problems.  Namely - it CAUSES anxiety.  From what I've read this is a dependence that develops - either (or both) physical or mental. After only a few times you get accustomed to it \"fixing\" your situation.  Your body adjusts for the GABA boost, and then \"crashes\" - resulting in anxiety.  Very bad loop to get in.  Warning signs: you're counting the # hours the med will still be working (about 6 total), you're watching the clock for when you might be able to take another pill, you always carry a pill in your pocket, etc. Those are bad signs.\"", "July 15, 2016"]},
{"text": ["\"I had hyperthyroidism which was diagnosed when I was 37 . The hyperthyroidism gave me anxiety specially after knowing I had it. Would go to the ER thinking I was having a heart attack or stroke and was checked always and nothing was wrong. My anxiety attacks were so bad I once was taken in an ambulance with my feet and hands numb and blood pressure through the roof. Was given by a doctor in the ER 1 mg of lorazepam and felt the difference within 20 minutes.My thyroid got burned of and I take 1 mg in the morning and really can get through the day with no issues. Take sometimes .5 mg at night as I don't have sleep issues. After almost 2 years I feel like lorazepam has almost gotten me stable and going to start tapering off.Its a life saver.\"", "July 15, 2016"]},
{"text": ["\"Good\"", "July 9, 2016"]},
{"text": ["\"Hey Everyone, I take 2mg of Ativan a day. 1 mg in the morning and 1 mg at night before bed. I have been diagnosed with Severe Panic Attack and Depression. Lorazepam (Generic brand for Ativan) does help me. Understand that the effects for any medication is going to vary person to person. I don't get sleepy in the morning when I take it, but it does help me get a good night's sleep at night when I'm tired. \r\n\r\nAlso, I do want to say: Recently, my pharmacy didn't give me the exact amount of pills of Ativan, so I have been off of it \"cold turkey\" because I ran out and the withdrawal symptoms can be a hellish.\r\n\r\nNote: Anybody can be dependent on any medication/drug. Talk to your Psychiatrist. REMEMBER...everyone responds to medication differently.\"", "July 8, 2016"]},
{"text": ["\"My wife had a heart attack, at the hospital, she went into arithmia and flat lined in front of me, they saved her but it took chest compressions and being shocked with paddles. Before this happened I never had a anxiety attack in my life, but not even a week later I ended up going to the ER  thinking I was having a heart attack, it was a anxiety attack,  they gave me lorenzapam 1mg, but I wouldn't take them, attacks came and went for the next 2 weeks, then I was sure I was having a heart attack one day, after thoroughly checking me out at ER again, it was another anxiety attack. They gave me a lorenzapam 1 mg,  with in 10 min symptoms severely reduced, after an hour, gone. I now take only if needed, they definitely work for me.\"", "July 7, 2016"]},
{"text": ["\"I recently experienced a week of panic attacks. The first 3 times I took a pill...they were .5, it worked and I could calm down. After that the small dose did not work and I landed in the ER. I take nothing else and haven't taken any other benzo in years. I'd like to give it a lower rating due to the fact that dependency happens so fast if you aren't careful and can't cope other ways. They are definitely a bandaid. They do work though to stop panic . Just be careful and only take as necessary. Side effect..calm and sleepy..in a daze. Took an hour for them to kick in also.\"", "(taken for less than 1 month)", "July 6, 2016"]},
{"text": ["\"I have severe flight anxiety and was prescribed Ativan 5-10 years ago to take before flights.  It works really well, and gives me this deep feeling of calm that helps me not panic on planes.  I used to shake for an entire eight hour flight, and while my anxiety doesn't entirely disappear with a 2mg dose, it's vastly more manageable. \r\n\r\nI haven't really noticed any side effects aside from feeling sleepy and having my mind wander a bit.\"", "June 29, 2016"]},
{"text": ["\"Taken it a few times/packets.. Found it did not much but was on other meds like concerta and suboxone...\r\n\r\nTaken now, at 2.5mg four times a day it's not xananx but it does the job if you are agitated or panicked\"", "June 29, 2016"]},
{"text": ["\"DO YOUR RESEARCH BEFORE TAKING! Consult with your doctor but also be aware of the side effects involved. Symptoms include dizziness, fatigue, muscle weakness, slowed speech, muscle spasms, twitching / fidgeting, nightmares. Not for everyone.\"", "June 26, 2016"]},
{"text": ["\"Works great!  Been suffering with anxiety for a while now was very hesitant on taking any kind of medication was given this medication in the hospital and within 20 minutes I felt relaxed and calm wish I wasn't so hesitant and took it sooner.  Great for when anxiety attack comes on\"", "June 3, 2016"]},
{"text": ["\"Helps take the edge off, but also works fairly quickly. I like it better than Xanax because it seems to last longer.\"", "June 2, 2016"]},
{"text": ["\"I take it as needed, I have depression and it gets out of control at time, I take 1 mg. and in 10 - 15 minutes I am ok.\"", "(taken for 1 to 2 years)", "May 29, 2016"]},
{"text": ["\"I have taken .05 mg 1/2 pill 2x a day as needed, usually just 1/2 pill before bed to ease anxiety to sleep, there have been times when I was having severe panic attacks & have used up to 2 pill a day. I have GAD & this pill have same me many times from running to the ER. Mental health is no joke. Being very sensitive to meds a small dose helps me, you will need to find what works best for you. Too high dose can cause drowsiness or put you to sleep. I also take Zoloft for anxiety & deoression. Been on these meds for 5 years now, it works for me! Talk to your doctor always, best to be prescribed by psychiatrist since they specialize in these matters. Good luck in your journey! Your never alone there's always help available if you seek it!! \"", "May 13, 2016"]},
{"text": ["\"This drug nearly ruined my life. But, you don't have to believe me. Just go google \"lorazepam withdrawal\" or \"ativan withdrawal\" and you can see it for yourself. I was never told how horrific the withdrawal would be from this medicine. I have spent nearly 5 months in extreme anxiety that is nearly 50 times the intensity of the anxiety I had when starting this med. The doctors are not educated on the w/d of this med because the pharm companies do not release these studies because then they wouldn't prescribe it! I became agitated, suicidal, depressed and PTSD-like symptoms from this drug. Not one person warned me and I just took it everyday like the bottle said, many times LESS than prescribed. PLEASE do your research!\"", "(taken for 2 to 5 years)", "May 2, 2016"]},
{"text": ["\"BEWARE!!  Some people have no problem with this benzodiazepine yet there are many who do such as myself.  I took it for hyper thyroid.  It has ruined the last 14 months of my life!!!  Words cannot express the mental and physical torture I experience daily. PLEASE Google Professor Ashton to read the side effects.  Visit Benzo Buddies.  You will learn about the horrors these meds cause as well as success stories of those who survived this!  There has been a bill introduced in Massachusetts to get doctors to warn their patients!!  Warn everyone you know!  Don't be fooled!  My world has been turned upside down and I don't want it to happen to you!!\"", "May 2, 2016"]},
{"text": ["\"This stuff is good. I use 0.5mg and i feel relaxed or 1mg if i have a panic attack. It helps alot and can help with sleep problems. I use it whenever i have anexity not everyday. Havent needed the stuff for 3 weeks so its not addicting for me at all.\"", "(taken for 1 to 6 months)", "April 21, 2016"]},
{"text": ["\"Unfortunately, this did nothing for me. It didn't matter how many I took, it didn't do anything for my panic attacks. It just made me a little sleepy.\"", "(taken for 1 to 6 months)", "April 20, 2016"]},
{"text": ["\"Helps with my high anxiety. I take 1mg twice a day and it controls my anxiety pretty well without impairing my motor skills too much.\"", "(taken for 1 to 6 months)", "April 19, 2016"]},
{"text": ["\"Took my first Ativan today and OMG I feel great this works amazing for shortness of breath difficulty breathing knots in the stomach, fear shakes sweats .... It's truly amazing I only took 0.5 and I'm happy I did I was afraid to take it but I'm not anymore it's a great miracle pill\"", "April 14, 2016"]},
{"text": ["\"Ativan has been SO SO helpful for anxiety and panic attacks.   It can be addicting so I try and only take it when I really need to;  not more than a couple times a week.  But it definitely has helped me and I would recommend it to those with bad anxiety.\"", "(taken for 1 to 6 months)", "April 13, 2016"]},
{"text": ["\"3 years ago we discovered a clot inside my heart. I went in for exploring surgery & awoke from a coma 33 days later, it had broke while being looked at & I had a mild heart attack on the table, had to be put into the coma to survive. To make things worse, I was also paralyzed from the waist down. It was too much & I had my 1st anxiety attack. Speed up to now: I've regained part of my ability to walk, it's painful & I can only walk so much. The clot is gone but I still take maintenance meds for it. Sadly I still suffer from regular panic but this drug works great. When I feel myself slipping I take an Ativan & feel better, breath easier, in less then an hour!\"", "(taken for 2 to 5 years)", "April 12, 2016"]},
{"text": ["\"I had very rare occasions of panic attacks up until last year, when I started the nursing program. 7 weeks in I was having a nervous breakdown crying in my doctor's arms and telling her she will never understand what I'm going through....She said no mam, no tears, try Zoloft consistently and lorazapam as needed. This lead to 1mg of lorazapam and 125mg of Zoloft DAILY! Fast forward to a 2 yrs later, I am a nurse, I still take my ordered dose and feel like I can handle any situation. This stuff really does work and keeps me from having any panic attacks.\"", "(taken for 2 to 5 years)", "April 7, 2016"]},
{"text": ["\"35 years on ativan\"", "March 28, 2016"]},
{"text": ["\"After getting into a car accident I fracturing my skull, broke my right arm, and dislocated 3 discs in my back. It led to 5 surgeries, and of course pain management. I got put on Opana 30 ER 2x daily, and Oxycodone 30mg IR 5x daily. The powerful Narcotics led to severe Nausea and Vomiting. I tried Zofran, Promethazine, Hydroxyzine, they worked, but not good enough. I finally got introduced to Ativan, got put on 1mg 3x daily. WOW is the best word to describe it. Now I'm pain free with ZERO nausea, thanks Ativan!\"", "(taken for 2 to 5 years)", "March 27, 2016"]},
{"text": ["\"This response is for the person whose Doctor won't prescribe Ativan because it's an old drug. I went to a psychiatrist and that's the med he prescribed for me to help me sleep through the night. It had been 3 months since I'd slept more the 6 hours and usually it was 4 hours each night. Ambien got me to sleep but wouldn't keep me asleep. My PCP prescribed trazadone and that was horrific. She then prescribed doxepin and that sedated me but never put me to sleep. After 3 months of this my PCP said for me to go to a psychiatrist to hear my symptoms and prescribe the right med. he got it spot on. By the second night I was sleeping like a baby and able to naps during the if I felt sleepy. I have gotten myself back. I also take Zoloft.\"", "(taken for less than 1 month)", "March 26, 2016"]},
{"text": ["\"I've taken Aleve and Vicodin for my sciatica pain with limited results. Taking lorazepam completely rids me of my hip/leg/back pain which is wonderful! I still have to remind myself to be easy on my hip and not try and clean the whole house because my pain is gone. I half a 1mg tablet so it doesn't sedate me. My intent is to not be completely knocked out. I want to be productive and it allows me that luxury. I know it's not generally prescribed for pain like this, but it sure as hell works for mine. I've had no adverse side effects and it really helps me get through the day without constant pain.\"", "March 25, 2016"]},
{"text": ["\"Instead of calming me down and relaxing me from my anxiety and panicky feelings it made them extremely worse. I thought I was going to loose my mind. Well actually for a brief time I did. It caused me to have a nervous breakdown. This was only on the second day I took it. I didn't know what was going on or what was happening. I thought I was going to loose my mind and before I knew it I slit one of my wrist. I have never had any intention of doing this before taking Ativan. Thankful help came and I got 8 staples put in my wrist were I cut it. I will never take this medicine ever again. I just warn to be very careful taking this medicine. I have never had any reactions to medicines before until this medicine I took back in Sept 16, 2015.\"", "March 24, 2016"]},
{"text": ["\"I take adavan for panic attacks caused by load noises or medical test and the dentist it is very effective within 30 minutes it makes me sleepy and relaxed. I get off balance and dizzy so I usually need help walking it is a great medication for panic attacks\"", "March 19, 2016"]},
{"text": ["\"I have previously had a problem with alcohol, and I have tried any non-benzo on the market but nothing has helped me with my anxiety attacks. I took lorazepam 0.5 mg for the first time yesterday. I had forgotten what it felt like not to be anxious. I was able to enjoy a few hours of not being afraid. I know it is not a long term fix, but now I know what I am striving for when I am thinking of getting healthy.\"", "(taken for less than 1 month)", "March 17, 2016"]},
{"text": ["\"I took my first 1mg dose recently and I have to say I'm pleasantly surprised. I was prescribed Ativan to take only as needed on the cusp of an anxiety attack, as I've been having a few lately. It absolutely took the sting out of the anxiety and left me feeling really chilled out, to the point of that really comfortable tiredness when you're super relaxed. I haven't felt that in a long time. I didn't have any gross side effects (except for the tiredness) and was able to enjoy the rest of my day :)\"", "March 15, 2016"]},
{"text": ["\"I started taking Xanax after the suicide of my son.  I was on it for quite a while but it didn't work so well after a while and I was not sleeping.  So I was put on Lorazepam.  2mg twice a day only I take them both at night with a 50mg amitrypline.  If I don't knock myself completely out I have horrible night terrors and nightmares.  I have been on this dose for about 2 years now.  How can I get out of this?  Whereas time has by no means made it \"easier to deal with\" I know I will need to be on something for sleep but an now worried about the long term affects.  I am also worried about it showing up on drugs tests.\"", "March 13, 2016"]},
{"text": ["\"I am a 47 year old male and within one year I've developed a anxiety disorder.  I work as a controls engineer in the automotive field so stress and tennage kids pushed me to the brink.  The anxiety is up and down now largely due to fear of that weird derealization feeling I get.  Ativan is amazing its able snap me back into a calm and rational  state when the anxiety is at its peak.  I was originally concerned about its dependence but I believe self management can eliminate that.  I am on 5mg of escitalopram but find it really doesn't seem to have any effect.  Hang tough fellow anxiety brothers and sisters... Anxiety Sucks\"", "March 9, 2016"]},
{"text": ["\"I take 0.5-1mg for times of unmanageable anxiety or panic attacks. This happens a few times a year. Very effective medication with no side effects for me. I've been taking it since I was 26, I'm now 30.\"", "March 7, 2016"]},
{"text": ["\"This drug has saved my life, I take 1 mg twice daily, I have severe anxiety and panic disorder that leads me to never leaving the house bc I'm scared of everything. This drug dug me out of a deep anxiety phase that was leading to very serious depression I was scared to tell my doctor that I was gonna kill myself if they didn't find something that worked I tried about 14 other meds with little to no success. Before my doctor said I'm gonna try you on ativan and see how it helps with my drug history this was a last choice kind of thing. He warned me about the potential for abuse and addiction, I'm aware of it and I never abuse the drug. I've been using ativan for 2-3 months now and I'm finally back into the work force finally able to drive again\"", "(taken for 1 to 6 months)", "February 27, 2016"]},
{"text": ["\"Avoid Benzos. I'm an alcoholic now, thanks to Lorazepam addiction. They leave a mark on you. Lorazepam was my vice. Again, avoid benzos. It can't end well. Benzos are a one way street.\"", "February 26, 2016"]},
{"text": ["\"I started taking Ativan in 1997. My first and only time in a psychiatric ward.  I was diagnosed with panic attacks.  When I first started taking them the first 3 days were an absolute nightmare.  I was getting more side effects being on them than without.  I told the doctor and he told me to give it a few day and that this side effect would go away.  I was literally going to sleep (in and out of sleep?) with a bible in my arms.  Finally the 3rd day it did start to take effect and my panic became less frightening.  I started in 1997 @ .5 MG 3xday and now in 2015 I take 1mg 3xday.  It has never given me a problem except for those fee days when I started the dosage.\"", "February 25, 2016"]},
{"text": ["\"I was just diagnosed in my 40's with generalized anxiety disorder not surprised.  I was always having anxiety/panic attacks and unable to function some times.  I now take Celexa daily and while it takes about 2 months to really kick in my anxiety is gone and I feel FAR beyond how I have felt in forever.  Zoloft nor prozac worked.  I don't know they are truly geared towards anxiety.  High;y recommend it at 10mg if not feeling better.\"", "February 24, 2016"]},
{"text": ["\"I have had to take this medication (when I try my hardest to stay away from meds) on a few occasions everytime its only taken .2 or .5mg to relieve my panic attack! I love it except my Dr won't prescribe me anymore for those just in case times and I don't want to go on an antidepressant. I don't know if its just my depression but I feel lack of motivation and very tired but that could have to do with it being a sedative too. Would suggest to anyone that just can't control the anxiety and panic.\"", "February 21, 2016"]},
{"text": ["\"I recently started getting anxiety. It started very slow and began to get worse. I went to hospital very anxious one day. They did all test and as I already knew found nothing. I asked for something to calm me down. They gave me 1.0mg Ativan IV. The minute the nurse pulled the needle out I was ready to go home as if nothing happen. Slept like a baby that night .I was good for like 4 days until I started to feel anxious again. I just started Zoloft today which takes some 1 or 2 weeks to work and Ativan for in case I get another attack before Zoloft kicks in. For me Ativan has been great.\"", "February 15, 2016"]},
{"text": ["\"Saved my life and made my life managable. So far superior to numerous SSRI's, SSNI's, off label gabapentim. serax, than any of the 10 other anti depressants I tried. Wasted 3 years of my life. May be addictive for addicts & alcohol abusers but if taken as prescribed I've had minimal side effects. I'm not dizzy, falling, etc.\"", "February 15, 2016"]},
{"text": ["\"I took the first 0.5 mm lorazepam and it got me super sleepy in the evening while watching TV. Lucky it was night because I was zonked. The next day I right away experienced withdrawal, yuck. I hate that feeling. I would have had to take another one just to get rid of the withdrawal from the first one. And maybe after a few days the withdrawal symptoms would settle down but I didn't think I should be getting withdrawal immediately like that. And I certainly didn't want to think about going through it in the future even stronger symptoms. So the first one was all I took. I wised up quickly and didn't continue taking them. I felt dizzy and crappy for two or three days just from that one pill. Unreal.\"", "February 10, 2016"]},
{"text": ["\"This is a fantastic medication. It is far less sedating than Clonazepam, and it also doesn't cause the \"loopiness\" that Clonazepam does.\"", "(taken for 1 to 6 months)", "February 8, 2016"]},
{"text": ["\"I have chronic fatigue syndrome and fibromyalgia along with all the other issues that come with it. Anxiety  & stress easily are two of the things. Ativan over Xanax for me big time for some reason Xanax would make my ankles swell? Then I tried Ativan and it worked great I put under my tongue and it melts under there and helps me within 15 minutes. I can go some weeks/months without ever taking it and then If I have a bad issue with the family or a panic attack from a flare it works fabulous.  The most I've had to take it was 10 days in a row. I've had a prescription since 2004 and it's 2016 I get 30 1.mg a month.  I don't use them all but I do  get a refill every couple months just to have some on hand.\"", "February 6, 2016"]},
{"text": ["\"This medication helped me so much no side effects. But if your struggling with anxiety like I was please check to see if you have food allergies struggled with anxiety for more then 5 years switch doctors found out I've had a gluten allergy that cause's anxiety and other systems. Please check it out I wish I knew sooner! Best of luck!\"", "January 25, 2016"]},
{"text": ["\"I have PTSD with panic attacks. When these come on it's terrifying to say the least! I take half a tablet and about 30 mins later I am calm. It has truly been a life saver for me. Like a lot of people here I went to the ER 3 times thinking I was dying all tests revealed nothing wrong with me.\"", "(taken for 5 to 10 years)", "January 22, 2016"]},
{"text": ["\"I have been on this as needed for the last 4 years. I started at 0.5mg and am currently at 1mg. I only take when needed and have not had any negative side affects. I only wish it actually lasted longer. Roughly last for 30 to 40 min. I have taken to help sleep, I am a war vet and it helps to calm down the hyper vigilance. I have seen people struggle coming off of this, but they \"usually\" are the ones abusing it.  It is not an everyday med.\"", "January 17, 2016"]},
{"text": ["\"I had a stroke and so I had to have an MRI.  This is something I had feared my whole adult life (because of claustrophobia) and wondered if I would even consent to it.  They gave me an ativan and the whole experience was easy and uneventful.  It was not prescribed long term, just for that single event.  Under those circumstances I would rate it a 10.\"", "January 14, 2016"]},
{"text": ["\"Was out on this drug in '93.  Although it helps I know I shouldn't have been given this for so long.  What can I do to wean off.  I never took it as prescribed  I was told to take 3 only take 2.\"", "(taken for 10 years or more)", "January 13, 2016"]},
{"text": ["\"Had anxiety and insomnia that I could not control due to ptsd and chronic pain lorazipam controls my symptoms unlike the other 6 meds they tried before lorazipam\"", "(taken for 6 months to 1 year)", "October 8, 2015"]},
{"text": ["\"Well, I've also been on zanies, clanazepapam.  I found that lorazepam is for longer term maintenance of  anxiety - Not panic attacks. I just got off of 2mg. 3x a day. Just cause it wasn't helpful. But it does work.\"", "September 26, 2015"]},
{"text": ["\"I had a scary adverse reaction with Ativan. I was given 1 mg in the hospital orally for the very bad anxiety I was having. About an hour and a half later I began getting the most strangest, scariest hallucinations. Both visual and sensory. I don't know if this was an allergic reaction but I never had this problem with any other benzodiazepine. Please be cautious with Ativan in particular, because it altered the functioning of my brain (it wore off the next day).\"", "(taken for less than 1 month)", "September 19, 2015"]},
{"text": ["\"had severe anxiety attack, was given by the ER. one 1mg did the trick. my pshyciatrist gave me 10 more to use in emergency.\"", "September 18, 2015"]},
{"text": ["\"I have been taking Ativan for 20 years. It was prescribed for me when my husband was in hospice care and I was struggling to care for him and our young daughters. I have GAD and it is the only thing that calms my mind and makes me feel normal if I am in high anxiety mode. I have reduced my amount needed to one half of the .5 pill to help sleep and the other half if I wake up too early and cannot get back to sleep. I also use it to fly. I have no hangovers and never feel fuzzy. It is a miracle drug for me.\"", "September 16, 2015"]},
{"text": ["\"This medicine has saved my life on several occasions.  I developed physical anxiety issues (severe tingling, losing balance, trouble driving, insomnia, etc) a year after my 3rd child was born.  My physician tried several SSRI and tricyclic antidepressants.  They all made my symptoms worse.  Ativan/Lorazepam helped immediately for all symptoms.  In my opinion it is a miracle and I hate how it is demonized in the media and medical community.  When you suffer a month without sleeping hardly at all and can barely function in a normal setting due to crippling physical anxiety symptoms, and something provides relief, you take it.  Yes, when you are ready to stop the medicine you have to reduce very slowly over a long period of time.  Godsend!\"", "September 9, 2015"]},
{"text": ["\"This helped me so much. I felt like my heart was beating out of my chest!!!!!!!! I went to hospital they gave it to me and it went away. OMG thank you ativan!\"", "September 7, 2015"]},
{"text": ["\"Ativan was prescribed inpatient to me.  After major suicidal ideations and an active plan, I was given this to take when required ( about 3 to 4 mg a day ) inpatient.  I am on Lamictal, Lexapro and ritalin also Seroquel as needed for sleep, plus Ativan 1 mg when required.  I usually take 1 mg in the evening.  Works great!  Very subtle compared to Klonopin, Valium and Xanax.  I would rank Xanax as number 1, Ativan number 2, Valium 3 and Klonopin a close 3rd but 4th.  Give Ativan about 1.5 hours to feel effects, it takes about 2 hours to peak and lasts about 8 for me.  Doesn't pack a 'punch' like Xanax or Valium but it is noticeable.  It also seems to help depression somewhat!  Whereas others can drag u down.\"", "(taken for 6 months to 1 year)", "September 6, 2015"]},
{"text": ["\"Doesn't work for me. Been taking it for 6 months,  1 mg 2x a day. It makes my head really fuzzy.\"", "(taken for 1 to 6 months)", "September 4, 2015"]},
{"text": ["\"Wonderful takes stress away\"", "August 28, 2015"]},
{"text": ["\"I have been experiencing terrible anxiety/panic attacks over the last year or so.  It all began with my husband's motorcycle accident that led to PTSD followed by panic attacks.  Horrific.  I landed in the ER on two separate occasions convinced I was going to die.  Now that my husband is back to normal I was hoping my anxiety would go away but that is not the case.  I am seeing a therapist and a psychiatrist prescribed Effexor and I had really scary reaction to it--like a panic attack on crack.  I have sensitivity to SSRIs, it seems.  So, now I take Lorazepam as needed and it does help me calm down and is especially useful at bedtime.  I only take .5 and it has helped a lot when I've needed to stop the racing thoughts before bed.\"", "August 28, 2015"]},
{"text": ["\"I suffer from panic disorder and generalized anxiety disorder and ocd.\r\nI take 1mg twice daily and am on 40mg of prozac.My disorders are quite severe and on a bad day im housebound.The lorazapem does work well but i do get bad withdrawal in the morning which involves being very anxious for bout an hour or so till my meds kick in which im going to try some different courses of action to try and counter this.Im 36 yrs old and a solo dad so getting well for my son is a big priority for me! My heart goes out to all the anxiery sufferers out there and i suppose we can all hope that we can get the right balance of meds that helps us without to many side effects and be as well as possible! So overall review of this drug is 7/10 good luck!\"", "(taken for 1 to 6 months)", "August 24, 2015"]},
{"text": ["\"I had a very alarming ADVERSE REACTION to Ativan (Lorazepam), that I never had with any other benzodiazepine, that I'd like to share. My doctor prescribed me 0.5mg of Ativan for my anxiety that I've had since a child. Within an hour of taking my first dose I began to experience SCARY hallucinations, delusions, and paranoia. This never happened whenever I took Xanax, Valium, or Klopin, so I don't know what made Ativan different. \n      Not only did Ativan increase my anxiety, but it also caused these disturbing adverse side effects! I personally did not have a good experience with this drug, and threw the rest away. Please be very careful with it!\"", "August 23, 2015"]},
{"text": ["\"I'm 19 and this anxiety and OCD had been poured on me out of no where. It scared me so bad I felt like I couldn't live my life. I went to the ER and they prescribed me Ativan 1 mg 3 times a day. It was extremely effective. The first week I was only taking half or sometimes 2. I've been on it for 3 weeks and am waiting to get on a SSRIs for more long term. Ativan is helping me through my days. I am just nervous about withdrawals because I don't take them as prescribed only as needed.\"", "August 20, 2015"]},
{"text": ["\"Ativan is a miracle drug. Whoever invented it should have received the Nobel Prize. Zero adverse effetcs, completely safe. I am going through chemo and my beloved old companion cat which I had for over 14 years died after many months of poor health. I felt gripping anxiety for weeks, it felt like my chest was going to explode. I was faced with vet bills and wasn't working. Ativan worked in less than an hour, I felt such relief, and only after 1mg. I take it once, sometimes twice, a day and my life is bearable. Please don't suffer. If you experience anxiety ask you Dr for Ativan, even 0.5 mg may work.\"", "August 16, 2015"]},
{"text": ["\"Lorazepam works great for my anxiety with no side effects.\"", "(taken for 1 to 2 years)", "August 7, 2015"]},
{"text": ["\"I am 37 and suffered a rare type of heart attack called a spontaneous coronary artery dissection in my LAD (the widow maker). I have no heart disease. I have perfect blood pressure and blood lipids, includes by HDL, LDL, cholesterol, trig, etc. after my HA and based in both the rarity of my event and the mortality rate (80%) I have severe anxiety. I am trying to stop worrying and learn to love my broken heart. This drug saves me weekly. It doesn't mask cardiac distress so I take it when my chest feels right and within 5 min I'm fine. It's 4 dollars cash for a 30 day RX. I take .25 mg by biting a half pull into a fourth. Life saver. It's going to save my career too. This drug has saved my life.\"", "August 5, 2015"]},
{"text": ["\"Extreme weakness, nausea, problems with memory, lethargic, slow reaction times, constant thirst, stay anxious, very sleepy during the day, no energy, wears off quick, soars at both corners of mouth, dizziness and confusion.\"", "August 5, 2015"]},
{"text": ["\"I have been having trouble with anxiety and for more than 30yr.  I have tried everything. My Dr. put me on lorazepam and don't know if going to work.\"", "June 27, 2015"]},
{"text": ["\"I am taking 1mg 4x daily. I have had some deaths in my family and have been more anxious. Should my dose be increased?\"", "(taken for 2 to 5 years)", "June 21, 2015"]},
{"text": ["\"worked great when I started...a year later taking 1mg in the am and 1mg at night...and anxiety is back...interferes with work...\"", "May 27, 2015"]},
{"text": ["\"Thank God for Ativan. Even though when the stressful situation came up, instead of having a panic attack I was able to stop it with the calm. I do wish it could erase those trigger moments but I'm so glad I can stop them and manage them better with Ativan.  I also really like that I can take it on a work day with no side effects or that fuzzy high feeling.  It has not affected my sleep or anything else. It's a lifesaver for me. I'm back!\"", "(taken for less than 1 month)", "May 21, 2015"]},
{"text": ["\"The doctors put my dad who is 95 on Lorazepam  because of anxiety but it takes a long time to get in the system, he takes 2 a day and has been for about 8 months and it does not help, if given right at the start of an anxiety attack it takes over an hour to work and then it hardly works at all, and as he has 2 a day you would think it would keep him from having anxiety or at least make it more mild.\"", "May 20, 2015"]},
{"text": ["\"Lifesaver for adrenaline rush feelings. The smallest dose cut in half makes me feel calm, slows my racing heart and heart palpitations, and puts me to sleep. I couldn't have survived lyme disease without it. The only bad things are it will make you tired and after being on it for 2 weeks straight, you're likely to have rebound anxiety. If you have long term anxiety SSRIs are the best choice.\"", "May 14, 2015"]},
{"text": ["\"I have GAD and panic attacks. I use celexa 20 MG as my first line and ativan 0.5 twice daily if I need it. I occasionally take it at night when my mind races and won't shut down. Celexa has my anxiety under good control but ativan is my just in case med.\"", "May 8, 2015"]}
]